---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\10_an_interaction
> _cox_models_sex_covid_tpp_prob.log
  log type:  text
 opened on:   8 Sep 2020, 18:01:08

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHN
> ICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interactio
> n(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6. cap stcox       `exposure'                                                  
>             ///
>                         $demogadjlist                                          
>          ///
>                         $comordidadjlist                                       
>          ///
>                         `interaction'                                          
>          ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *******************************************************************************
> ******
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clea
> r
  3.         
. foreach int_type in  male  {
  4. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  5. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  6. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`i
> nt_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
  7. if _rc==0{
  8. testparm 1.`int_type'#i.`exposure_type'
  9. di _n "`exposure_type' " _n "****************"
 10. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 11. di "`exposure_type'" _n "****************"
 12. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 13. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_
> `int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 14. }
 15. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. }
 18. }
   1:   8528.21 /        1 =    8528.2120
   1:   8558.87 /        1 =    8558.8720

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =   27.77
         Prob > chi2 =    0.0000

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.244483   .0247694    10.99   0.000      1.19687    1.293989
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.168148   .0335979     5.40   0.000     1.104119    1.235891
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_male_MAIN
> FULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_male_MAINFULLYAD
> JMODEL_agespline_bmicat_noeth_ageband_0.ster saved
   1:   1887.44 /        1 =    1887.4380
   1:   1944.59 /        1 =    1944.5910

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =    1.33
         Prob > chi2 =    0.5148

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.084847   .0806031     1.10   0.273     .9378318    1.254908
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9406998   .1043064    -0.55   0.581      .756952    1.169052
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_male_MAIN
> FULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_male_MAINFULLYAD
> JMODEL_agespline_bmicat_noeth_ageband_1.ster saved

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clea
> r
  3. keep if tot_adults_hh==1        
  4. foreach int_type in  male  {
  5. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  6. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  7. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`i
> nt_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
  8. if _rc==0{
  9. testparm 1.`int_type'#i.`exposure_type'
 10. di _n "`exposure_type' " _n "****************"
 11. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 12. di "`exposure_type'" _n "****************"
 13. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 14. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_
> `int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 15. }
 16. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 17. 
. }
 18. }
 19. }
(9,227,938 observations deleted)
   1:   1484.97 /        1 =    1484.9750
   1:   1546.93 /        1 =    1546.9310

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =    1.38
         Prob > chi2 =    0.5007

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.185412   .1001013     2.01   0.044     1.004593    1.398776
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.190881   .1419339     1.47   0.143     .9427983    1.504243
------------------------------------------------------------------------------
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_male_MAINFULLYAD
> JMODEL_agespline_bmicat_noeth_ageband_0.ster saved
(2,285,270 observations deleted)
   1:    519.43 /        1 =     519.4340
   1:    535.46 /        1 =     535.4620

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =    1.34
         Prob > chi2 =    0.5116

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.166196   .5218875     0.34   0.731     .4851186    2.803464
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2727554   .2730067    -1.30   0.194     .0383519     1.93981
------------------------------------------------------------------------------
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_male_MAINFULLYAD
> JMODEL_agespline_bmicat_noeth_ageband_1.ster saved

. 
. 
. log close
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\10_an_interaction
> _cox_models_sex_covid_tpp_prob.log
  log type:  text
 closed on:   9 Sep 2020, 00:58:27
---------------------------------------------------------------------------------
