---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\10_an_interaction
> _cox_models_sex_covid_icu.log
  log type:  text
 opened on:   8 Sep 2020, 18:01:09

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHN
> ICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interactio
> n(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6. cap stcox       `exposure'                                                  
>             ///
>                         $demogadjlist                                          
>          ///
>                         $comordidadjlist                                       
>          ///
>                         `interaction'                                          
>          ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *******************************************************************************
> ******
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clea
> r
  3.         
. foreach int_type in  male  {
  4. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  5. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  6. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`i
> nt_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
  7. if _rc==0{
  8. testparm 1.`int_type'#i.`exposure_type'
  9. di _n "`exposure_type' " _n "****************"
 10. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 11. di "`exposure_type'" _n "****************"
 12. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 13. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_
> `int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 14. }
 15. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. }
 18. }
   1:   4490.40 /        1 =    4490.4010
   1:   4362.45 /        1 =    4362.4530

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =    6.02
         Prob > chi2 =    0.0492

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.28271   .1038917     3.07   0.002     1.094426    1.503387
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.298704   .1280184     2.65   0.008     1.070543    1.575493
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_icu_kids_cat3_male_MAINFULLY
> ADJMODEL_agespline_bmicat_noeth_ageband_0.ster not found)
file ./output/an_interaction_cox_models_covid_icu_kids_cat3_male_MAINFULLYADJMODE
> L_agespline_bmicat_noeth_ageband_0.ster saved
   1:   2182.23 /        1 =    2182.2300
   1:   2261.68 /        1 =    2261.6820

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =    0.71
         Prob > chi2 =    0.7007

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.027054    .253495     0.11   0.914     .6331431    1.666038
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.363204   .4223814     1.00   0.317     .7427126     2.50208
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_icu_kids_cat3_male_MAINFULLY
> ADJMODEL_agespline_bmicat_noeth_ageband_1.ster not found)
file ./output/an_interaction_cox_models_covid_icu_kids_cat3_male_MAINFULLYADJMODE
> L_agespline_bmicat_noeth_ageband_1.ster saved

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clea
> r
  3. keep if tot_adults_hh==1        
  4. foreach int_type in  male  {
  5. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  6. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  7. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`i
> nt_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
  8. if _rc==0{
  9. testparm 1.`int_type'#i.`exposure_type'
 10. di _n "`exposure_type' " _n "****************"
 11. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 12. di "`exposure_type'" _n "****************"
 13. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 14. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_
> `int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 15. }
 16. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 17. 
. }
 18. }
 19. }
(9,227,938 observations deleted)
   1:    661.04 /        1 =     661.0430
   1:    676.19 /        1 =     676.1870

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =    1.34
         Prob > chi2 =    0.5123

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.022379   .3765577     0.06   0.952     .4967083    2.104371
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.101537   .4579698     0.23   0.816      .487649     2.48823
------------------------------------------------------------------------------
file ./output/an_interaction_cox_models_covid_icu_kids_cat3_male_MAINFULLYADJMODE
> L_agespline_bmicat_noeth_ageband_0.ster saved
(2,285,270 observations deleted)
   1:    667.82 /        1 =     667.8240
   1:    706.28 /        1 =     706.2770

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   7.80e-20          .        .       .            .           .
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.395373   3.412899     1.22   0.224     .4734698    24.34909
------------------------------------------------------------------------------
file ./output/an_interaction_cox_models_covid_icu_kids_cat3_male_MAINFULLYADJMODE
> L_agespline_bmicat_noeth_ageband_1.ster saved

. 
. 
. log close
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\10_an_interaction
> _cox_models_sex_covid_icu.log
  log type:  text
 closed on:   8 Sep 2020, 22:28:41
---------------------------------------------------------------------------------
