---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\10_an_interaction
> _cox_models_sex_covidadmission.log
  log type:  text
 opened on:   8 Sep 2020, 18:01:10

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHN
> ICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interactio
> n(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6. cap stcox       `exposure'                                                  
>             ///
>                         $demogadjlist                                          
>          ///
>                         $comordidadjlist                                       
>          ///
>                         `interaction'                                          
>          ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *******************************************************************************
> ******
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clea
> r
  3.         
. foreach int_type in  male  {
  4. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  5. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  6. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`i
> nt_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
  7. if _rc==0{
  8. testparm 1.`int_type'#i.`exposure_type'
  9. di _n "`exposure_type' " _n "****************"
 10. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 11. di "`exposure_type'" _n "****************"
 12. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 13. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_
> `int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 14. }
 15. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. }
 18. }
   1:   4631.45 /        1 =    4631.4550
   1:   4467.83 /        1 =    4467.8300

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =   13.59
         Prob > chi2 =    0.0011

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.153736   .0547925     3.01   0.003     1.051191    1.266284
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.343049   .0777641     5.09   0.000     1.198965    1.504449
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat3_male_MAIN
> FULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat3_male_MAINFULLYAD
> JMODEL_agespline_bmicat_noeth_ageband_0.ster saved
   1:   1119.34 /        1 =    1119.3360
   1:   1149.53 /        1 =    1149.5290

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =    1.61
         Prob > chi2 =    0.4461

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.005168   .0978683     0.05   0.958     .8305411     1.21651
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9311177   .1330196    -0.50   0.617     .7037231     1.23199
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat3_male_MAIN
> FULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat3_male_MAINFULLYAD
> JMODEL_agespline_bmicat_noeth_ageband_1.ster saved

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clea
> r
  3. keep if tot_adults_hh==1        
  4. foreach int_type in  male  {
  5. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  6. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  7. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`i
> nt_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
  8. if _rc==0{
  9. testparm 1.`int_type'#i.`exposure_type'
 10. di _n "`exposure_type' " _n "****************"
 11. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 12. di "`exposure_type'" _n "****************"
 13. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 14. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_
> `int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 15. }
 16. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 17. 
. }
 18. }
 19. }
(9,227,938 observations deleted)
   1:    754.04 /        1 =     754.0380
   1:    811.90 /        1 =     811.8980

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =    3.61
         Prob > chi2 =    0.1645

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8664352   .1944533    -0.64   0.523     .5580866    1.345149
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.138542   .2809966     0.53   0.599     .7018907    1.846839
------------------------------------------------------------------------------
file ./output/an_interaction_cox_models_covidadmission_kids_cat3_male_MAINFULLYAD
> JMODEL_agespline_bmicat_noeth_ageband_0.ster saved
(2,285,270 observations deleted)
   1:    319.17 /        1 =     319.1690
   1:    327.03 /        1 =     327.0310

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =    0.67
         Prob > chi2 =    0.7142

kids_cat3 
****************

 ( 1)  1.kids_cat3 + 1.male#1.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3385809   .3394402    -1.08   0.280      .047457    2.415596
------------------------------------------------------------------------------
kids_cat3
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4458552   .4459904    -0.81   0.419     .0627674     3.16704
------------------------------------------------------------------------------
file ./output/an_interaction_cox_models_covidadmission_kids_cat3_male_MAINFULLYAD
> JMODEL_agespline_bmicat_noeth_ageband_1.ster saved

. 
. 
. log close
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\10_an_interaction
> _cox_models_sex_covidadmission.log
  log type:  text
 closed on:   8 Sep 2020, 21:48:02
---------------------------------------------------------------------------------
