------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense2_covid_death_icu.log
  log type:  text
 opened on:   3 Sep 2020, 16:27:27

. 
. *set trace on
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. foreach exposure_type in        kids_cat3  {
  4.  
. *Complete case ethnicity model
.         capture stcox   i.`exposure_type'                       ///
>                         $demogadjlist                           ///
>                         $comordidadjlist                        ///
>                         , strata(stp) vce(cluster household_id)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_CCeth_bmi_smok_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 10.  
.  }
 11.  
.  }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    7,362,311             Number of obs    =   7,362,311
No. of failures      =        1,870
Time at risk         =   1353794559
                                                Wald chi2(48)    =     7307.30
Log pseudolikelihood =   -21531.884             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 5,093,691 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8553623   .0621858    -2.15   0.032     .7417657    .9863554
               Kids under 18  |   .9388544   .0819672    -0.72   0.470     .7911951    1.114071
                              |
                         age1 |   1.112236   .0323101     3.66   0.000     1.050678      1.1774
                         age2 |   .9491081     .06154    -0.81   0.420     .8358415    1.077724
                         age3 |   1.061843   .1650833     0.39   0.700      .782934    1.440109
                       1.male |   2.043111   .1038992    14.05   0.000     1.849291    2.257243
                              |
                       bmicat |
          Normal (18.5-24.9)  |   .5014636   .1037971    -3.33   0.001      .334234    .7523644
        Overweight (25-29.9)  |   .6531722   .1334743    -2.08   0.037     .4376093    .9749198
           Obese I (30-34.9)  |   .9741687    .200868    -0.13   0.899     .6503113    1.459308
          Obese II (35-39.9)  |    1.42109   .2990889     1.67   0.095     .9407492    2.146689
             Obese III (40+)  |   2.027092    .435213     3.29   0.001     1.330829    3.087628
                              |
                        smoke |
                      Former  |   1.013947   .0524343     0.27   0.789     .9162143    1.122105
                     Current  |   .5285803   .0413493    -8.15   0.000     .4534443    .6161662
                              |
                    ethnicity |
                       Mixed  |    2.79672   .4129939     6.96   0.000     2.093878    3.735481
      Asian or Asian British  |   2.569594   .1973589    12.29   0.000     2.210485    2.987043
                       Black  |   2.697587   .2548539    10.50   0.000     2.241601    3.246329
                       Other  |   2.547603    .329619     7.23   0.000     1.976969    3.282945
                              |
                          imd |
                           2  |   1.135878   .1017346     1.42   0.155     .9530027    1.353847
                           3  |   1.227997   .1070754     2.36   0.019     1.035086     1.45686
                           4  |   1.522405   .1267809     5.05   0.000     1.293138    1.792319
             5 most deprived  |    1.53198   .1337183     4.89   0.000     1.291089    1.817816
                              |
                tot_adults_hh |
                           2  |   .8448459   .0527268    -2.70   0.007     .7475739    .9547748
                           3  |   1.073583     .06602     1.15   0.248     .9516801    1.211101
                              |
           1.htdiag_or_highbp |    1.33014   .0722482     5.25   0.000     1.195813    1.479556
1.chronic_respiratory_disease |   2.610205   .2101792    11.92   0.000     2.229123    3.056435
                     1.asthma |   1.128149   .0674705     2.02   0.044     1.003366    1.268451
    1.chronic_cardiac_disease |   1.342431    .098043     4.03   0.000     1.163391    1.549026
                              |
                      diabcat |
            T1DM, controlled  |   1.573922   .5970527     1.20   0.232     .7483211    3.310386
          T1DM, uncontrolled  |   2.934854    .543545     5.81   0.000     2.041461    4.219218
            T2DM, controlled  |   1.674675   .1250834     6.90   0.000     1.446616    1.938687
          T2DM, uncontrolled  |   2.585571   .1876076    13.09   0.000     2.242817    2.980706
          Diabetes, no HbA1c  |   2.883401   1.183609     2.58   0.010     1.289719    6.446369
                              |
            cancer_exhaem_cat |
                   Last year  |   3.955101   .6857629     7.93   0.000     2.815596    5.555777
               2-5 years ago  |   1.969634   .2849846     4.68   0.000     1.483289    2.615442
                    5+ years  |   1.274772   .1835696     1.69   0.092     .9612976    1.690469
                              |
              cancer_haem_cat |
                   Last year  |   5.243043   2.017559     4.31   0.000      2.46624    11.14632
               2-5 years ago  |   4.311379   1.104094     5.71   0.000     2.609957    7.121952
                    5+ years  |   2.138537   .5208327     3.12   0.002     1.326813     3.44686
                              |
      1.chronic_liver_disease |   2.259385   .2961337     6.22   0.000      1.74753    2.921163
            1.stroke_dementia |   1.773459   .1910188     5.32   0.000     1.435947    2.190302
                1.other_neuro |   2.717162   .3720457     7.30   0.000     2.077616    3.553578
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.134965   .1926009     8.41   0.000     1.788964    2.547885
           Stage 4/5 egfr<30  |   3.107215   .6363303     5.54   0.000     2.079949    4.641837
                              |
                       1.esrd |   3.485913   .7052516     6.17   0.000     2.344801    5.182355
           1.other_transplant |   .8767893   .4166931    -0.28   0.782     .3454321    2.225501
                   1.asplenia |    2.17329   .6762025     2.49   0.013     1.181062    3.999102
           1.ra_sle_psoriasis |   1.244379   .1076641     2.53   0.012     1.050283    1.474344
               1.other_immuno |   1.699852    .357965     2.52   0.012     1.125019    2.568398
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_CCeth_bmi_smok_ageband_0.ster saved

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,304,929             Number of obs    =   2,304,929
No. of failures      =        5,876
Time at risk         =    420272652
                                                Wald chi2(48)    =    12158.90
Log pseudolikelihood =   -63075.032             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 1,842,795 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8946148   .0841981    -1.18   0.237     .7439159    1.075841
               Kids under 18  |   .8526881     .11338    -1.20   0.231     .6570643    1.106554
                              |
                         age1 |   1.042843   .0173894     2.52   0.012     1.009311    1.077489
                         age2 |   1.202361   .0782039     2.83   0.005     1.058452    1.365837
                         age3 |   .6456629   .1061454    -2.66   0.008     .4678109    .8911306
                       1.male |   1.762652    .050501    19.78   0.000       1.6664    1.864464
                              |
                       bmicat |
          Normal (18.5-24.9)  |   .5676525   .0398511    -8.07   0.000     .4946812    .6513879
        Overweight (25-29.9)  |   .4711877   .0335267   -10.58   0.000     .4098527    .5417015
           Obese I (30-34.9)  |   .6103223     .04526    -6.66   0.000     .5277596     .705801
          Obese II (35-39.9)  |   .8245363   .0681201    -2.34   0.020     .7012724    .9694665
             Obese III (40+)  |   1.039768   .1019102     0.40   0.691     .8580409    1.259983
                              |
                        smoke |
                      Former  |   1.260052     .03876     7.51   0.000     1.186328    1.338357
                     Current  |    1.08813   .0634057     1.45   0.147     .9706906    1.219777
                              |
                    ethnicity |
                       Mixed  |   1.232577   .2263622     1.14   0.255     .8599859    1.766594
      Asian or Asian British  |   1.504646   .0909971     6.76   0.000      1.33646    1.693998
                       Black  |    1.26584   .1175838     2.54   0.011     1.055141    1.518612
                       Other  |   1.094546   .1575781     0.63   0.530     .8254477    1.451372
                              |
                          imd |
                           2  |   1.114847   .0487236     2.49   0.013     1.023326    1.214553
                           3  |   1.177955   .0517966     3.72   0.000     1.080687    1.283977
                           4  |   1.386917   .0606679     7.48   0.000     1.272964     1.51107
             5 most deprived  |   1.526049   .0705195     9.15   0.000     1.393908    1.670717
                              |
                tot_adults_hh |
                           2  |   .7912089   .0243565    -7.61   0.000     .7448826    .8404162
                           3  |   1.014336    .045858     0.31   0.753     .9283232    1.108319
                              |
           1.htdiag_or_highbp |   .9317232   .0311158    -2.12   0.034     .8726905    .9947492
1.chronic_respiratory_disease |   1.685236   .0536886    16.38   0.000     1.583226    1.793818
                     1.asthma |   1.050107   .0385235     1.33   0.183     .9772528    1.128392
    1.chronic_cardiac_disease |   1.345104   .0385142    10.35   0.000     1.271696    1.422749
                              |
                      diabcat |
            T1DM, controlled  |   1.745272   .4328542     2.25   0.025     1.073376     2.83775
          T1DM, uncontrolled  |   2.633755   .3964125     6.43   0.000     1.960916    3.537461
            T2DM, controlled  |   1.439207   .0480035    10.92   0.000     1.348132    1.536436
          T2DM, uncontrolled  |   1.936398   .0800164    15.99   0.000     1.785752    2.099753
          Diabetes, no HbA1c  |   1.907226   .6092659     2.02   0.043     1.019729    3.567136
                              |
            cancer_exhaem_cat |
                   Last year  |   2.226855   .1789482     9.96   0.000     1.902349    2.606717
               2-5 years ago  |   1.230111   .0766086     3.33   0.001     1.088763    1.389809
                    5+ years  |   1.062169   .0435285     1.47   0.141     .9801912    1.151003
                              |
              cancer_haem_cat |
                   Last year  |   3.062623   .5719682     5.99   0.000     2.123856    4.416334
               2-5 years ago  |   2.529822   .2961459     7.93   0.000      2.01116    3.182243
                    5+ years  |   1.517727   .1572829     4.03   0.000     1.238748    1.859534
                              |
      1.chronic_liver_disease |   2.019079   .1837909     7.72   0.000     1.689161    2.413436
            1.stroke_dementia |   1.709552   .0585441    15.66   0.000     1.598574    1.828235
                1.other_neuro |   2.402028   .1389105    15.15   0.000     2.144632    2.690318
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.332558   .0414295     9.23   0.000     1.253782    1.416284
           Stage 4/5 egfr<30  |   2.350564   .1286044    15.62   0.000     2.111548    2.616635
                              |
                       1.esrd |   3.075239   .3221378    10.72   0.000     2.504457    3.776105
           1.other_transplant |   1.834477   .6594081     1.69   0.091     .9068707    3.710899
                   1.asplenia |   .8303653   .2230557    -0.69   0.489     .4904744    1.405795
           1.ra_sle_psoriasis |   1.196572   .0531568     4.04   0.000     1.096794    1.305428
               1.other_immuno |   1.775199   .3551777     2.87   0.004     1.199335    2.627565
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_CCeth_bmi_smok_ageband_1.ster saved

. 
. 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense2_covid_death_icu.log
  log type:  text
 closed on:   3 Sep 2020, 17:45:22
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
