------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_covid_death_icu.log
  log type:  text
 opened on:   3 Sep 2020, 16:27:26

. 
. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. foreach exposure_type in        kids_cat3  {
  4. 
. 
. *Complete case ethnicity model
.         capture stcox   i.`exposure_type'                       ///
>                         $demogadjlist                           ///
>                         $comordidadjlist                ///
>                         , strata(stp) vce(cluster household_id)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_CCeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 10. 
.  }
 11. }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,002,996             Number of obs    =   9,002,996
No. of failures      =        2,086
Time at risk         =   1655573446
                                                Wald chi2(46)    =     8252.81
Log pseudolikelihood =   -24390.256             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 5,682,493 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8584121    .058422    -2.24   0.025     .7512155    .9809053
               Kids under 18  |   .9650019    .078401    -0.44   0.661     .8229488    1.131576
                              |
                         age1 |   1.107852   .0260758     4.35   0.000     1.057906    1.160157
                         age2 |   .9779381   .0530717    -0.41   0.681     .8792604     1.08769
                         age3 |   .9658901   .1277211    -0.26   0.793     .7453702    1.251652
                       1.male |   1.917295   .0913975    13.65   0.000     1.746273    2.105066
                              |
                    ethnicity |
                       Mixed  |   2.685814   .3777299     7.02   0.000     2.038749    3.538245
      Asian or Asian British  |   2.495297   .1809469    12.61   0.000     2.164698    2.876387
                       Black  |   2.700727   .2394277    11.21   0.000     2.269964    3.213233
                       Other  |   2.393361   .2910486     7.18   0.000     1.885804    3.037526
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.481497   .0848917     6.86   0.000     1.324115    1.657584
          Obese II (35-39.9)  |   2.117032   .1501189    10.58   0.000     1.842335    2.432687
             Obese III (40+)  |   2.966195   .2457316    13.12   0.000     2.521638    3.489126
                              |
                 smoke_nomiss |
                      Former  |   1.027221   .0505562     0.55   0.585     .9327623    1.131246
                     Current  |   .5138319   .0380876    -8.98   0.000     .4443509    .5941773
                              |
                          imd |
                           2  |    1.17017   .0993679     1.85   0.064     .9907567    1.382072
                           3  |   1.273404   .1055344     2.92   0.004     1.082486    1.497995
                           4  |    1.54712   .1226419     5.51   0.000     1.324489    1.807172
             5 most deprived  |   1.594234   .1324083     5.62   0.000      1.35474    1.876066
                              |
                tot_adults_hh |
                           2  |   .8682664   .0513096    -2.39   0.017     .7733068    .9748868
                           3  |    1.07249   .0625317     1.20   0.230     .9566739    1.202328
                              |
           1.htdiag_or_highbp |   1.381266    .071521     6.24   0.000     1.247966    1.528804
1.chronic_respiratory_disease |   2.711984   .2076722    13.03   0.000     2.334027    3.151146
                     1.asthma |   1.167247   .0664483     2.72   0.007     1.044014    1.305027
    1.chronic_cardiac_disease |   1.329964   .0943107     4.02   0.000     1.157389    1.528272
                              |
                      diabcat |
            T1DM, controlled  |   1.977007   .6672704     2.02   0.043     1.020269    3.830909
          T1DM, uncontrolled  |   3.006677   .5404876     6.12   0.000     2.113843    4.276622
            T2DM, controlled  |   1.771585   .1291751     7.84   0.000     1.535666    2.043748
          T2DM, uncontrolled  |   2.754758   .1953562    14.29   0.000     2.397285    3.165535
          Diabetes, no HbA1c  |    3.62973   1.296942     3.61   0.000       1.8019    7.311693
                              |
            cancer_exhaem_cat |
                   Last year  |   3.943309   .6568563     8.24   0.000     2.844932    5.465748
               2-5 years ago  |   1.906997   .2679695     4.59   0.000     1.447905    2.511655
                    5+ years  |   1.210174   .1706072     1.35   0.176     .9180107    1.595321
                              |
              cancer_haem_cat |
                   Last year  |   6.257442   2.134446     5.38   0.000      3.20662    12.21086
               2-5 years ago  |   5.036308   1.157538     7.03   0.000     3.209765    7.902259
                    5+ years  |   2.075995    .491112     3.09   0.002      1.30575    3.300597
                              |
      1.chronic_liver_disease |   2.236387   .2840658     6.34   0.000     1.743521    2.868577
            1.stroke_dementia |   1.816271   .1858714     5.83   0.000      1.48618    2.219678
                1.other_neuro |     2.8556   .3621021     8.27   0.000     2.227211    3.661283
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.253842   .1932226     9.48   0.000      1.90524    2.666228
           Stage 4/5 egfr<30  |   3.215264   .6323304     5.94   0.000      2.18683    4.727357
                              |
                       1.esrd |    3.21916   .6305076     5.97   0.000     2.192934    4.725629
           1.other_transplant |   .8085158   .3815766    -0.45   0.652     .3206022    2.038969
                   1.asplenia |   2.179693   .6486527     2.62   0.009      1.21643    3.905743
           1.ra_sle_psoriasis |   1.228958   .1024162     2.47   0.013     1.043762    1.447013
               1.other_immuno |   1.766225   .3448896     2.91   0.004     1.204571     2.58976
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_CCeth_ageband_0.ster saved

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,444,310             Number of obs    =   2,444,310
No. of failures      =        6,278
Time at risk         =    445617301
                                                Wald chi2(46)    =    12837.35
Log pseudolikelihood =   -67846.718             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 1,934,530 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8801008   .0806937    -1.39   0.164     .7353404    1.053359
               Kids under 18  |   .8683315   .1109179    -1.11   0.269     .6760141    1.115361
                              |
                         age1 |   1.041498   .0166336     2.55   0.011     1.009401    1.074614
                         age2 |   1.194248   .0745999     2.84   0.004     1.056631    1.349788
                         age3 |   .6662305   .1052534    -2.57   0.010     .4888197    .9080301
                       1.male |   1.701903    .046775    19.35   0.000     1.612651    1.796094
                              |
                    ethnicity |
                       Mixed  |   1.259114   .2207107     1.31   0.189     .8930121    1.775303
      Asian or Asian British  |   1.494886   .0879409     6.83   0.000     1.332091    1.677577
                       Black  |   1.242563   .1126669     2.40   0.017     1.040249    1.484224
                       Other  |    1.09809   .1520538     0.68   0.499     .8370875    1.440472
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.129045   .0381073     3.60   0.000     1.056773     1.20626
          Obese II (35-39.9)  |   1.525424   .0755943     8.52   0.000      1.38423     1.68102
             Obese III (40+)  |   1.921395   .1387271     9.04   0.000     1.667857    2.213475
                              |
                 smoke_nomiss |
                      Former  |   1.247116   .0369856     7.45   0.000     1.176692    1.321754
                     Current  |   1.132075   .0630115     2.23   0.026     1.015072    1.262563
                              |
                          imd |
                           2  |   1.131711   .0477016     2.94   0.003     1.041976    1.229175
                           3  |   1.199816    .050924     4.29   0.000     1.104046    1.303894
                           4  |   1.396344   .0592358     7.87   0.000     1.284939    1.517407
             5 most deprived  |   1.551086   .0695114     9.79   0.000     1.420658    1.693489
                              |
                tot_adults_hh |
                           2  |   .7862625   .0234333    -8.07   0.000     .7416498    .8335588
                           3  |    .982342   .0431244    -0.41   0.685     .9013538    1.070607
                              |
           1.htdiag_or_highbp |   .9247945   .0296641    -2.44   0.015     .8684439    .9848015
1.chronic_respiratory_disease |   1.741243   .0539792    17.89   0.000     1.638596    1.850321
                     1.asthma |   1.032559   .0371104     0.89   0.373     .9623266    1.107917
    1.chronic_cardiac_disease |   1.337182   .0372801    10.42   0.000     1.266075    1.412283
                              |
                      diabcat |
            T1DM, controlled  |   1.764887    .426311     2.35   0.019     1.099279    2.833517
          T1DM, uncontrolled  |   2.575548   .3836583     6.35   0.000     1.923415    3.448785
            T2DM, controlled  |   1.412824   .0458862    10.64   0.000     1.325691    1.505683
          T2DM, uncontrolled  |   1.902441   .0768465    15.92   0.000     1.757633     2.05918
          Diabetes, no HbA1c  |   1.873036   .5711883     2.06   0.040     1.030314    3.405044
                              |
            cancer_exhaem_cat |
                   Last year  |   2.266787   .1762085    10.53   0.000     1.946447    2.639847
               2-5 years ago  |   1.236451   .0748729     3.51   0.000     1.098077    1.392263
                    5+ years  |   1.066205   .0423213     1.62   0.106     .9864009    1.152465
                              |
              cancer_haem_cat |
                   Last year  |   2.919403   .5446456     5.74   0.000     2.025319    4.208184
               2-5 years ago  |   2.578747   .2922735     8.36   0.000     2.065067    3.220204
                    5+ years  |   1.504542   .1520689     4.04   0.000     1.234158    1.834163
                              |
      1.chronic_liver_disease |   2.040093   .1808471     8.04   0.000     1.714723    2.427202
            1.stroke_dementia |   1.744453   .0578969    16.77   0.000     1.634589    1.861701
                1.other_neuro |   2.451648   .1360729    16.16   0.000     2.198944    2.733392
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.306422   .0393377     8.88   0.000     1.231553    1.385843
           Stage 4/5 egfr<30  |   2.327302   .1234529    15.92   0.000     2.097492    2.582291
                              |
                       1.esrd |   3.136971   .3199467    11.21   0.000     2.568589    3.831126
           1.other_transplant |   1.753513   .6297441     1.56   0.118     .8673903    3.544895
                   1.asplenia |   .9588556   .2340839    -0.17   0.863     .5942247    1.547233
           1.ra_sle_psoriasis |   1.217816   .0522698     4.59   0.000      1.11956    1.324695
               1.other_immuno |   1.896105   .3597277     3.37   0.001     1.307294    2.750121
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_CCeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_covid_death_icu.log
  log type:  text
 closed on:   3 Sep 2020, 17:55:37
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
