------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense3_covid_death_icu.log
  log type:  text
 opened on:   3 Sep 2020, 16:27:27

. 
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. foreach exposure_type in        kids_cat3   {
  4.  
. *Complete case ethnicity model
. capture stcox   i.`exposure_type'                       ///
>                         $demogadjlist                           ///
>                         $comordidadjlist                        ///
>                         , strata(stp) vce(cluster household_id)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_CCnoeth_bmi_smok_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 10.  }
 11. 
. }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    8,920,547             Number of obs    =   8,920,547
No. of failures      =        2,259
Time at risk         =   1640290402
                                                Wald chi2(44)    =     8568.12
Log pseudolikelihood =    -26524.55             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 5,869,008 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9895357   .0666933    -0.16   0.876     .8670851    1.129279
               Kids under 18  |   1.045271   .0827046     0.56   0.576     .8951168    1.220614
                              |
                         age1 |   1.148125   .0312176     5.08   0.000     1.088541     1.21097
                         age2 |   .8871024   .0535989    -1.98   0.047     .7880322    .9986275
                         age3 |   1.226584   .1773526     1.41   0.158     .9238922    1.628445
                       1.male |   2.003467   .0923566    15.07   0.000     1.830388    2.192912
                              |
                       bmicat |
          Normal (18.5-24.9)  |   .4959589   .0910387    -3.82   0.000     .3460974    .7107111
        Overweight (25-29.9)  |   .6058632   .1098666    -2.76   0.006     .4246377    .8644315
           Obese I (30-34.9)  |   .8955611   .1636257    -0.60   0.546     .6259999    1.281198
          Obese II (35-39.9)  |   1.237618   .2305473     1.14   0.252     .8590577    1.782999
             Obese III (40+)  |   1.647102   .3132773     2.62   0.009     1.134548    2.391213
                              |
                        smoke |
                      Former  |   .9237959   .0428715    -1.71   0.088     .8434774    1.011763
                     Current  |   .4951106   .0346255   -10.05   0.000     .4316916    .5678464
                              |
                          imd |
                           2  |   1.124742   .0889112     1.49   0.137     .9633077    1.313229
                           3  |   1.246796   .0964615     2.85   0.004     1.071372    1.450945
                           4  |   1.636988   .1210894     6.66   0.000     1.416059    1.892386
             5 most deprived  |   1.768693   .1359922     7.42   0.000     1.521265    2.056365
                              |
                tot_adults_hh |
                           2  |   .8369499   .0474659    -3.14   0.002     .7489025     .935349
                           3  |   1.139918    .062941     2.37   0.018     1.022997    1.270203
                              |
           1.htdiag_or_highbp |   1.350128   .0668814     6.06   0.000     1.225206    1.487788
1.chronic_respiratory_disease |   2.522669   .1832169    12.74   0.000     2.187958    2.908583
                     1.asthma |   1.115777   .0601797     2.03   0.042     1.003847    1.240187
    1.chronic_cardiac_disease |   1.400645    .091099     5.18   0.000     1.233006    1.591076
                              |
                      diabcat |
            T1DM, controlled  |   1.517714   .5098664     1.24   0.214     .7856591    2.931877
          T1DM, uncontrolled  |   2.678012   .4432227     5.95   0.000     1.936132    3.704163
            T2DM, controlled  |   1.883985   .1267812     9.41   0.000     1.651188    2.149603
          T2DM, uncontrolled  |   2.863636   .1863551    16.17   0.000      2.52072    3.253201
          Diabetes, no HbA1c  |   2.684398   1.100214     2.41   0.016     1.202203     5.99399
                              |
            cancer_exhaem_cat |
                   Last year  |   3.530859   .5699798     7.81   0.000     2.573194    4.844938
               2-5 years ago  |   1.845448   .2432604     4.65   0.000     1.425278    2.389485
                    5+ years  |   1.209618    .157761     1.46   0.145     .9367695    1.561938
                              |
              cancer_haem_cat |
                   Last year  |    4.36903   1.674427     3.85   0.000     2.061402    9.259919
               2-5 years ago  |   4.948741   1.062433     7.45   0.000     3.249019    7.537671
                    5+ years  |   1.975893   .4443394     3.03   0.002     1.271584    3.070308
                              |
      1.chronic_liver_disease |   2.506114   .2858587     8.05   0.000     2.004052    3.133955
            1.stroke_dementia |   1.749638   .1707121     5.73   0.000     1.445095    2.118361
                1.other_neuro |   3.005467    .352261     9.39   0.000     2.388611    3.781626
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.049783   .1719231     8.56   0.000     1.739059    2.416025
           Stage 4/5 egfr<30  |   3.391093   .6010585     6.89   0.000     2.395893    4.799676
                              |
                       1.esrd |   4.025102   .7044873     7.96   0.000     2.856253    5.672273
           1.other_transplant |   .7155542   .3088532    -0.78   0.438     .3070719     1.66742
                   1.asplenia |   2.107441   .5807348     2.71   0.007     1.227991    3.616729
           1.ra_sle_psoriasis |   1.193049   .0935003     2.25   0.024     1.023172     1.39113
               1.other_immuno |   2.305602   .4244513     4.54   0.000     1.607244    3.307401
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_CCnoeth_bmi_smok_ageband_0.ster saved

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,022,336             Number of obs    =   3,022,336
No. of failures      =        7,731
Time at risk         =    550845149
                                                Wald chi2(44)    =    15028.85
Log pseudolikelihood =   -84956.017             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,336,604 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |     .98902   .0856324    -0.13   0.899      .834652    1.171938
               Kids under 18  |    .901906   .1099778    -0.85   0.397     .7101765    1.145397
                              |
                         age1 |   1.029419    .015112     1.98   0.048     1.000222    1.059468
                         age2 |   1.273807    .072851     4.23   0.000     1.138733    1.424902
                         age3 |   .5531232   .0799369    -4.10   0.000     .4166841     .734238
                       1.male |   1.813901   .0453865    23.80   0.000     1.727091    1.905074
                              |
                       bmicat |
          Normal (18.5-24.9)  |   .5336487   .0317687   -10.55   0.000     .4748785    .5996921
        Overweight (25-29.9)  |   .4475657   .0269787   -13.34   0.000     .3976925    .5036932
           Obese I (30-34.9)  |   .5597785   .0352886    -9.20   0.000     .4947163    .6333974
          Obese II (35-39.9)  |   .7545235   .0532422    -3.99   0.000     .6570654    .8664369
             Obese III (40+)  |   .9809403   .0820806    -0.23   0.818     .8325646    1.155759
                              |
                        smoke |
                      Former  |   1.228901   .0325323     7.79   0.000     1.166764    1.294346
                     Current  |   1.021209   .0524563     0.41   0.683     .9234028    1.129375
                              |
                          imd |
                           2  |     1.0839   .0403784     2.16   0.031      1.00758    1.166001
                           3  |   1.194596   .0443376     4.79   0.000     1.110782    1.284735
                           4  |   1.371049   .0513522     8.43   0.000     1.274006    1.475483
             5 most deprived  |   1.551366   .0615414    11.07   0.000     1.435317    1.676798
                              |
                tot_adults_hh |
                           2  |   .8049395   .0214442    -8.14   0.000      .763988    .8480861
                           3  |   1.032343   .0405458     0.81   0.418     .9558567     1.11495
                              |
           1.htdiag_or_highbp |   .9288228   .0268105    -2.56   0.011      .877734    .9828852
1.chronic_respiratory_disease |   1.689254   .0470544    18.82   0.000     1.599501    1.784042
                     1.asthma |    1.11915   .0356135     3.54   0.000     1.051482    1.191174
    1.chronic_cardiac_disease |    1.35342   .0335411    12.21   0.000     1.289252    1.420782
                              |
                      diabcat |
            T1DM, controlled  |   1.686189   .3738241     2.36   0.018     1.091936    2.603848
          T1DM, uncontrolled  |   2.933341   .3688274     8.56   0.000     2.292639    3.753095
            T2DM, controlled  |   1.442033   .0416429    12.68   0.000     1.362681    1.526006
          T2DM, uncontrolled  |   1.973403   .0707065    18.97   0.000     1.839574    2.116967
          Diabetes, no HbA1c  |   2.338651   .5873857     3.38   0.001     1.429467    3.826105
                              |
            cancer_exhaem_cat |
                   Last year  |   2.081868   .1490721    10.24   0.000     1.809268     2.39554
               2-5 years ago  |   1.190753   .0649319     3.20   0.001     1.070054    1.325067
                    5+ years  |   1.049231   .0371612     1.36   0.175     .9788671    1.124653
                              |
              cancer_haem_cat |
                   Last year  |   3.536785   .5393273     8.28   0.000      2.62306      4.7688
               2-5 years ago  |   2.450184   .2508072     8.75   0.000     2.004784    2.994538
                    5+ years  |   1.567121   .1390241     5.06   0.000     1.317012    1.864727
                              |
      1.chronic_liver_disease |   1.962073   .1612199     8.20   0.000     1.670219    2.304925
            1.stroke_dementia |   1.713832   .0510852    18.07   0.000     1.616576     1.81694
                1.other_neuro |   2.352779   .1196038    16.83   0.000      2.12966    2.599274
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.303649   .0350626     9.86   0.000     1.236707    1.374214
           Stage 4/5 egfr<30  |   2.372714   .1121748    18.28   0.000     2.162734    2.603081
                              |
                       1.esrd |   3.218881   .2909126    12.94   0.000     2.696348    3.842677
           1.other_transplant |   1.971125   .6043973     2.21   0.027     1.080722    3.595128
                   1.asplenia |    .934716   .2051165    -0.31   0.758     .6079807    1.437042
           1.ra_sle_psoriasis |   1.237396     .04731     5.57   0.000     1.148059    1.333684
               1.other_immuno |   1.707504   .3122854     2.93   0.003     1.193124    2.443644
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_CCnoeth_bmi_smok_ageband_1.ster saved

. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense3_covid_death_icu.log
  log type:  text
 closed on:   3 Sep 2020, 17:59:03
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
