------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_time_covid_death_icu.log
  log type:  text
 opened on:   3 Sep 2020, 16:27:28

. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6. stcox   `exposure'                                                              ///
>                         $demogadjlist                                                   ///
>                         $comordidadjlist                                                ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. *Split data by time of study period: days to April 3rd (29d Feb, 31 d March, 3d April)
. stsplit cat_time, at(0,63, 200)
  4. recode cat_time 63=1 200=2 
  5. recode `outcome' .=0 
  6. tab cat_time
  7. tab cat_time `outcome'
  8.  
. /*Overlapping time periods
> gen cat_time0=1 if cat==0
> gen cat_time1=1 if cat==0 | cat==0.25
> */
.         
. 
. 
. foreach int_type in cat_time  {
  9. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
 10. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 11. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
 12. if _rc==0{
 13. testparm 1.`int_type'#i.`exposure_type'
 14. di _n "`exposure_type' <66" _n "****************"
 15. lincom 2.`exposure_type', eform
 16. di "`exposure_type' 66+" _n "****************"
 17. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 18. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 19. }
 20. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 21. 
. }
 22. 
. }
 23. 
. }
(12,049,796 observations (episodes) created)
(cat_time: 12049796 changes made)
(covid_death_icu: 12049796 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,054,790       50.01       50.01
          1 | 12,049,796       49.99      100.00
------------+-----------------------------------
      Total | 24,104,586      100.00

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Observatio |       icu/death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |12,053,835        955 |12,054,790 
         1 |12,048,033      1,763 |12,049,796 
-----------+----------------------+----------
     Total |24,101,868      2,718 |24,104,586 

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -33915.463
Iteration 1:   log pseudolikelihood = -32703.171
Iteration 2:   log pseudolikelihood =  -31565.19
Iteration 3:   log pseudolikelihood = -31209.466
Iteration 4:   log pseudolikelihood = -31197.055
Iteration 5:   log pseudolikelihood = -31196.978
Iteration 6:   log pseudolikelihood = -31196.978
Refining estimates:
Iteration 0:   log pseudolikelihood = -31196.978

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  23,736,816
No. of failures      =        2,587
Time at risk         =   2182954615
                                                Wald chi2(37)    =     8788.66
Log pseudolikelihood =   -31196.978             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9861469   .0611351    -0.23   0.822     .8733177    1.113553
               Kids under 18  |   1.077788   .0780625     1.03   0.301      .935152     1.24218
                              |
                         age1 |   1.140292   .0245223     6.10   0.000     1.093228    1.189382
                         age2 |   .9210695   .0456379    -1.66   0.097      .835827    1.015006
                         age3 |   1.096849    .132297     0.77   0.443     .8659216     1.38936
                       1.male |   1.674619   .0699093    12.35   0.000     1.543055    1.817401
                              |
                          imd |
                           2  |    1.12891   .0829692     1.65   0.099     .9774633    1.303822
                           3  |   1.261261   .0906552     3.23   0.001     1.095528    1.452066
                           4  |   1.601459    .109711     6.87   0.000      1.40024    1.831593
             5 most deprived  |   1.709512   .1212794     7.56   0.000     1.487595    1.964535
                              |
                tot_adults_hh |
                           2  |   .8894845   .0472581    -2.20   0.028     .8015197    .9871032
                           3  |   1.158971   .0600256     2.85   0.004     1.047097    1.282797
                              |
           1.htdiag_or_highbp |      1.613     .07409    10.41   0.000     1.474131    1.764951
1.chronic_respiratory_disease |   2.354875   .1581954    12.75   0.000     2.064362     2.68627
                     1.asthma |    1.23254   .0625376     4.12   0.000     1.115866    1.361413
    1.chronic_cardiac_disease |   1.417989   .0894136     5.54   0.000     1.253138    1.604526
                              |
                      diabcat |
            T1DM, controlled  |   1.897609    .579812     2.10   0.036     1.042613    3.453745
          T1DM, uncontrolled  |   2.753484   .4444486     6.27   0.000     2.006723    3.778137
            T2DM, controlled  |   2.410611   .1553696    13.65   0.000     2.124542      2.7352
          T2DM, uncontrolled  |   3.789158    .230748    21.88   0.000     3.362848    4.269512
          Diabetes, no HbA1c  |   3.648048   1.300354     3.63   0.000     1.814046     7.33623
                              |
            cancer_exhaem_cat |
                   Last year  |   3.647276   .5488294     8.60   0.000     2.715706    4.898402
               2-5 years ago  |   1.908273   .2364225     5.22   0.000     1.496863    2.432757
                    5+ years  |   1.141378   .1451251     1.04   0.298     .8896104    1.464397
                              |
              cancer_haem_cat |
                   Last year  |   5.276419   1.789122     4.91   0.000     2.714656    10.25566
               2-5 years ago  |   5.345798   1.060974     8.45   0.000     3.623061    7.887684
                    5+ years  |   2.018697   .4323359     3.28   0.001       1.3267    3.071634
                              |
      1.chronic_liver_disease |   2.309824   .2560741     7.55   0.000     1.858712    2.870421
            1.stroke_dementia |   1.761065   .1618987     6.16   0.000     1.470695    2.108765
                1.other_neuro |   3.138752   .3403412    10.55   0.000     2.537813    3.881991
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |      2.327   .1837944    10.69   0.000     1.993267    2.716609
           Stage 4/5 egfr<30  |   3.859223   .6428836     8.11   0.000     2.784221    5.349291
                              |
                       1.esrd |   3.392424   .5644104     7.34   0.000     2.448457    4.700323
           1.other_transplant |   .6269637   .2688935    -1.09   0.276     .2705063     1.45314
                   1.asplenia |    2.16739   .5554643     3.02   0.003     1.311562    3.581667
           1.ra_sle_psoriasis |   1.193711   .0893593     2.37   0.018     1.030812    1.382352
               1.other_immuno |   2.352035   .4035351     4.99   0.000     1.680368    3.292177
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   6741.37 /        1 =    6741.3740

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -33915.463
Iteration 1:   log pseudolikelihood = -32702.901
Iteration 2:   log pseudolikelihood = -31563.635
Iteration 3:   log pseudolikelihood = -31207.963
Iteration 4:   log pseudolikelihood = -31195.556
Iteration 5:   log pseudolikelihood = -31195.479
Iteration 6:   log pseudolikelihood = -31195.479
Refining estimates:
Iteration 0:   log pseudolikelihood = -31195.479

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  23,736,816
No. of failures      =        2,587
Time at risk         =   2182954615
                                                Wald chi2(39)    =     8796.93
Log pseudolikelihood =   -31195.479             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.093042   .1039108     0.94   0.349     .9072291    1.316913
               Kids under 18  |   1.204674   .1381777     1.62   0.104     .9621337    1.508354
                              |
                         age1 |   1.140373   .0245246     6.11   0.000     1.093305    1.189468
                         age2 |   .9208293   .0456254    -1.66   0.096     .8356101    1.014739
                         age3 |   1.097581   .1323812     0.77   0.440     .8665061    1.390278
                       1.male |   1.674636   .0699103    12.35   0.000      1.54307    1.817419
                              |
                          imd |
                           2  |   1.128852    .082966     1.65   0.099     .9774106    1.303757
                           3  |   1.261203   .0906511     3.23   0.001     1.095478       1.452
                           4  |   1.601414   .1097051     6.87   0.000     1.400206    1.831535
             5 most deprived  |   1.709646   .1212844     7.56   0.000     1.487719    1.964679
                              |
                tot_adults_hh |
                           2  |   .8893253   .0472481    -2.21   0.027     .8013791     .986923
                           3  |   1.158686   .0600216     2.84   0.004      1.04682    1.282505
                              |
           1.htdiag_or_highbp |   1.612955   .0740871    10.41   0.000     1.474091      1.7649
1.chronic_respiratory_disease |   2.354717   .1581859    12.75   0.000     2.064222    2.686092
                     1.asthma |   1.232575     .06254     4.12   0.000     1.115896    1.361453
    1.chronic_cardiac_disease |   1.417885   .0894054     5.54   0.000     1.253049    1.604405
                              |
                      diabcat |
            T1DM, controlled  |   1.898297   .5800493     2.10   0.036     1.042962    3.455094
          T1DM, uncontrolled  |   2.753386   .4444502     6.27   0.000     2.006627    3.778049
            T2DM, controlled  |   2.410544   .1553625    13.65   0.000     2.124487    2.735118
          T2DM, uncontrolled  |   3.788984   .2307389    21.87   0.000      3.36269    4.269319
          Diabetes, no HbA1c  |   3.648088   1.300399     3.63   0.000     1.814035    7.336434
                              |
            cancer_exhaem_cat |
                   Last year  |   3.647169   .5488205     8.60   0.000     2.715615    4.898277
               2-5 years ago  |   1.908191   .2364196     5.22   0.000     1.496788    2.432671
                    5+ years  |   1.141416   .1451315     1.04   0.298     .8896384     1.46445
                              |
              cancer_haem_cat |
                   Last year  |   5.276514   1.789298     4.90   0.000     2.714561    10.25639
               2-5 years ago  |   5.345914   1.060982     8.45   0.000     3.623159    7.887812
                    5+ years  |   2.018993     .43241     3.28   0.001     1.326882    3.072116
                              |
      1.chronic_liver_disease |   2.309774   .2560768     7.55   0.000     1.858658    2.870379
            1.stroke_dementia |   1.761095   .1619049     6.16   0.000     1.470714     2.10881
                1.other_neuro |   3.138466   .3403195    10.55   0.000     2.537567     3.88166
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |    2.32693   .1837926    10.69   0.000     1.993202    2.716537
           Stage 4/5 egfr<30  |   3.859883   .6428913     8.11   0.000     2.784841    5.349927
                              |
                       1.esrd |   3.392721   .5643659     7.34   0.000     2.448805     4.70048
           1.other_transplant |   .6268894   .2688698    -1.09   0.276     .2704673    1.453005
                   1.asplenia |   2.166955   .5553911     3.02   0.003     1.311253    3.581072
           1.ra_sle_psoriasis |   1.193766   .0893628     2.37   0.018     1.030861    1.382415
               1.other_immuno |   2.353795   .4037993     4.99   0.000     1.681679    3.294537
                              |
           cat_time#kids_cat3 |
             1#Kids under 12  |   .8509181   .0989599    -1.39   0.165     .6774776    1.068761
             1#Kids under 18  |   .8402041   .1200258    -1.22   0.223     .6350209    1.111685
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   6852.85 /        1 =    6852.8530

 ( 1)  1.cat_time#1.kids_cat3 = 0
 ( 2)  1.cat_time#2.kids_cat3 = 0

           chi2(  2) =    2.99
         Prob > chi2 =    0.2241

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.204674   .1381777     1.62   0.104     .9621337    1.508354
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.cat_time#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.012172   .0914389     0.13   0.893     .8479245    1.208234
------------------------------------------------------------------------------
file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster saved
(3,467,541 observations (episodes) created)
(cat_time: 3467541 changes made)
(covid_death_icu: 3467541 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,489,829       50.16       50.16
          1 |  3,467,541       49.84      100.00
------------+-----------------------------------
      Total |  6,957,370      100.00

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Observatio |       icu/death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,488,047      1,782 | 3,489,829 
         1 | 3,460,393      7,148 | 3,467,541 
-----------+----------------------+----------
     Total | 6,948,440      8,930 | 6,957,370 

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -99539.034
Iteration 1:   log pseudolikelihood = -94954.571
Iteration 2:   log pseudolikelihood =  -93985.59
Iteration 3:   log pseudolikelihood = -93950.835
Iteration 4:   log pseudolikelihood = -93949.535
Iteration 5:   log pseudolikelihood = -93949.531
Refining estimates:
Iteration 0:   log pseudolikelihood = -93949.531

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   6,637,802
No. of failures      =        8,460
Time at risk         =    606783707
                                                Wald chi2(37)    =    16248.27
Log pseudolikelihood =   -93949.531             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9151181   .0771293    -1.05   0.293     .7757734    1.079492
               Kids under 18  |   .8971764   .1037626    -0.94   0.348     .7152081    1.125442
                              |
                         age1 |   1.027647   .0143247     1.96   0.050     .9999515     1.05611
                         age2 |   1.255624   .0683125     4.18   0.000     1.128626    1.396913
                         age3 |   .5807068   .0798439    -3.95   0.000     .4435285    .7603128
                       1.male |   1.766615   .0411059    24.46   0.000     1.687858    1.849046
                              |
                          imd |
                           2  |    1.11132   .0394285     2.97   0.003     1.036667    1.191349
                           3  |   1.226652   .0434676     5.76   0.000     1.144348    1.314875
                           4  |    1.41484   .0506438     9.69   0.000     1.318982    1.517665
             5 most deprived  |    1.64336   .0620052    13.17   0.000     1.526216    1.769494
                              |
                tot_adults_hh |
                           2  |   .7979049   .0203297    -8.86   0.000     .7590379    .8387621
                           3  |   .9908582    .037409    -0.24   0.808     .9201849    1.066959
                              |
           1.htdiag_or_highbp |   .9404261   .0254774    -2.27   0.023     .8917939    .9917103
1.chronic_respiratory_disease |    1.83096    .048532    22.82   0.000     1.738268    1.928595
                     1.asthma |    1.11198   .0344835     3.42   0.001     1.046406    1.181663
    1.chronic_cardiac_disease |   1.370588   .0327828    13.18   0.000     1.307818    1.436371
                              |
                      diabcat |
            T1DM, controlled  |   1.752454   .3791846     2.59   0.010     1.146751    2.678083
          T1DM, uncontrolled  |   2.929448   .3651521     8.62   0.000     2.294481    3.740133
            T2DM, controlled  |   1.479239   .0412423    14.04   0.000     1.400575    1.562322
          T2DM, uncontrolled  |   2.077118    .071641    21.19   0.000     1.941345    2.222386
          Diabetes, no HbA1c  |    2.36094   .5599689     3.62   0.000     1.483189    3.758143
                              |
            cancer_exhaem_cat |
                   Last year  |   2.138146   .1465071    11.09   0.000     1.869444    2.445469
               2-5 years ago  |   1.193226    .062967     3.35   0.001     1.075981    1.323248
                    5+ years  |   1.058688   .0359967     1.68   0.093     .9904351    1.131644
                              |
              cancer_haem_cat |
                   Last year  |    3.41196   .5091278     8.22   0.000     2.546765    4.571082
               2-5 years ago  |   2.467354   .2439607     9.13   0.000     2.032678    2.994984
                    5+ years  |   1.565263   .1334366     5.26   0.000     1.324413    1.849912
                              |
      1.chronic_liver_disease |   1.998673    .159107     8.70   0.000      1.70994    2.336161
            1.stroke_dementia |   1.730123   .0497328    19.07   0.000     1.635344    1.830396
                1.other_neuro |   2.450434   .1173386    18.72   0.000     2.230917    2.691552
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.313132   .0338079    10.58   0.000     1.248514    1.381095
           Stage 4/5 egfr<30  |    2.43685   .1106434    19.62   0.000     2.229362    2.663649
                              |
                       1.esrd |   3.207813   .2811336    13.30   0.000     2.701528    3.808979
           1.other_transplant |   1.799252   .5504731     1.92   0.055     .9878042    3.277278
                   1.asplenia |   1.036359   .2087033     0.18   0.859     .6983835    1.537893
           1.ra_sle_psoriasis |    1.27176   .0466856     6.55   0.000     1.183472    1.366634
               1.other_immuno |   1.778282   .3070071     3.33   0.001     1.267789    2.494332
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   2017.81 /        1 =    2017.8090

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -99539.034
Iteration 1:   log pseudolikelihood =  -94953.95
Iteration 2:   log pseudolikelihood = -93984.657
Iteration 3:   log pseudolikelihood = -93949.887
Iteration 4:   log pseudolikelihood = -93948.587
Iteration 5:   log pseudolikelihood = -93948.583
Refining estimates:
Iteration 0:   log pseudolikelihood = -93948.583

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   6,637,802
No. of failures      =        8,460
Time at risk         =    606783707
                                                Wald chi2(39)    =    16256.29
Log pseudolikelihood =   -93948.583             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.106338   .1728813     0.65   0.518     .8144708    1.502798
               Kids under 18  |   .9132783   .2168957    -0.38   0.702       .57339    1.454642
                              |
                         age1 |    1.02762   .0143248     1.95   0.051     .9999244    1.056083
                         age2 |   1.255711   .0683186     4.19   0.000     1.128701    1.397013
                         age3 |   .5806224   .0798335    -3.95   0.000     .4434622    .7602055
                       1.male |   1.766596   .0411061    24.46   0.000     1.687839    1.849028
                              |
                          imd |
                           2  |   1.111317   .0394286     2.97   0.003     1.036664    1.191346
                           3  |   1.226631   .0434678     5.76   0.000     1.144327    1.314854
                           4  |   1.414908   .0506469     9.70   0.000     1.319044    1.517739
             5 most deprived  |   1.643626   .0620136    13.17   0.000     1.526466    1.769777
                              |
                tot_adults_hh |
                           2  |   .7978856   .0203296    -8.86   0.000     .7590189    .8387427
                           3  |   .9909468   .0374147    -0.24   0.810     .9202629     1.06706
                              |
           1.htdiag_or_highbp |   .9404009   .0254765    -2.27   0.023     .8917704    .9916835
1.chronic_respiratory_disease |   1.830952   .0485319    22.82   0.000      1.73826    1.928587
                     1.asthma |   1.111977   .0344835     3.42   0.001     1.046403    1.181659
    1.chronic_cardiac_disease |   1.370562   .0327822    13.18   0.000     1.307793    1.436344
                              |
                      diabcat |
            T1DM, controlled  |   1.752635   .3792259     2.59   0.010     1.146867    2.678366
          T1DM, uncontrolled  |    2.92936    .365143     8.62   0.000     2.294409    3.740025
            T2DM, controlled  |   1.479236   .0412427    14.04   0.000      1.40057    1.562319
          T2DM, uncontrolled  |   2.077196    .071644    21.19   0.000     1.941417     2.22247
          Diabetes, no HbA1c  |   2.360801   .5599411     3.62   0.000     1.483096    3.757938
                              |
            cancer_exhaem_cat |
                   Last year  |   2.138145   .1465082    11.09   0.000     1.869442    2.445471
               2-5 years ago  |   1.193245   .0629675     3.35   0.001     1.075999    1.323267
                    5+ years  |   1.058701   .0359973     1.68   0.093     .9904474    1.131659
                              |
              cancer_haem_cat |
                   Last year  |   3.412144   .5091629     8.22   0.000     2.546891    4.571348
               2-5 years ago  |    2.46752   .2439777     9.13   0.000     2.032814    2.995186
                    5+ years  |   1.565268   .1334409     5.26   0.000     1.324411    1.849927
                              |
      1.chronic_liver_disease |   1.998729   .1591161     8.70   0.000     1.709979    2.336237
            1.stroke_dementia |   1.730121    .049733    19.07   0.000     1.635341    1.830394
                1.other_neuro |   2.450442   .1173376    18.72   0.000     2.230927    2.691557
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.313134    .033808    10.58   0.000     1.248515    1.381097
           Stage 4/5 egfr<30  |    2.43673   .1106406    19.62   0.000     2.229247    2.663523
                              |
                       1.esrd |   3.207072   .2810875    13.30   0.000     2.700873    3.808143
           1.other_transplant |   1.798111   .5501814     1.92   0.055     .9871153    3.275404
                   1.asplenia |   1.036438   .2087204     0.18   0.859     .6984355    1.538014
           1.ra_sle_psoriasis |   1.271735   .0466849     6.55   0.000     1.183449    1.366608
               1.other_immuno |     1.7786    .307046     3.34   0.001     1.268038    2.494734
                              |
           cat_time#kids_cat3 |
             1#Kids under 12  |   .7769082   .1397078    -1.40   0.160     .5461377    1.105191
             1#Kids under 18  |   .9776535   .2632549    -0.08   0.933       .57674    1.657257
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   2066.30 /        1 =    2066.2980

 ( 1)  1.cat_time#1.kids_cat3 = 0
 ( 2)  1.cat_time#2.kids_cat3 = 0

           chi2(  2) =    1.97
         Prob > chi2 =    0.3727

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9132783   .2168957    -0.38   0.702       .57339    1.454642
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.cat_time#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8928698   .1170829    -0.86   0.388     .6905088    1.154535
------------------------------------------------------------------------------
file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_time_covid_death_icu.log
  log type:  text
 closed on:   3 Sep 2020, 21:27:39
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
