----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\01_cr_analysis_dataset.log
  log type:  text
 opened on:  22 Aug 2020, 11:43:25

. 
. 
. /* CONVERT STRINGS TO DATE====================================================*/
. /* Comorb dates and TPP case outcome dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                                                                                     
>   */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(20,034,525 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(1,283,866 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(405,301 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 permanent_immunodeficiency  ///
>                                                 temporary_immunodeficiency  ///
>                                                 dialysis                                        ///
>                                                 kidney_transplant                       ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 dereg_date ///
>                                                 covid_tpp_probable ///
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(20,132,622 real changes made)
(19,373,704 real changes made)
(19,373,704 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(20,132,622 real changes made)
(18,862,583 real changes made)
(18,862,583 missing values generated)
variable diabetes was str7 now str10
(20,132,622 real changes made)
(18,345,358 real changes made)
(18,345,358 missing values generated)
variable cancer_haem was str7 now str10
(20,132,622 real changes made)
(20,022,394 real changes made)
(20,022,394 missing values generated)
variable cancer_nonhaem was str7 now str10
(20,132,622 real changes made)
(19,202,193 real changes made)
(19,202,193 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(20,132,622 real changes made)
(20,082,318 real changes made)
(20,082,318 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(20,132,622 real changes made)
(20,127,277 real changes made)
(20,127,277 missing values generated)
variable dialysis was str7 now str10
(20,132,622 real changes made)
(20,110,885 real changes made)
(20,110,885 missing values generated)
variable kidney_transplant was str7 now str10
(20,132,622 real changes made)
(20,117,526 real changes made)
(20,117,526 missing values generated)
variable other_transplant was str7 now str10
(20,132,622 real changes made)
(20,127,905 real changes made)
(20,127,905 missing values generated)
variable asplenia was str7 now str10
(20,132,622 real changes made)
(20,106,061 real changes made)
(20,106,061 missing values generated)
variable chronic_liver_disease was str7 now str10
(20,132,622 real changes made)
(20,020,883 real changes made)
(20,020,883 missing values generated)
variable other_neuro was str7 now str10
(20,132,622 real changes made)
(19,943,255 real changes made)
(19,943,255 missing values generated)
variable stroke_dementia was str7 now str10
(20,132,622 real changes made)
(19,697,210 real changes made)
(19,697,210 missing values generated)
variable esrf was str7 now str10
(20,132,622 real changes made)
(20,105,862 real changes made)
(20,105,862 missing values generated)
variable hypertension was str7 now str10
(20,132,622 real changes made)
(16,251,585 real changes made)
(16,251,585 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(20,132,622 real changes made)
(19,190,381 real changes made)
(19,190,381 missing values generated)
variable bmi_date_measured was str7 now str10
(20,132,622 real changes made)
(5,287,926 real changes made)
(5,287,926 missing values generated)
variable bp_sys_date_measured was str7 now str10
(20,132,622 real changes made)
(3,350,594 real changes made)
(3,350,594 missing values generated)
variable bp_dias_date_measured was str7 now str10
(20,132,622 real changes made)
(3,353,102 real changes made)
(3,353,102 missing values generated)
variable creatinine_date was str7 now str10
(20,132,622 real changes made)
(6,199,735 real changes made)
(6,199,735 missing values generated)
variable smoking_status_date was str7 now str10
(20,132,622 real changes made)
(1,621,995 real changes made)
(1,621,995 missing values generated)
variable dereg_date was str7 now str10
(20,132,622 real changes made)
(19,812,443 real changes made)
(19,812,443 missing values generated)
variable covid_tpp_probable was str7 now str10
(20,132,622 real changes made)
(20,062,905 real changes made)
(20,062,905 missing values generated)

. 
. * Recode to dates from the strings 
. foreach var of varlist covid_icu_date   died_date_ons   {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td 
  7.         
. }
(20,129,468 missing values generated)
(20,020,724 missing values generated)

. 
. /*Tab all variables in initial extract*/
. sum, d f

                         patient_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%       385380           2878
 5%      1858994           7276
10%      3864309           9969       Obs          20,132,622
25%      9961386           9970       Sum of Wgt.    20132622

50%     2.08e+07                      Mean           2.23e+07
                        Largest       Std. Dev.      1.45e+07
75%     3.36e+07       5.34e+07
90%     4.40e+07       5.34e+07       Variance       2.09e+14
95%     4.80e+07       5.34e+07       Skewness       .3123842
99%     5.14e+07       5.34e+07       Kurtosis       2.010433

                       dereg_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2020      15feb2020
 5%    15feb2020      15feb2020
10%    15feb2020      15feb2020       Obs             320,179
25%    15mar2020      15feb2020       Sum of Wgt.     320,179

50%    15apr2020                      Mean          26apr2020
                        Largest       Std. Dev.      53.19736
75%    15jun2020      15aug2020
90%    15jul2020      15aug2020       Variance       2829.959
95%    15jul2020      15aug2020       Skewness       .1431221
99%    15jul2020      15aug2020       Kurtosis       1.686853

                     has_12_m_follow_up
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs          20,132,622
25%            1              0       Sum of Wgt.    20132622

50%            1                      Mean            .940186
                        Largest       Std. Dev.      .2371419
75%            1              1
90%            1              1       Variance       .0562363
95%            1              1       Skewness      -3.712426
99%            1              1       Kurtosis       14.78211

                   died_ons_covid_flag_any
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          20,132,622
25%            0              0       Sum of Wgt.    20132622

50%            0                      Mean           .0008579
                        Largest       Std. Dev.      .0292767
75%            0              1
90%            0              1       Variance       .0008571
95%            0              1       Skewness       34.09824
99%            0              1       Kurtosis        1163.69

               died_ons_covid_flag_underlying
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          20,132,622
25%            0              0       Sum of Wgt.    20132622

50%            0                      Mean           .0007944
                        Largest       Std. Dev.      .0281745
75%            0              1
90%            0              1       Variance       .0007938
95%            0              1       Skewness       35.43673
99%            0              1       Kurtosis       1256.762

                   covid_tpp_probable_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15mar2020      15jan1900
 5%    15mar2020      15jan1900
10%    15apr2020      15jan1900       Obs              69,717
25%    15apr2020      15jan1900       Sum of Wgt.      69,717

50%    15may2020                      Mean          19apr2020
                        Largest       Std. Dev.       880.329
75%    15jun2020      15aug2020
90%    15jul2020      15aug2020       Variance       774979.1
95%    15jul2020      15aug2020       Skewness      -45.52052
99%    15aug2020      15aug2020       Kurtosis       2185.906

                  positive_covid_test_ever
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          20,132,622
25%            0              0       Sum of Wgt.    20132622

50%            0                      Mean           .0043433
                        Largest       Std. Dev.      .0657604
75%            0              1
90%            0              1       Variance       .0043244
95%            0              1       Skewness       15.07462
99%            0              1       Kurtosis       228.2441

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2              0
 5%            9              0
10%           17              0       Obs          20,132,622
25%           29              0       Sum of Wgt.    20132622

50%           45                      Mean            45.4588
                        Largest       Std. Dev.      21.54307
75%           62            120
90%           74            120       Variance       464.1037
95%           81            120       Skewness       .0234956
99%           90            120       Kurtosis       2.243768

                             sex
-------------------------------------------------------------
no observations

                             imd
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%         1200             -1
10%         2800             -1       Obs          20,132,622
25%         7800             -1       Sum of Wgt.    20132622

50%        16100                      Mean           15978.65
                        Largest       Std. Dev.      9456.776
75%        24000          32800
90%        29100          32800       Variance       8.94e+07
95%        30900          32800       Skewness       .0031116
99%        32400          32800       Kurtosis       1.828443

                             stp
-------------------------------------------------------------
no observations

                          ethnicity
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs          14,977,050
25%            1              1       Sum of Wgt.    14977050

50%            1                      Mean           1.373659
                        Largest       Std. Dev.      .9422022
75%            1              5
90%            3              5       Variance        .887745
95%            4              5       Skewness       2.499328
99%            5              5       Kurtosis       8.264087

                       ethnicity_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%         2003           1888
 5%         2007           1899
10%         2008           1899       Obs          14,977,050
25%         2010           1899       Sum of Wgt.    14977050

50%         2014                      Mean           2012.925
                        Largest       Std. Dev.      8.008771
75%         2017           2066
90%         2019           2075       Variance       64.14042
95%         2019           2081       Skewness      -10.22975
99%         2020           2095       Kurtosis       142.8512

                        household_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          20,132,622
25%      1336885              0       Sum of Wgt.    20132622

50%      4089963                      Mean            4176285
                        Largest       Std. Dev.       3044626
75%      6799483        9675303
90%      8506151        9675304       Variance       9.27e+12
95%      9090668        9675306       Skewness       .1253267
99%      9562375        9675306       Kurtosis       1.731663

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          20,132,622
25%            1              0       Sum of Wgt.    20132622

50%            2                      Mean           4.691317
                        Largest       Std. Dev.      46.60634
75%            4           2590
90%            5           2590       Variance       2172.151
95%            6           2590       Skewness       34.06348
99%           13           2590       Kurtosis       1463.323

                       care_home_type
-------------------------------------------------------------
no observations

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0        -3460.2
 5%            0         -277.8
10%            0           -2.1       Obs          20,132,622
25%            0           -1.8       Sum of Wgt.    20132622

50%         24.2                      Mean           67.08965
                        Largest       Std. Dev.      8603.236
75%         28.8        1520000
90%         33.7        1805556       Variance       7.40e+07
95%         37.2       1.95e+07       Skewness       2392.265
99%         45.5       2.85e+07       Kurtosis        7285682

                   bmi_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug2010      15feb2010
 5%    15may2012      15feb2010
10%    15oct2013      15feb2010       Obs          14,844,696
25%    15jun2016      15feb2010       Sum of Wgt.    14844696

50%    15oct2018                      Mean          28oct2017
                        Largest       Std. Dev.      1823.515
75%    15oct2019      15mar9909
90%    15feb2020      15apr9909       Variance        3325207
95%    15jun2020      15apr9912       Skewness       1134.914
99%    15jul2020      15jul9935       Kurtosis        1756365

                           bp_sys
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs          20,132,622
25%          108             -1       Sum of Wgt.    20132622

50%          122                      Mean           105.6756
                        Largest       Std. Dev.      119.7252
75%          135         136136
90%          143         137137       Variance       14334.13
95%          150         139139       Skewness       823.2998
99%          168         139139       Kurtosis       859764.6

                  bp_sys_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15nov2003      15jan1860
 5%    15dec2010      15jan1860
10%    15jan2014      15sep1899       Obs          16,782,028
25%    15apr2017      15dec1899       Sum of Wgt.    16782028

50%    15feb2019                      Mean          17oct2017
                        Largest       Std. Dev.      1268.013
75%    15oct2019      15feb2020
90%    15dec2019      15feb2020       Variance        1607856
95%    15jan2020      15feb2020       Skewness      -4.849347
99%    15jan2020      15feb2020       Kurtosis       85.48604

                           bp_dias
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs          20,132,622
25%           63             -1       Sum of Wgt.    20132622

50%           74                      Mean           63.53181
                        Largest       Std. Dev.      36.06665
75%           80           7597
90%           88           7690       Variance       1300.803
95%           90           9074       Skewness       750.0659
99%          100          89147       Kurtosis        1849216

                 bp_dias_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15nov2003      15jan1860
 5%    15dec2010      15jan1860
10%    15jan2014      15sep1899       Obs          16,779,520
25%    15apr2017      15dec1899       Sum of Wgt.    16779520

50%    15feb2019                      Mean          18oct2017
                        Largest       Std. Dev.      1248.116
75%    15oct2019      15feb2020
90%    15dec2019      15feb2020       Variance        1557793
95%    15jan2020      15feb2020       Skewness      -3.991043
99%    15jan2020      15feb2020       Kurtosis       53.37992

                         creatinine
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0            -40
 5%            0             -1
10%            0             -1       Obs          20,132,622
25%            0             -1       Sum of Wgt.    20132622

50%           65                      Mean           1550.736
                        Largest       Std. Dev.      351983.6
75%           80       1.19e+08
90%           94       1.20e+08       Variance       1.24e+11
95%          103       1.21e+08       Skewness       246.9762
99%          133       1.58e+08       Kurtosis       63358.59

                    creatinine_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15dec2004      15dec1899
 5%    15nov2010      15dec1899
10%    15aug2013      15dec1899       Obs          13,932,887
25%    15jan2017      15jan1900       Sum of Wgt.    13932887

50%    15feb2019                      Mean          24sep2017
                        Largest       Std. Dev.      1184.623
75%    15sep2019      15feb2020
90%    15dec2019      15feb2020       Variance        1403331
95%    15jan2020      15feb2020       Skewness      -3.711984
99%    15jan2020      15feb2020       Kurtosis       61.03863

                       smoking_status
-------------------------------------------------------------
no observations

                  smoking_status_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15dec2004      15sep1899
 5%    15mar2010      15sep1899
10%    15aug2012      15sep1899       Obs          18,510,627
25%    15oct2015      15sep1899       Sum of Wgt.    18510627

50%    15jul2018                      Mean          15feb2017
                        Largest       Std. Dev.      1324.059
75%    15jul2019      15feb2020
90%    15nov2019      15feb2020       Variance        1753132
95%    15dec2019      15feb2020       Skewness      -4.690243
99%    15jan2020      15feb2020       Kurtosis       97.51741

              chronic_respiratory_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15sep1991      15jan1860
10%    15may2001      15dec1899       Obs             758,918
25%    15oct2007      15dec1899       Sum of Wgt.     758,918

50%    15apr2013                      Mean          24apr2009
                        Largest       Std. Dev.      6334.135
75%    15mar2017      15aug2020
90%    15mar2019      15aug2020       Variance       4.01e+07
95%    15oct2019      15aug2020       Skewness      -4.825456
99%    15apr2020      15aug2020       Kurtosis       29.41272

                chronic_cardiac_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1840
 5%    15oct1986      15dec1840
10%    15aug1994      15jan1850       Obs           1,270,039
25%    15jun2003      15jan1850       Sum of Wgt.   1,270,039

50%    15may2011                      Mean          31dec2006
                        Largest       Std. Dev.      6562.081
75%    15aug2016      15aug2020
90%    15feb2019      15aug2020       Variance       4.31e+07
95%    15oct2019      15aug2020       Skewness      -4.245324
99%    15jun2020      15sep2106       Kurtosis        24.8831

                        diabetes_type
-------------------------------------------------------------
no observations

                     diabetes_exeter_os
-------------------------------------------------------------
no observations

                       diabetes_exeter
-------------------------------------------------------------
no observations

                     hba1c_mmol_per_mol
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0           -782
 5%            0             -2
10%            0             -1       Obs          20,132,622
25%            0             -1       Sum of Wgt.    20132622

50%            0                      Mean           20.51853
                        Largest       Std. Dev.      1949.889
75%           38         107000
90%           42         111000       Variance        3802068
95%           48         759550       Skewness       4396.737
99%           75        8688000       Kurtosis       1.96e+07

                   hba1c_mmol_per_mol_date
-------------------------------------------------------------
no observations

                      hba1c_percentage
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -1
10%            0             -1       Obs          20,132,622
25%            0             -1       Sum of Wgt.    20132622

50%            0                      Mean           1.777044
                        Largest       Std. Dev.      4264.838
75%            0            935
90%          5.3         231855       Variance       1.82e+07
95%          5.8         930709       Skewness       4470.563
99%          7.8       1.91e+07       Kurtosis       2.00e+07

                    hba1c_percentage_date
-------------------------------------------------------------
no observations

                      cancer_haem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1840
 5%    15jan1986      15jan1860
10%    15jun1994      15dec1899       Obs             110,228
25%    15feb2005      15dec1899       Sum of Wgt.     110,228

50%    15dec2012                      Mean          06aug2008
                        Largest       Std. Dev.      5741.818
75%    15jun2017      15aug2020
90%    15jun2019      15aug2020       Variance       3.30e+07
95%    15jan2020      15aug2020       Skewness      -4.301337
99%    15jun2020      15aug2020       Kurtosis        28.3603

                     cancer_nonhaem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15oct1970      15dec1840
 5%    15jan1991      15jan1860
10%    15jul1997      15jan1860       Obs             930,429
25%    15dec2005      15jan1860       Sum of Wgt.     930,429

50%    15dec2012                      Mean          05oct2009
                        Largest       Std. Dev.       4626.76
75%    15jun2017      15aug2020
90%    15jun2019      15aug2020       Variance       2.14e+07
95%    15jan2020      15nov2020       Skewness        -4.5339
99%    15jun2020      15dec2100       Kurtosis       36.20515

               permanent_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1900
 5%    15jan1993      15jan1900
10%    15jan2000      15jan1900       Obs              50,304
25%    15jan2007      15jan1900       Sum of Wgt.      50,304

50%    30dec2012                      Mean          11apr2009
                        Largest       Std. Dev.      6010.943
75%    15jan2017      15jan2020
90%    15jan2019      15jan2020       Variance       3.61e+07
95%    15jul2019      15jan2020       Skewness      -5.149646
99%    15dec2019      15jan2020       Kurtosis       33.77728

                        asplenia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15mar1956      15dec1899
10%    15nov1966      15dec1899       Obs              26,561
25%    15mar1980      15dec1899       Sum of Wgt.      26,561

50%    15sep1998                      Mean          26jan1993
                        Largest       Std. Dev.      9043.587
75%    15oct2011      15aug2020
90%    15sep2017      15aug2020       Variance       8.18e+07
95%    15mar2019      15aug2020       Skewness      -1.764474
99%    15apr2020      15aug2020       Kurtosis       7.221357

               temporary_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2019      15feb2019
 5%    15feb2019      15feb2019
10%    15mar2019      15feb2019       Obs               5,345
25%    15jun2019      15feb2019       Sum of Wgt.       5,345

50%    15sep2019                      Mean          29aug2019
                        Largest       Std. Dev.      102.4607
75%    15nov2019      15jan2020
90%    15jan2020      15jan2020       Variance        10498.2
95%    15jan2020      15jan2020       Skewness      -.4011049
99%    15jan2020      15jan2020       Kurtosis       2.039541

                 chronic_liver_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1840
 5%    15jan1992      15jan1860
10%    15sep1999      15dec1899       Obs             111,739
25%    15may2007      15dec1899       Sum of Wgt.     111,739

50%    15mar2014                      Mean          25sep2009
                        Largest       Std. Dev.      6317.995
75%    15dec2017      15aug2020
90%    15jul2019      15aug2020       Variance       3.99e+07
95%    15jan2020      15aug2020       Skewness      -4.917637
99%    15jun2020      15aug2020       Kurtosis       30.84041

                    stroke_dementia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1899
 5%    15jan1995      15dec1899
10%    15sep2000      15dec1899       Obs             435,412
25%    15jan2008      15dec1899       Sum of Wgt.     435,412

50%    15apr2014                      Mean          21aug2010
                        Largest       Std. Dev.      5466.105
75%    15dec2017      15aug2020
90%    15aug2019      15sep2020       Variance       2.99e+07
95%    15jan2020      15nov2020       Skewness      -5.442297
99%    15jun2020      15jul2096       Kurtosis       39.39922

                      other_neuro_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jan1965      15jan1800
10%    15jan1980      15jan1860       Obs             189,367
25%    15mar1997      15dec1899       Sum of Wgt.     189,367

50%    15jan2009                      Mean          24apr2002
                        Largest       Std. Dev.      8074.771
75%    15jan2016      15aug2020
90%    15nov2018      15aug2020       Variance       6.52e+07
95%    15sep2019      15aug2020       Skewness      -2.830649
99%    15may2020      15aug2020       Kurtosis       12.72609

                          esrf_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15jun1986      15dec1899
10%    15may1995      15dec1899       Obs              26,760
25%    15dec2005      15dec1899       Sum of Wgt.      26,760

50%    15sep2013                      Mean          08jul2008
                        Largest       Std. Dev.      6762.343
75%    15dec2017      15aug2020
90%    15aug2019      15aug2020       Variance       4.57e+07
95%    15jan2020      15aug2020       Skewness      -4.346118
99%    15jun2020      15aug2020       Kurtosis       25.08838

                        dialysis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15jan1990      15dec1899
10%    15jan1998      15dec1899       Obs              21,737
25%    15jan2007      15dec1899       Sum of Wgt.      21,737

50%    15jun2014                      Mean          19aug2009
                        Largest       Std. Dev.      6380.689
75%    15apr2018      15aug2020
90%    15sep2019      15aug2020       Variance       4.07e+07
95%    15feb2020      15aug2020       Skewness      -4.708728
99%    15jul2020      15aug2020       Kurtosis       29.05447

                   kidney_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15jun1987      15dec1899
10%    15jan1994      15dec1899       Obs              15,096
25%    15jan2004      15jan1900       Sum of Wgt.      15,096

50%    15aug2011                      Mean          15nov2007
                        Largest       Std. Dev.      5527.095
75%    15jul2016      15aug2020
90%    15nov2018      15aug2020       Variance       3.05e+07
95%    15aug2019      15aug2020       Skewness      -4.444198
99%    15may2020      15aug2020       Kurtosis       30.64725

                    other_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1962      15jan1900
 5%    15sep1992      15jan1900
10%    15jan1997      15jan1900       Obs               4,717
25%    15dec2003      15jan1900       Sum of Wgt.       4,717

50%    15aug2010                      Mean          17feb2008
                        Largest       Std. Dev.      4857.944
75%    15nov2015      15aug2020
90%    15aug2018      15aug2020       Variance       2.36e+07
95%    15jul2019      15aug2020       Skewness      -4.914259
99%    15apr2020      15aug2020       Kurtosis       38.78803

                      hypertension_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jun1986      15jan1800
10%    15jan1994      15jan1800       Obs           3,881,037
25%    15dec2001      15jan1800       Sum of Wgt.   3,881,037

50%    15feb2008                      Mean          18sep2004
                        Largest       Std. Dev.      7188.645
75%    15oct2014      15sep2037
90%    15mar2018      15jun2055       Variance       5.17e+07
95%    15apr2019      15nov2056       Skewness      -4.125059
99%    15mar2020      15feb2058       Kurtosis       22.13805

                    ra_sle_psoriasis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jan1972      15jan1800
10%    15jun1984      15jan1840       Obs             942,241
25%    15jan1998      15jan1840       Sum of Wgt.     942,241

50%    15jun2007                      Mean          18jun2002
                        Largest       Std. Dev.      7311.006
75%    15feb2014      15aug2020
90%    15nov2017      15aug2020       Variance       5.35e+07
95%    15feb2019      15mar2082       Skewness      -3.095487
99%    15feb2020      15mar3000       Kurtosis       22.77793

                           asthma
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          20,132,622
25%            0              0       Sum of Wgt.    20132622

50%            0                      Mean           .1775151
                        Largest       Std. Dev.      .4232507
75%            0              2
90%            1              2       Variance       .1791412
95%            1              2       Skewness       2.320361
99%            2              2       Kurtosis       7.780618

                        diabetes_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1860
 5%    15apr1995      15jan1860
10%    15jan2001      15jan1860       Obs           1,787,264
25%    15nov2006      15jan1860       Sum of Wgt.   1,787,264

50%    15may2013                      Mean          10feb2010
                        Largest       Std. Dev.      5248.833
75%    15jul2017      15feb2020
90%    15feb2019      15feb2020       Variance       2.76e+07
95%    15aug2019      15feb2020       Skewness      -5.494756
99%    15dec2019      15feb2020       Kurtosis       41.12752

                       covid_icu_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    13mar2020      28jan2020
 5%    20mar2020      01mar2020
10%    24mar2020      02mar2020       Obs               3,154
25%    30mar2020      02mar2020       Sum of Wgt.       3,154

50%    07apr2020                      Mean          13apr2020
                        Largest       Std. Dev.      23.35723
75%    21apr2020      26jul2020
90%    17may2020      28jul2020       Variance       545.5604
95%    05jun2020      30jul2020       Skewness       1.626987
99%    02jul2020      30jul2020       Kurtosis       5.817807

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    03jan2020      05feb2019
 5%    03feb2020      06feb2019
10%    13feb2020      09feb2019       Obs             111,898
25%    15mar2020      10feb2019       Sum of Wgt.     111,898

50%    18apr2020                      Mean          19apr2020
                        Largest       Std. Dev.      52.64242
75%    27may2020      01aug2020
90%    02jul2020      01aug2020       Variance       2771.224
95%    15jul2020      01aug2020       Skewness      -.5265643
99%    26jul2020      01aug2020       Kurtosis       5.598495

. 
. 
. /* CREATE VARIABLES===========================================================*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(10,207,842 missing values generated)

. replace male = 0 if sex == "F"
(10,207,519 real changes made)

. 
. * Ethnicity 
. replace ethnicity = .u if ethnicity == .
(5,155,572 real changes made, 5,155,572 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                                       ///
>                                                 3 "Asian or Asian British"      ///
>                                                 4 "Black"                                       ///
>                                                 5 "Other"                                       ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(20,132,590 missing values generated)

. replace stp = sum(stp)
(20,132,621 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(20,132,622 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(209,439 real changes made, 209,439 to missing)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 15911523 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age 18/29.9999 = 1 /// 
>                    30/39.9999 = 2 /// 
>            40/49.9999 = 3 ///
>                    50/59.9999 = 4 ///
>                60/69.9999 = 5 ///
>                    70/79.9999 = 6 ///
>                    80/max = 7, gen(agegroup) 
(18039635 differences between age and agegroup)

. 
. label define agegroup   1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Create binary age (for age stratification)
. recode age min/65.999999999 = 0 ///
>            66/max = 1, gen(age66)
(20080600 differences between age and age66)

. 
. * Check there are no missing ages
. assert age < .

. assert agegroup < .

. assert age66 < .

. 
. 
. /* APPLY HH level INCLUSION/EXCLUIONS==================================================*/ 
. 
. noi di "DROP if HH ID==0"
DROP if HH ID==0

. count if household_id==0
  2,587,128

. drop if household_id==0
(2,587,128 observations deleted)

. count
  17,545,494

. 
. drop if care_home_type!="U"
(94,895 observations deleted)

. count
  17,450,599

. 
. noi di "DROP HH>=10 persons:"
DROP HH>=10 persons:

. sum household_size, d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs          17,450,599
25%            2              1       Sum of Wgt.    17450599

50%            3                      Mean            5.27389
                        Largest       Std. Dev.       49.9099
75%            4           2590
90%            5           2590       Variance       2490.998
95%            7           2590       Skewness       31.92968
99%           12           2590       Kurtosis       1281.828

. drop if household_size>=10
(281,024 observations deleted)

. count
  17,169,575

. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. recode male .=9
(male: 287 changes made)

. recode male .u=9
(male: 0 changes made)

. bysort household_id: egen male_drop=max(male)

. drop if male_drop==9
(696 observations deleted)

. count
  17,168,879

. 
. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. recode age .=9
(age: 0 changes made)

. recode age .u=9
(age: 0 changes made)

. bysort household_id: egen age_drop=max(age)

. drop if age_drop==9
(5,868 observations deleted)

. count
  17,163,011

. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. recode imd .=9
(imd: 0 changes made)

. recode imd .u=9
(imd: 195024 changes made)

. bysort household_id: egen imd_drop=max(imd)

. drop if imd_drop==9
(214,098 observations deleted)

. count
  16,948,913

. **************************** HOUSEHOLD VARS*******************************************
. 
. *No kids/kids under 12/up to 18
. *Identify kids under 12, or kids under 18
. gen nokids=1 if age<12
(15,832,052 missing values generated)

. recode nokids .=2 if age<18 
(nokids: 695327 changes made)

. bysort household_id: egen min_kids=min(nokids) 
(12511472 missing values generated)

. gen kids_cat3=min_kids
(12,511,472 missing values generated)

. recode kids_cat3 .=0 
(kids_cat3: 12511472 changes made)

. lab define kids_cat3  0 "No kids" 1 "Kids under 12" 2 "Kids under 18"

. lab val kids_cat3 kids_cat3

. drop min_kids

. 
. *Dose-response exposure
. recode nokids 2=.
(nokids: 695327 changes made)

. bysort household_id: egen number_kids=count(nokids)

. gen gp_number_kids=number_kids

. recode gp_number_kids 3/max=3
(gp_number_kids: 13472 changes made)

. recode gp_number_kids 1=2 2=3 3=4
(gp_number_kids: 2957633 changes made)

. replace gp_number_kids=0 if kids_cat3==0 
(0 real changes made)

. replace gp_number_kids=1 if kids_cat3==2 
(1,479,808 real changes made)

. 
. lab var gp_number_kids "Number kids under 12 years in hh"

. drop nokids

. lab define   gp_number_kids 0 none  1 "only >12 years" ///
> 2 "1 child <12" ///
> 3 "2 children <12" ///
> 4 "3+ children <12"

. lab val gp_number_kids gp_number_kids

. 
. tab kids_cat3 gp_number_kids, miss

              |            Number kids under 12 years in hh
    kids_cat3 |      none  only >12   1 child <  2 childre  3+ childr |     Total
--------------+-------------------------------------------------------+----------
      No kids |12,511,472          0          0          0          0 |12,511,472 
Kids under 12 |         0          0  2,237,064    616,733    103,836 | 2,957,633 
Kids under 18 |         0  1,479,808          0          0          0 | 1,479,808 
--------------+-------------------------------------------------------+----------
        Total |12,511,472  1,479,808  2,237,064    616,733    103,836 |16,948,913 

.  
. 
. /* DROP ALL KIDS, AS HH COMPOSITION VARS ARE NOW MADE */
. drop if age<18
(1,812,188 observations deleted)

. 
. *Total number adults in household (to check hh size)
. bysort household_id: gen tot_adults_hh=_N

. recode tot_adults_hh 3/max=3
(tot_adults_hh: 1881227 changes made)

. 
. 
. /* SET FU DATES===============================================================*/ 
. * Censoring dates for each outcome (largely, last date outcome data available)
. *****NEEDS UPDATING WHEN INFO AVAILABLE*******************
. global onscoviddeathcensor      = "03/08/2020"

. 
. *Start dates
. global indexdate                            = "01/02/2020"

. 
. 
. 
. 
. 
. 
. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. rename dereg_date_date                                          dereg_date

. 
. /* CREATE BINARY VARIABLES====================================================*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes_date  ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 dialysis                                        ///
>                                                 kidney_transplant                       ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         
. }

. 
. 
. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(2,697,329 real changes made, 2,697,329 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(117,182 real changes made, 117,182 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(2,643,819 missing values generated)

. gen bmi_age = age - bmi_time
(2,643,819 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(38,360 real changes made, 38,360 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(209,052 real changes made, 209,052 to missing)

. replace bmi_measured = . if bmi == . 
(2,852,871 real changes made, 2,852,871 to missing)

. 
. gen     bmicat = .
(15,136,725 missing values generated)

. recode  bmicat . = 1 if bmi < 18.5
(bmicat: 278909 changes made)

. recode  bmicat . = 2 if bmi < 25
(bmicat: 4373233 changes made)

. recode  bmicat . = 3 if bmi < 30
(bmicat: 4229346 changes made)

. recode  bmicat . = 4 if bmi < 35
(bmicat: 2146808 changes made)

. recode  bmicat . = 5 if bmi < 40
(bmicat: 833624 changes made)

. recode  bmicat . = 6 if bmi < .
(bmicat: 421934 changes made)

. replace bmicat = .u if bmi >= .
(2,852,871 real changes made, 2,852,871 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Create less  granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(14857816 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(8,019,306 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(5,090,292 real changes made)

. replace smoke = 3  if smoking_status == "S"
(2,717,064 real changes made)

. replace smoke = .u if smoking_status == "M"
(211,950 real changes made, 211,950 to missing)

. replace smoke = .u if smoking_status == "" 
(0 real changes made)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(211950 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(cancer_haem_date, d(1/1/1900), d(1/2/2015))
(15,080,685 missing values generated)

. replace cancer_haem_cat = 3 if inrange(cancer_haem_date, d(1/2/2015), d(1/2/2019))
(24,754 real changes made)

. replace cancer_haem_cat = 2 if inrange(cancer_haem_date, d(1/2/2019), d(1/2/2020))
(7,979 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 15047952 changes made)

. label values cancer_haem_cat cancer

. 
. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(cancer_nonhaem_date,  d(1/1/1900), d(1/2/2015)) 
(14,659,075 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(cancer_nonhaem_date,  d(1/2/2015), d(1/2/2019))
(205,921 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(cancer_nonhaem_date,  d(1/2/2019), d(1/2/2020)) 
(70,196 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 14382958 changes made)

. label values cancer_exhaem_cat cancer

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(15,095,551 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), date("$indexdate", "DMY"))

. 
. egen other_immuno = rowmax(temp1 temp2)

. drop temp1 temp2 

. order other_immuno, after(temp_immunodef)

. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(10,425,050 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(2,663,101 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(7,070,151 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(3,285,593 real changes made)

. replace bpcat = .u if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(1,281,013 real changes made, 1,281,013 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" .u "Unknown"

. label values bpcat bpcat

. 
. recode bpcat .u=1, gen(bpcat_nomiss)
(1281013 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 1945905 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(3,680,291 real changes made, 3,680,291 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(3,680,291 missing values generated)

. 
. gen min=.
(15,136,725 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(6,268,487 real changes made)

. replace min = SCr_adj/0.9 if male==1
(5,187,947 real changes made)

. replace min = min^-0.329  if male==0
(6,268,487 real changes made)

. replace min = min^-0.411  if male==1
(5,187,947 real changes made)

. replace min = 1 if min<1
(7,557,932 real changes made)

. 
. gen max=.
(15,136,725 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(6,268,487 real changes made)

. replace max=SCr_adj/0.9 if male==1
(5,187,947 real changes made)

. replace max=max^-1.209
(11,456,434 real changes made)

. replace max=1 if max>1
(7,578,793 real changes made)

. 
. gen egfr=min*max*141
(3,680,291 missing values generated)

. replace egfr=egfr*(0.993^age)
(11,456,434 real changes made)

. replace egfr=egfr*1.018 if male==0
(6,268,487 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(3680291 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(11456434 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. *label var ckd "CKD stage calc without eth"
. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
.         
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(10800591 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(3,680,291 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. lab var  reduced "Reduced kidney function"

. 
. 
. /*ESDR: dialysis or kidney transplant*/
. gen esrd=1 if dialysis==1 | kidney_transplant==1
(15,113,886 missing values generated)

. recode esrd .=0
(esrd: 15113886 changes made)

. 
. 
. 
. ***************************
. /* DM / Hb1AC */
. ***************************
. 
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(13,027,583 real changes made, 13,027,583 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(6,915,349 real changes made, 6,915,349 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |  2,109,142    15.80537    13176.49        .01   1.91e+07
hba1c_mmol~l |  8,221,376    42.21281    3048.361         .4    8688000

. gen     hba1c_pct = hba1c_percentage 
(13,027,583 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(8,221,374 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(624 real changes made, 624 to missing)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(8,221,447 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(15,056,005 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(1,103,032 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(343,442 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(13,609,531 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |13,609,531          0          0          0 |13,609,531 
         1 |         0     80,720          0          0 |    80,720 
         2 |         0          0  1,103,032          0 | 1,103,032 
         3 |         0          0          0    343,442 |   343,442 
-----------+--------------------------------------------+----------
     Total |13,609,531     80,720  1,103,032    343,442 |15,136,725 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(15,066,025 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(1,100,612 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(13,965,413 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(7,855,361 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(529,316 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(140,240 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(153,429 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(176,477 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |  7,281,364       87.93       87.93
  >=6.5-7.4 |    529,316        6.39       94.32
  >=7.5-7.9 |    140,240        1.69       96.02
    >=8-8.9 |    153,429        1.85       97.87
        >=9 |    176,477        2.13      100.00
------------+-----------------------------------
      Total |  8,280,826      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(7,326,045 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(470,146 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,810,680       51.60       51.60
          1 |    470,146        3.11       54.71
          . |  6,855,899       45.29      100.00
------------+-----------------------------------
      Total | 15,136,725      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0 | dm_type==.
(1,527,194 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(20,899 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(58,461 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(691,337 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(405,255 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(7,800 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"            ///
>                                                 3 "T1DM, uncontrolled"          ///
>                                                 4 "T2DM, controlled"            ///
>                                                 5 "T2DM, uncontrolled"          ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 13,609,531       89.91       89.91
  T1DM, controlled |     20,899        0.14       90.05
T1DM, uncontrolled |     58,461        0.39       90.43
  T2DM, controlled |    691,337        4.57       95.00
T2DM, uncontrolled |    405,255        2.68       97.68
Diabetes, no HbA1c |      7,800        0.05       97.73
                 . |    343,442        2.27      100.00
-------------------+-----------------------------------
             Total | 15,136,725      100.00

. 
. 
. 
. 
. /*  Asthma  */
. 
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3
(asthmacat: 15136725 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. /*  Probable shielding  */
. gen shield=1 if esrd==1 | other_transplant==1 | asthmacat==2 | asthmacat==3 | ///
> chronic_respiratory_disease==1 | cancer_haem==1 | cancer_nonhaem==1 | ///
> asplenia==1 | other_immuno==1
(11,475,199 missing values generated)

. recode shield .=0
(shield: 11475199 changes made)

. 
. recode positive_covid_test_ever .=0
(positive_covid_test_ever: 0 changes made)

. 
. /* OUTCOME AND SURVIVAL TIME==================================================*/
. 
. /*  Cohort entry and censor dates  */
. * Date of cohort entry, 1 Mar 2020
. gen enter_date = date("$indexdate", "DMY")

. 
. * Date of study end (typically: last date of outcome data available)
. **** NOTE!! NEEDS UPDATING!!!!
. gen onscoviddeathcensor_date        = date("$onscoviddeathcensor",      "DMY")

. gen tpp_infec_censor_date           = date("$tpp_infec_censor",         "DMY")
(15,136,725 missing values generated)

.         
. * Format the dates
. format  enter_date                                      ///
>                 onscoviddeathcensor_date   %td

.                         
.                 
.                         /****   Outcome definitions   ****/
. 
. * Date of Covid death in ONS
. gen died_date_onscovid = died_date_ons if died_ons_covid_flag_any == 1
(15,126,711 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen died_date_onsnoncovid = died_date_ons if died_ons_covid_flag_any != 1 
(15,072,477 missing values generated)

. gen covid_icu_death_date=min(covid_icu_date, died_date_onscovid)
(15,125,103 missing values generated)

. 
. *Date probable covid in TPP
. rename covid_tpp_probable date_covid_tpp_prob

. 
. format died_date_ons %td

. format died_date_onscovid %td 

. format died_date_onsnoncovid %td

. format covid_icu_death_date %td 

. 
. * Binary indicators for outcomes
. gen covid_tpp_prob = (date_covid_tpp_prob < .)

. gen non_covid_death = (died_date_onsnoncovid < .)

. gen covid_death = (died_date_onscovid < .)

. gen covid_icu = (covid_icu_date < .)

. gen covid_death_icu = (covid_icu_death_date < .)

. 
. 
. 
.                                         /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: end study, death, or that outcome)
. *gen stime_onscoviddeath = min(onscoviddeathcensor_date,                                died_date_ons)
. gen stime_covid_tpp_prob = min(onscoviddeathcensor_date,        died_date_ons, date_covid_tpp_prob, dereg_date)

. gen stime_non_covid_death = min(onscoviddeathcensor_date,       died_date_ons, died_date_onsnoncovid)

. gen stime_covid_death_icu = min(onscoviddeathcensor_date, died_date_ons, died_date_onscovid, covid_icu_date)

. 
. 
. * If outcome was after censoring occurred, set to zero
. replace covid_tpp_prob = 0 if (date_covid_tpp_prob > onscoviddeathcensor_date)
(2,265 real changes made)

. replace non_covid_death = 0 if (died_date_onsnoncovid > onscoviddeathcensor_date)
(0 real changes made)

. replace covid_death_icu = 0 if (covid_icu_death_date > onscoviddeathcensor_date)
(0 real changes made)

. 
. 
. * Format date variables
. format  stime* %td 

. 
. 
. /* LABEL VARIABLES============================================================*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var kids_cat3 "Presence of children or young people in the household"

. label var  number_kids "Number of children aged 1-<12 years in household"

. label var  household_size "Number people in household"

. label var  household_id "Household ID"

. 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age66                                         "66 years and older"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI, kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date measured"

. label var obese4cat                                     "Evidence of obesity (4 categories)"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set to non)"

. label var imd                                           "Index of Multiple Deprivation (IMD)"

. label var ethnicity                                     "Ethnicity"

. label var stp                                           "Sustainability and Transformation Partnership"

. lab var care_home_type                          "Care home type"

. lab var tot_adults_hh                           "Total number adults in hh"

. lab var positive_covid_test_ever        "Ever having had positive covid test"

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma category"

. label var egfr_cat                                              "Calculated eGFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haematological cancer"

. label var cancer_exhaem_cat                                             "Non-haematological cancer"

. label var kidney_transplant                                             "Kidney transplant"     

. label var other_transplant                                              "Other solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (combination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"                  

. label var stroke_dementia                           "Stroke or dementia"                                                        

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosuppression"

. lab var temp_immunodef                                  "Temporary immunosuppression"

. lab var esrd                                                    "End-stage renal disease"

. 
. 
. label var hypertension_date                                     "Diagnosed hypertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases Date"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Date"

. label var cancer_haem_date                                      "Haem cancer Date"

. label var cancer_nonhaem_date                           "Non-haem cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date              "Neurological disease  Date"

. label var stroke_dementia_date                      "Stroke or dementia date"                                                   

. label var ra_sle_psoriasis_date                         "Autoimmune disease  Date"

. lab var perm_immunodef_date                             "Permanent immunosuppression date"

. lab var temp_immunodef_date                             "Temporary immunosuppression date"

. label var kidney_transplant_date                                                "Kidney transplant"     

. label var other_transplant_date                                         "Other solid organ transplant"

. label var asplenia_date                                                 "Asplenia date"

. lab var  bphigh "non-missing indicator of known high blood pressure"

. lab var bpcat "Blood pressure four levels, non-missing"

. lab var htdiag_or_highbp "High blood pressure or hypertension diagnosis"

. lab var shield "Probable shielding"

. 
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. label var onscoviddeathcensor_date              "Date of admin censoring for ONS deaths"

. label var tpp_infec_censor_date                 "Date of admin censoring for covid TPP cases"

. label var covid_icu_death_date                  "Date of admin censoring for covid death or ICU"

. 
. label var  covid_tpp_prob                               "Failure/censoring indicator for outcome: covid prob case"

. label var  non_covid_death                              "Failure/censoring indicator for outcome: non-covid death"

. label var  covid_death                              "Failure/censoring indicator for outcome: covid death"

. label var  covid_icu                                "Failure/censoring indicator for outcome: covid icu"

. label var  covid_death_icu                       "Failure/censoring indicator for outcome: covid icu/death"

. 
. label var date_covid_tpp_prob                   "Date of covid TPP case (probable)"

. label var died_date_onsnoncovid                 "Date of ONS non-COVID Death"

. label var  died_date_onscovid                   "Date of ONS COVID Death"

. lab var covid_icu_date                                  "Date admission to ICU for COVID" 

. 
. * Survival times
. label var  stime_covid_tpp_prob                                 "Survival tme (date); outcome "

. label var  stime_non_covid_death                                "Survival tme (date); outcome non_covid_death   "

. label var  stime_covid_death_icu                                "Survival time (date); outcome covid death"

. 
. *Key DATES
. label var   died_date_ons                               "Date death ONS"

. label var  has_12_m_follow_up                   "Has 12 months follow-up"

. lab var  dereg_date                                             "Date deregistration from practice"

. 
. 
. 
. 
. /* TIDY DATA==================================================================*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
died_ons_c~y  bp_sys_dat~e  creatinine    diabetes_t~e  hba1c_per~ge  esrf          male_drop     SCr_adj       dm_type_ex~s
died_ons_c~g  bp_sys_dat~d  crea~te_date  diabetes_e~s  hba1c_per~te  dialysis_d~e  age_drop      min           hba1ccat
ethnicity_~e  bp_dias       crea~ne_date  diabetes_e~r  cancer_haem   dialysis      imd_drop      max           hba1c75
bmi_measured  bp_dias_da~e  smoki~e_date  hba1c_mmol~l  cancer_non~m  asthmacat     bmi_time      hba1c_pct
bp_sys        bp_dias_da~d  smoki~s_date  hba1c_mmol~e  esrf_date     diabetes      bmi_age       dm_type

. drop `r(varlist)'

.         
. 
.         
. 
. /* APPLY INCLUSION/EXCLUIONS==================================================*/ 
. 
. *************TEMP DROP TO INVESTIGATE ASSOCIATIONS MORE EASILY******************
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(10 observations deleted)

. count
  15,136,715

. 
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if died_date_ons <= date("$indexdate", "DMY")
(985 observations deleted)

. count
  15,135,730

. 
. noi di "DROP IF COVID IN TPP BEFORE INDEX"
DROP IF COVID IN TPP BEFORE INDEX

. drop if date_covid_tpp_prob <= date("$indexdate", "DMY")
(260 observations deleted)

. count
  15,135,470

.         
.         
. ***************
. *  Save data  *
. ***************
. sort patient_id

. save $tempdir\analysis_dataset, replace
file tempdata\analysis_dataset.dta saved

. 
. 
. 
. use  $tempdir\analysis_dataset, clear

. keep if age<=65
(3,473,837 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir\analysis_dataset_ageband_0, replace
file tempdata\analysis_dataset_ageband_0.dta saved

. 
. 
. use  $tempdir\analysis_dataset, clear

. keep if age>65
(11,661,633 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir\analysis_dataset_ageband_1, replace
file tempdata\analysis_dataset_ageband_1.dta saved

. 
. 
. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_ageband_`x', clear
  3. * Save a version set on NON ONS covid death outcome
. stset stime_non_covid_death, fail(non_covid_death)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  4. *WEIGHTING - TO REDUCE TIME 
. set seed 30459820
  5. keep if _d==1|uniform()<.03
  6. gen pw = 1
  7. replace pw = (1/0.03) if _d==0
  8. stset stime_non_covid_death [pweight = pw],  fail(non_covid_death)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  9. save "$tempdir\cr_create_analysis_dataset_STSET_non_covid_death_ageband_`x'.dta", replace
 10.         
. 
. use $tempdir\analysis_dataset_ageband_`x', clear
 11. * Save a version set on covid death/icu  outcome
. stset stime_covid_death_icu, fail(covid_death_icu)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 12. *WEIGHTING - TO REDUCE TIME 
. set seed 30459820
 13. keep if _d==1|uniform()<.03
 14. gen pw = 1
 15. replace pw = (1/0.03) if _d==0
 16. stset stime_covid_death_icu [pweight = pw],  fail(covid_death_icu)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 17. save "$tempdir\cr_create_analysis_dataset_STSET_covid_death_icu_ageband_`x'.dta", replace
 18. 
. 
. use $tempdir\analysis_dataset_ageband_`x', clear
 19. * Save a version set on probable covid
. stset stime_covid_tpp_prob, fail(covid_tpp_prob)                                ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 20. *WEIGHTING - TO REDUCE TIME 
. set seed 30459820
 21. keep if _d==1|uniform()<.03
 22. gen pw = 1
 23. replace pw = (1/0.03) if _d==0
 24. stset stime_covid_tpp_prob [pweight = pw],  fail(covid_tpp_prob)                                ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 25. save "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'.dta", replace        
 26. }

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   11661633  total observations
          0  exclusions
------------------------------------------------------------------------------
   11661633  observations remaining, representing
   11661633  subjects
     10,217  failures in single-failure-per-subject data
 2.1446e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
(11,301,728 observations deleted)
(349,688 real changes made)

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
    359,905  total observations
          0  exclusions
------------------------------------------------------------------------------
    359,905  observations remaining, representing
    359,905  subjects
     10,217  failures in single-failure-per-subject data
   65199507  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
file tempdata\cr_create_analysis_dataset_STSET_non_covid_death_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_death_icu != 0 & covid_death_icu < .
obs. time interval:  (stime_covid_death_icu[_n-1], stime_covid_death_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   11661633  total observations
          1  observation ends on or before enter()
------------------------------------------------------------------------------
   11661632  observations remaining, representing
   11661632  subjects
      2,705  failures in single-failure-per-subject data
 2.1444e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
(11,309,029 observations deleted)
(349,899 real changes made)

                id:  patient_id
     failure event:  covid_death_icu != 0 & covid_death_icu < .
obs. time interval:  (stime_covid_death_icu[_n-1], stime_covid_death_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
    352,604  total observations
          0  exclusions
------------------------------------------------------------------------------
    352,604  observations remaining, representing
    352,604  subjects
      2,705  failures in single-failure-per-subject data
   64557535  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
(note: file tempdata\cr_create_analysis_dataset_STSET_covid_death_icu_ageband_0.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_covid_death_icu_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   11661633  total observations
          0  exclusions
------------------------------------------------------------------------------
   11661633  observations remaining, representing
   11661633  subjects
     33,450  failures in single-failure-per-subject data
 2.1288e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
(11,279,234 observations deleted)
(348,949 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
    382,399  total observations
          0  exclusions
------------------------------------------------------------------------------
    382,399  observations remaining, representing
    382,399  subjects
     33,450  failures in single-failure-per-subject data
   67260571  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
file tempdata\cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.dta saved

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
  3,473,837  total observations
          0  exclusions
------------------------------------------------------------------------------
  3,473,837  observations remaining, representing
  3,473,837  subjects
     53,034  failures in single-failure-per-subject data
  633109344  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
(3,318,205 observations deleted)
(102,598 real changes made)

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
    155,632  total observations
          0  exclusions
------------------------------------------------------------------------------
    155,632  observations remaining, representing
    155,632  subjects
     53,034  failures in single-failure-per-subject data
   23378193  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
file tempdata\cr_create_analysis_dataset_STSET_non_covid_death_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_death_icu != 0 & covid_death_icu < .
obs. time interval:  (stime_covid_death_icu[_n-1], stime_covid_death_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
  3,473,837  total observations
          0  exclusions
------------------------------------------------------------------------------
  3,473,837  observations remaining, representing
  3,473,837  subjects
      8,905  failures in single-failure-per-subject data
  633067149  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
(3,361,040 observations deleted)
(103,892 real changes made)

                id:  patient_id
     failure event:  covid_death_icu != 0 & covid_death_icu < .
obs. time interval:  (stime_covid_death_icu[_n-1], stime_covid_death_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
    112,797  total observations
          0  exclusions
------------------------------------------------------------------------------
    112,797  observations remaining, representing
    112,797  subjects
      8,905  failures in single-failure-per-subject data
   19708130  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
(note: file tempdata\cr_create_analysis_dataset_STSET_covid_death_icu_ageband_1.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_covid_death_icu_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
  3,473,837  total observations
          0  exclusions
------------------------------------------------------------------------------
  3,473,837  observations remaining, representing
  3,473,837  subjects
     15,583  failures in single-failure-per-subject data
  630360961  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
(3,354,554 observations deleted)
(103,700 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
    119,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    119,283  observations remaining, representing
    119,283  subjects
     15,583  failures in single-failure-per-subject data
   20254057  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       184
file tempdata\cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\01_cr_analysis_dataset.log
  log type:  text
 closed on:  22 Aug 2020, 12:52:08
----------------------------------------------------------------------------------------------------------------------------------
