----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\03a_an_descriptive_tables.log
  log type:  text
 opened on:  22 Aug 2020, 13:07:53

. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_ageband_`x', clear
  3. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. safetab htdiag_or_highbp, m
 16. safetab imd 
 17. safetab imd, m
 18. safetab ethnicity
 19. safetab ethnicity, m
 20. safetab stp
 21. safetab tot_adults_hh
 22. safetab household_size
 23. safetab household_size imd, col chi
 24. 
. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat   ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 25.                                                 
. safetab `var'
 26. }
 27. safetab shield
 28. 
. 
. *Exposure 
. foreach var in kids_cat3 gp_number_kids {
 29. safetab `var'
 30. }
 31. 
. * Outcomes
. foreach var in covid_death_icu non_covid_death  ///
>  covid_tpp_prob {
 32. safetab `var'
 33. }
 34. 
. 
. * Outcomes by exposure
. foreach var in covid_death_icu non_covid_death  ///
>  covid_tpp_prob {
 35. safetab `var'
 36. safetab `var' kids_cat3, col row
 37. safetab `var' gp_number_kids, col row
 38. 
. }
 39. 
. **********************************
. *  Number (%) with each exposure  *
. **********************************
. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                        kids_cat3, col
 40.         safetab male                                                            kids_cat3, col
 41.         safetab bmicat                                                          kids_cat3, col m 
 42.         safetab smoke                                                           kids_cat3, col m
 43.         safetab obese4cat                                                       kids_cat3, col m 
 44.         safetab shield                                                          kids_cat3, col m 
 45.         safetab tot_adults_hh                                           kids_cat3, col m 
 46.         safetab household_size                                          kids_cat3, col m 
 47.         safetab imd                                                             kids_cat3, col m
 48.         safetab ethnicity                                                       kids_cat3, col m
 49.         safetab stp                                                             kids_cat3, col
 50.         
.         
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 51.         safetab `var'           kids_cat3, col
 52. }
 53.         
. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 11,661,633    41.89455    13.22727         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  2,590,202       22.21       22.21
     30-<40 |  2,703,210       23.18       45.39
     40-<50 |  2,458,941       21.09       66.48
     50-<60 |  2,598,630       22.28       88.76
     60-<70 |  1,310,650       11.24      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,661,633      100.00      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  5,891,933       50.52       50.52
          1 |  5,769,700       49.48      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    219,615        2.41        2.41
  Normal (18.5-24.9) |  3,383,773       37.15       39.56
Overweight (25-29.9) |  2,990,922       32.84       72.40
   Obese I (30-34.9) |  1,537,333       16.88       89.27
  Obese II (35-39.9) |    633,057        6.95       96.22
     Obese III (40+) |    343,997        3.78      100.00
---------------------+-----------------------------------
               Total |  9,108,697      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    219,615        1.88        1.88
  Normal (18.5-24.9) |  3,383,773       29.02       30.90
Overweight (25-29.9) |  2,990,922       25.65       56.55
   Obese I (30-34.9) |  1,537,333       13.18       69.73
  Obese II (35-39.9) |    633,057        5.43       75.16
     Obese III (40+) |    343,997        2.95       78.11
        Unknown (.u) |  2,552,936       21.89      100.00
---------------------+-----------------------------------
               Total | 11,661,633      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  9,147,246       78.44       78.44
   Obese I (30-34.9) |  1,537,333       13.18       91.62
  Obese II (35-39.9) |    633,057        5.43       97.05
     Obese III (40+) |    343,997        2.95      100.00
---------------------+-----------------------------------
               Total | 11,661,633      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,726,231       49.98       49.98
      Former |  3,302,174       28.82       78.80
     Current |  2,428,631       21.20      100.00
-------------+-----------------------------------
       Total | 11,457,036      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,726,231       49.10       49.10
      Former |  3,302,174       28.32       77.42
     Current |  2,428,631       20.83       98.25
Unknown (.u) |    204,597        1.75      100.00
-------------+-----------------------------------
       Total | 11,661,633      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,039,378       29.22       29.22
      Elevated |  1,680,731       16.16       45.38
 High, stage I |  3,656,085       35.15       80.53
High, stage II |  2,024,773       19.47      100.00
---------------+-----------------------------------
         Total | 10,400,967      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,039,378       26.06       26.06
      Elevated |  1,680,731       14.41       40.48
 High, stage I |  3,656,085       31.35       71.83
High, stage II |  2,024,773       17.36       89.19
       Unknown |  1,260,666       10.81      100.00
---------------+-----------------------------------
         Total | 11,661,633      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,860,758       75.98       75.98
          1 |  2,800,875       24.02      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,860,758       75.98       75.98
          1 |  2,800,875       24.02      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,202,080       18.88       18.88
               2 |  2,326,807       19.95       38.84
               3 |  2,363,210       20.26       59.10
               4 |  2,457,892       21.08       80.18
 5 most deprived |  2,311,644       19.82      100.00
-----------------+-----------------------------------
           Total | 11,661,633      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,202,080       18.88       18.88
               2 |  2,326,807       19.95       38.84
               3 |  2,363,210       20.26       59.10
               4 |  2,457,892       21.08       80.18
 5 most deprived |  2,311,644       19.82      100.00
-----------------+-----------------------------------
           Total | 11,661,633      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,447,428       82.83       82.83
                 Mixed |    153,747        1.71       84.54
Asian or Asian British |    811,754        9.03       93.57
                 Black |    298,222        3.32       96.89
                 Other |    279,981        3.11      100.00
-----------------------+-----------------------------------
                 Total |  8,991,132      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,447,428       63.86       63.86
                 Mixed |    153,747        1.32       65.18
Asian or Asian British |    811,754        6.96       72.14
                 Black |    298,222        2.56       74.70
                 Other |    279,981        2.40       77.10
               Unknown |  2,670,501       22.90      100.00
-----------------------+-----------------------------------
                 Total | 11,661,633      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,143        0.03        0.03
          2 |  1,112,430        9.54        9.57
          3 |    508,599        4.36       13.93
          4 |    117,057        1.00       14.93
          5 |     81,859        0.70       15.63
          6 |    547,952        4.70       20.33
          7 |     31,962        0.27       20.61
          8 |    427,096        3.66       24.27
          9 |    330,192        2.83       27.10
         10 |    465,302        3.99       31.09
         11 |    523,379        4.49       35.58
         12 |    175,756        1.51       37.09
         13 |    261,804        2.25       39.33
         14 |    324,100        2.78       42.11
         15 |    417,102        3.58       45.69
         16 |    412,025        3.53       49.22
         17 |    357,492        3.07       52.28
         18 |    515,798        4.42       56.71
         19 |    401,849        3.45       60.15
         20 |    577,011        4.95       65.10
         21 |    919,696        7.89       72.99
         22 |     60,889        0.52       73.51
         23 |    444,332        3.81       77.32
         24 |     21,053        0.18       77.50
         25 |    113,960        0.98       78.48
         26 |    356,922        3.06       81.54
         27 |    445,766        3.82       85.36
         28 |    360,299        3.09       88.45
         29 |    301,882        2.59       91.04
         30 |    232,455        1.99       93.03
         31 |     13,658        0.12       93.15
         32 |    798,813        6.85      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  2,849,116       24.43       24.43
          2 |  4,822,208       41.35       65.78
          3 |  3,990,309       34.22      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

     Number |
  people in |
  household |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  2,124,464       18.22       18.22
          2 |  2,831,576       24.28       42.50
          3 |  2,552,222       21.89       64.38
          4 |  2,244,092       19.24       83.63
          5 |  1,002,059        8.59       92.22
          6 |    466,098        4.00       96.22
          7 |    234,718        2.01       98.23
          8 |    129,838        1.11       99.34
          9 |     76,566        0.66      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Number |
 people in |          Index of Multiple Deprivation (IMD)
 household | 1 least d          2          3          4  5 most de |     Total
-----------+-------------------------------------------------------+----------
         1 |   323,748    409,026    454,328    489,206    448,156 | 2,124,464 
           |     14.70      17.58      19.23      19.90      19.39 |     18.22 
-----------+-------------------------------------------------------+----------
         2 |   564,647    607,536    593,818    572,461    493,114 | 2,831,576 
           |     25.64      26.11      25.13      23.29      21.33 |     24.28 
-----------+-------------------------------------------------------+----------
         3 |   538,508    536,779    514,606    506,721    455,608 | 2,552,222 
           |     24.45      23.07      21.78      20.62      19.71 |     21.89 
-----------+-------------------------------------------------------+----------
         4 |   512,304    469,704    437,745    431,391    392,948 | 2,244,092 
           |     23.26      20.19      18.52      17.55      17.00 |     19.24 
-----------+-------------------------------------------------------+----------
         5 |   168,169    177,428    193,201    223,590    239,671 | 1,002,059 
           |      7.64       7.63       8.18       9.10      10.37 |      8.59 
-----------+-------------------------------------------------------+----------
         6 |    56,006     70,483     87,385    114,963    137,261 |   466,098 
           |      2.54       3.03       3.70       4.68       5.94 |      4.00 
-----------+-------------------------------------------------------+----------
         7 |    22,175     31,188     43,578     62,048     75,729 |   234,718 
           |      1.01       1.34       1.84       2.52       3.28 |      2.01 
-----------+-------------------------------------------------------+----------
         8 |    10,894     15,855     24,207     35,462     43,420 |   129,838 
           |      0.49       0.68       1.02       1.44       1.88 |      1.11 
-----------+-------------------------------------------------------+----------
         9 |     5,629      8,808     14,342     22,050     25,737 |    76,566 
           |      0.26       0.38       0.61       0.90       1.11 |      0.66 
-----------+-------------------------------------------------------+----------
     Total | 2,202,080  2,326,807  2,363,210  2,457,892  2,311,644 |11,661,633 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(32) =  2.2e+05   Pr = 0.000
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,433,218       98.04       98.04
          1 |    228,415        1.96      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,640,246       82.67       82.67
          1 |  2,021,387       17.33      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,328,961       97.15       97.15
          1 |    332,672        2.85      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 10,915,953       95.10       95.10
  T1DM, controlled |     16,341        0.14       95.24
T1DM, uncontrolled |     49,049        0.43       95.67
  T2DM, controlled |    274,782        2.39       98.06
T2DM, uncontrolled |    216,880        1.89       99.95
Diabetes, no HbA1c |      5,341        0.05      100.00
-------------------+-----------------------------------
             Total | 11,478,346      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,405,980       97.81       97.81
    Last year |     28,417        0.24       98.05
2-5 years ago |     81,917        0.70       98.75
     5+ years |    145,319        1.25      100.00
--------------+-----------------------------------
        Total | 11,661,633      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,624,209       99.68       99.68
    Last year |      3,026        0.03       99.71
2-5 years ago |      9,418        0.08       99.79
     5+ years |     24,980        0.21      100.00
--------------+-----------------------------------
        Total | 11,661,633      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,622,999       99.67       99.67
          1 |     38,634        0.33      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,658,832       99.98       99.98
          1 |      2,801        0.02      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,647,894       99.88       99.88
          1 |     13,739        0.12      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,598,923       99.46       99.46
          1 |     62,710        0.54      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,580,141       99.30       99.30
          1 |     81,492        0.70      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,570,304       99.22       99.22
          1 |     91,329        0.78      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,967        0.06        0.06
         15 |      6,904        0.08        0.15
         30 |     16,690        0.20        0.35
         45 |    104,785        1.28        1.63
         60 |  8,028,069       98.37      100.00
------------+-----------------------------------
      Total |  8,161,415      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 11,528,287       98.86       98.86
Stage 3a/3b egfr 30-60       |    121,475        1.04       99.90
           Stage 4/5 egfr<30 |     11,871        0.10      100.00
-----------------------------+-----------------------------------
                       Total | 11,661,633      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,647,413       99.88       99.88
          1 |     14,220        0.12      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,326,524       88.55       88.55
          1 |  1,335,109       11.45      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,140,422       95.53       95.53
          1 |    521,211        4.47      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,200,449       78.90       78.90
          1 |  2,461,184       21.10      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

  Presence of |
  children or |
 young people |
       in the |
    household |      Freq.     Percent        Cum.
--------------+-----------------------------------
      No kids |  9,100,842       78.04       78.04
Kids under 12 |  1,654,504       14.19       92.23
Kids under 18 |    906,287        7.77      100.00
--------------+-----------------------------------
        Total | 11,661,633      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
           none |  9,100,842       78.04       78.04
 only >12 years |    906,287        7.77       85.81
    1 child <12 |  1,329,928       11.40       97.22
 2 children <12 |    286,117        2.45       99.67
3+ children <12 |     38,459        0.33      100.00
----------------+-----------------------------------
          Total | 11,661,633      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,658,927       99.98       99.98
          1 |      2,706        0.02      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,651,416       99.91       99.91
          1 |     10,217        0.09      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,628,183       99.71       99.71
          1 |     33,450        0.29      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,658,927       99.98       99.98
          1 |      2,706        0.02      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
     covid |     people in the household
 icu/death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 9,098,541  1,654,297    906,089 |11,658,927 
           |     78.04      14.19       7.77 |    100.00 
           |     99.97      99.99      99.98 |     99.98 
-----------+---------------------------------+----------
         1 |     2,301        207        198 |     2,706 
           |     85.03       7.65       7.32 |    100.00 
           |      0.03       0.01       0.02 |      0.02 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |     78.04      14.19       7.77 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
     covid |            Number kids under 12 years in hh
 icu/death |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 9,098,541    906,089  1,329,761    286,083     38,453 |11,658,927 
           |     78.04       7.77      11.41       2.45       0.33 |    100.00 
           |     99.97      99.98      99.99      99.99      99.98 |     99.98 
-----------+-------------------------------------------------------+----------
         1 |     2,301        198        167         34          6 |     2,706 
           |     85.03       7.32       6.17       1.26       0.22 |    100.00 
           |      0.03       0.02       0.01       0.01       0.02 |      0.02 
-----------+-------------------------------------------------------+----------
     Total | 9,100,842    906,287  1,329,928    286,117     38,459 |11,661,633 
           |     78.04       7.77      11.40       2.45       0.33 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,651,416       99.91       99.91
          1 |     10,217        0.09      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
 non-covid |     people in the household
     death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 9,091,483  1,654,060    905,873 |11,651,416 
           |     78.03      14.20       7.77 |    100.00 
           |     99.90      99.97      99.95 |     99.91 
-----------+---------------------------------+----------
         1 |     9,359        444        414 |    10,217 
           |     91.60       4.35       4.05 |    100.00 
           |      0.10       0.03       0.05 |      0.09 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |     78.04      14.19       7.77 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |            Number kids under 12 years in hh
     death |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 9,091,483    905,873  1,329,555    286,054     38,451 |11,651,416 
           |     78.03       7.77      11.41       2.46       0.33 |    100.00 
           |     99.90      99.95      99.97      99.98      99.98 |     99.91 
-----------+-------------------------------------------------------+----------
         1 |     9,359        414        373         63          8 |    10,217 
           |     91.60       4.05       3.65       0.62       0.08 |    100.00 
           |      0.10       0.05       0.03       0.02       0.02 |      0.09 
-----------+-------------------------------------------------------+----------
     Total | 9,100,842    906,287  1,329,928    286,117     38,459 |11,661,633 
           |     78.04       7.77      11.40       2.45       0.33 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,628,183       99.71       99.71
          1 |     33,450        0.29      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
covid prob |     people in the household
      case |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 9,075,803  1,649,320    903,060 |11,628,183 
           |     78.05      14.18       7.77 |    100.00 
           |     99.72      99.69      99.64 |     99.71 
-----------+---------------------------------+----------
         1 |    25,039      5,184      3,227 |    33,450 
           |     74.86      15.50       9.65 |    100.00 
           |      0.28       0.31       0.36 |      0.29 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |     78.04      14.19       7.77 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |            Number kids under 12 years in hh
      case |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 9,075,803    903,060  1,325,794    285,204     38,322 |11,628,183 
           |     78.05       7.77      11.40       2.45       0.33 |    100.00 
           |     99.72      99.64      99.69      99.68      99.64 |     99.71 
-----------+-------------------------------------------------------+----------
         1 |    25,039      3,227      4,134        913        137 |    33,450 
           |     74.86       9.65      12.36       2.73       0.41 |    100.00 
           |      0.28       0.36       0.31       0.32       0.36 |      0.29 
-----------+-------------------------------------------------------+----------
     Total | 9,100,842    906,287  1,329,928    286,117     38,459 |11,661,633 
           |     78.04       7.77      11.40       2.45       0.33 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
   Grouped |     people in the household
       age |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
    18-<30 | 2,133,300    292,099    164,803 | 2,590,202 
           |     23.44      17.65      18.18 |     22.21 
-----------+---------------------------------+----------
    30-<40 | 1,832,045    729,422    141,743 | 2,703,210 
           |     20.13      44.09      15.64 |     23.18 
-----------+---------------------------------+----------
    40-<50 | 1,605,835    487,113    365,993 | 2,458,941 
           |     17.64      29.44      40.38 |     21.09 
-----------+---------------------------------+----------
    50-<60 | 2,273,125    114,447    211,058 | 2,598,630 
           |     24.98       6.92      23.29 |     22.28 
-----------+---------------------------------+----------
    60-<70 | 1,256,537     31,423     22,690 | 1,310,650 
           |     13.81       1.90       2.50 |     11.24 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
      Male |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 4,453,897    939,779    498,257 | 5,891,933 
           |     48.94      56.80      54.98 |     50.52 
-----------+---------------------------------+----------
         1 | 4,646,945    714,725    408,030 | 5,769,700 
           |     51.06      43.20      45.02 |     49.48 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
                     |     people in the household
         Grouped BMI |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |   176,434     29,221     13,960 |   219,615 
                     |      1.94       1.77       1.54 |      1.88 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) | 2,640,705    506,505    236,563 | 3,383,773 
                     |     29.02      30.61      26.10 |     29.02 
---------------------+---------------------------------+----------
Overweight (25-29.9) | 2,306,132    448,084    236,706 | 2,990,922 
                     |     25.34      27.08      26.12 |     25.65 
---------------------+---------------------------------+----------
   Obese I (30-34.9) | 1,191,675    219,358    126,300 | 1,537,333 
                     |     13.09      13.26      13.94 |     13.18 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   491,360     89,076     52,621 |   633,057 
                     |      5.40       5.38       5.81 |      5.43 
---------------------+---------------------------------+----------
     Obese III (40+) |   268,902     46,618     28,477 |   343,997 
                     |      2.95       2.82       3.14 |      2.95 
---------------------+---------------------------------+----------
        Unknown (.u) | 2,025,634    315,642    211,660 | 2,552,936 
                     |     22.26      19.08      23.35 |     21.89 
---------------------+---------------------------------+----------
               Total | 9,100,842  1,654,504    906,287 |11,661,633 
                     |    100.00     100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |  Presence of children or young
     Smoking |     people in the household
      status |   No kids  Kids unde  Kids unde |     Total
-------------+---------------------------------+----------
       Never | 4,474,254    802,651    449,326 | 5,726,231 
             |     49.16      48.51      49.58 |     49.10 
-------------+---------------------------------+----------
      Former | 2,551,753    488,066    262,355 | 3,302,174 
             |     28.04      29.50      28.95 |     28.32 
-------------+---------------------------------+----------
     Current | 1,912,349    342,439    173,843 | 2,428,631 
             |     21.01      20.70      19.18 |     20.83 
-------------+---------------------------------+----------
Unknown (.u) |   162,486     21,348     20,763 |   204,597 
             |      1.79       1.29       2.29 |      1.75 
-------------+---------------------------------+----------
       Total | 9,100,842  1,654,504    906,287 |11,661,633 
             |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
 Evidence of obesity |     people in the household
      (4 categories) |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
No record of obesity | 7,148,905  1,299,452    698,889 | 9,147,246 
                     |     78.55      78.54      77.12 |     78.44 
---------------------+---------------------------------+----------
   Obese I (30-34.9) | 1,191,675    219,358    126,300 | 1,537,333 
                     |     13.09      13.26      13.94 |     13.18 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   491,360     89,076     52,621 |   633,057 
                     |      5.40       5.38       5.81 |      5.43 
---------------------+---------------------------------+----------
     Obese III (40+) |   268,902     46,618     28,477 |   343,997 
                     |      2.95       2.82       3.14 |      2.95 
---------------------+---------------------------------+----------
               Total | 9,100,842  1,654,504    906,287 |11,661,633 
                     |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
  Probable |     people in the household
 shielding |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,165,599  1,323,532    711,318 | 9,200,449 
           |     78.74      80.00      78.49 |     78.90 
-----------+---------------------------------+----------
         1 | 1,935,243    330,972    194,969 | 2,461,184 
           |     21.26      20.00      21.51 |     21.10 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Total |
    number |  Presence of children or young
 adults in |     people in the household
        hh |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 2,484,472    251,862    112,782 | 2,849,116 
           |     27.30      15.22      12.44 |     24.43 
-----------+---------------------------------+----------
         2 | 3,469,430    931,118    421,660 | 4,822,208 
           |     38.12      56.28      46.53 |     41.35 
-----------+---------------------------------+----------
         3 | 3,146,940    471,524    371,845 | 3,990,309 
           |     34.58      28.50      41.03 |     34.22 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Number |  Presence of children or young
 people in |     people in the household
 household |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 2,124,464          0          0 | 2,124,464 
           |     23.34       0.00       0.00 |     18.22 
-----------+---------------------------------+----------
         2 | 2,698,582     83,267     49,727 | 2,831,576 
           |     29.65       5.03       5.49 |     24.28 
-----------+---------------------------------+----------
         3 | 2,035,781    325,271    191,170 | 2,552,222 
           |     22.37      19.66      21.09 |     21.89 
-----------+---------------------------------+----------
         4 | 1,354,663    559,497    329,932 | 2,244,092 
           |     14.89      33.82      36.40 |     19.24 
-----------+---------------------------------+----------
         5 |   505,606    317,559    178,894 | 1,002,059 
           |      5.56      19.19      19.74 |      8.59 
-----------+---------------------------------+----------
         6 |   207,185    174,545     84,368 |   466,098 
           |      2.28      10.55       9.31 |      4.00 
-----------+---------------------------------+----------
         7 |    96,376     98,482     39,860 |   234,718 
           |      1.06       5.95       4.40 |      2.01 
-----------+---------------------------------+----------
         8 |    49,791     59,051     20,996 |   129,838 
           |      0.55       3.57       2.32 |      1.11 
-----------+---------------------------------+----------
         9 |    28,394     36,832     11,340 |    76,566 
           |      0.31       2.23       1.25 |      0.66 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |  Presence of children or young
     Deprivation |     people in the household
           (IMD) |   No kids  Kids unde  Kids unde |     Total
-----------------+---------------------------------+----------
1 least deprived | 1,719,001    297,955    185,124 | 2,202,080 
                 |     18.89      18.01      20.43 |     18.88 
-----------------+---------------------------------+----------
               2 | 1,853,924    299,894    172,989 | 2,326,807 
                 |     20.37      18.13      19.09 |     19.95 
-----------------+---------------------------------+----------
               3 | 1,881,029    312,125    170,056 | 2,363,210 
                 |     20.67      18.87      18.76 |     20.26 
-----------------+---------------------------------+----------
               4 | 1,922,306    352,271    183,315 | 2,457,892 
                 |     21.12      21.29      20.23 |     21.08 
-----------------+---------------------------------+----------
 5 most deprived | 1,724,582    392,259    194,803 | 2,311,644 
                 |     18.95      23.71      21.49 |     19.82 
-----------------+---------------------------------+----------
           Total | 9,100,842  1,654,504    906,287 |11,661,633 
                 |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
                      |     people in the household
            Ethnicity |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                White | 5,861,270  1,044,726    541,432 | 7,447,428 
                      |     64.40      63.14      59.74 |     63.86 
----------------------+---------------------------------+----------
                Mixed |   114,800     27,053     11,894 |   153,747 
                      |      1.26       1.64       1.31 |      1.32 
----------------------+---------------------------------+----------
Asian or Asian Britis |   532,512    189,996     89,246 |   811,754 
                      |      5.85      11.48       9.85 |      6.96 
----------------------+---------------------------------+----------
                Black |   208,417     60,299     29,506 |   298,222 
                      |      2.29       3.64       3.26 |      2.56 
----------------------+---------------------------------+----------
                Other |   215,174     46,164     18,643 |   279,981 
                      |      2.36       2.79       2.06 |      2.40 
----------------------+---------------------------------+----------
              Unknown | 2,168,669    286,266    215,566 | 2,670,501 
                      |     23.83      17.30      23.79 |     22.90 
----------------------+---------------------------------+----------
                Total | 9,100,842  1,654,504    906,287 |11,661,633 
                      |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |
      tion |  Presence of children or young
Partnershi |     people in the household
         p |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 |     2,230        628        285 |     3,143 
           |      0.02       0.04       0.03 |      0.03 
-----------+---------------------------------+----------
         2 |   840,729    177,998     93,703 | 1,112,430 
           |      9.24      10.76      10.34 |      9.54 
-----------+---------------------------------+----------
         3 |   399,201     70,168     39,230 |   508,599 
           |      4.39       4.24       4.33 |      4.36 
-----------+---------------------------------+----------
         4 |    90,812     15,895     10,350 |   117,057 
           |      1.00       0.96       1.14 |      1.00 
-----------+---------------------------------+----------
         5 |    64,465     11,244      6,150 |    81,859 
           |      0.71       0.68       0.68 |      0.70 
-----------+---------------------------------+----------
         6 |   429,098     77,423     41,431 |   547,952 
           |      4.71       4.68       4.57 |      4.70 
-----------+---------------------------------+----------
         7 |    25,479      4,350      2,133 |    31,962 
           |      0.28       0.26       0.24 |      0.27 
-----------+---------------------------------+----------
         8 |   334,957     59,828     32,311 |   427,096 
           |      3.68       3.62       3.57 |      3.66 
-----------+---------------------------------+----------
         9 |   261,847     42,486     25,859 |   330,192 
           |      2.88       2.57       2.85 |      2.83 
-----------+---------------------------------+----------
        10 |   361,333     68,952     35,017 |   465,302 
           |      3.97       4.17       3.86 |      3.99 
-----------+---------------------------------+----------
        11 |   399,634     78,983     44,762 |   523,379 
           |      4.39       4.77       4.94 |      4.49 
-----------+---------------------------------+----------
        12 |   131,760     28,881     15,115 |   175,756 
           |      1.45       1.75       1.67 |      1.51 
-----------+---------------------------------+----------
        13 |   196,290     42,715     22,799 |   261,804 
           |      2.16       2.58       2.52 |      2.25 
-----------+---------------------------------+----------
        14 |   242,114     53,286     28,700 |   324,100 
           |      2.66       3.22       3.17 |      2.78 
-----------+---------------------------------+----------
        15 |   317,090     66,151     33,861 |   417,102 
           |      3.48       4.00       3.74 |      3.58 
-----------+---------------------------------+----------
        16 |   321,606     58,184     32,235 |   412,025 
           |      3.53       3.52       3.56 |      3.53 
-----------+---------------------------------+----------
        17 |   278,258     50,764     28,470 |   357,492 
           |      3.06       3.07       3.14 |      3.07 
-----------+---------------------------------+----------
        18 |   380,428     89,984     45,386 |   515,798 
           |      4.18       5.44       5.01 |      4.42 
-----------+---------------------------------+----------
        19 |   309,870     59,708     32,271 |   401,849 
           |      3.40       3.61       3.56 |      3.45 
-----------+---------------------------------+----------
        20 |   440,219     86,438     50,354 |   577,011 
           |      4.84       5.22       5.56 |      4.95 
-----------+---------------------------------+----------
        21 |   758,615    107,241     53,840 |   919,696 
           |      8.34       6.48       5.94 |      7.89 
-----------+---------------------------------+----------
        22 |    44,515     11,163      5,211 |    60,889 
           |      0.49       0.67       0.57 |      0.52 
-----------+---------------------------------+----------
        23 |   353,656     57,705     32,971 |   444,332 
           |      3.89       3.49       3.64 |      3.81 
-----------+---------------------------------+----------
        24 |    17,195      2,420      1,438 |    21,053 
           |      0.19       0.15       0.16 |      0.18 
-----------+---------------------------------+----------
        25 |    92,989     13,310      7,661 |   113,960 
           |      1.02       0.80       0.85 |      0.98 
-----------+---------------------------------+----------
        26 |   286,461     44,314     26,147 |   356,922 
           |      3.15       2.68       2.89 |      3.06 
-----------+---------------------------------+----------
        27 |   352,009     59,576     34,181 |   445,766 
           |      3.87       3.60       3.77 |      3.82 
-----------+---------------------------------+----------
        28 |   291,411     43,482     25,406 |   360,299 
           |      3.20       2.63       2.80 |      3.09 
-----------+---------------------------------+----------
        29 |   246,037     35,944     19,901 |   301,882 
           |      2.70       2.17       2.20 |      2.59 
-----------+---------------------------------+----------
        30 |   185,359     29,754     17,342 |   232,455 
           |      2.04       1.80       1.91 |      1.99 
-----------+---------------------------------+----------
        31 |    11,026      1,658        974 |    13,658 
           |      0.12       0.10       0.11 |      0.12 
-----------+---------------------------------+----------
        32 |   634,149    103,871     60,793 |   798,813 
           |      6.97       6.28       6.71 |      6.85 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
Respirator |     people in the household
y Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 8,898,553  1,640,810    893,855 |11,433,218 
           |     97.78      99.17      98.63 |     98.04 
-----------+---------------------------------+----------
         1 |   202,289     13,694     12,432 |   228,415 
           |      2.22       0.83       1.37 |      1.96 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
    Asthma |     people in the household
  category |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,548,141  1,354,399    737,706 | 9,640,246 
           |     82.94      81.86      81.40 |     82.67 
-----------+---------------------------------+----------
         1 | 1,552,701    300,105    168,581 | 2,021,387 
           |     17.06      18.14      18.60 |     17.33 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
   Cardiac |     people in the household
  Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 8,810,924  1,631,600    886,437 |11,328,961 
           |     96.81      98.62      97.81 |     97.15 
-----------+---------------------------------+----------
         1 |   289,918     22,904     19,850 |   332,672 
           |      3.19       1.38       2.19 |      2.85 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |  Presence of children or young
                   |     people in the household
          Diabetes |   No kids  Kids unde  Kids unde |     Total
-------------------+---------------------------------+----------
       No diabetes | 8,486,025  1,579,480    850,448 |10,915,953 
                   |     94.74      96.90      95.43 |     95.10 
-------------------+---------------------------------+----------
  T1DM, controlled |    13,306      2,004      1,031 |    16,341 
                   |      0.15       0.12       0.12 |      0.14 
-------------------+---------------------------------+----------
T1DM, uncontrolled |    40,060      5,503      3,486 |    49,049 
                   |      0.45       0.34       0.39 |      0.43 
-------------------+---------------------------------+----------
  T2DM, controlled |   232,138     23,353     19,291 |   274,782 
                   |      2.59       1.43       2.16 |      2.39 
-------------------+---------------------------------+----------
T2DM, uncontrolled |   181,399     19,009     16,472 |   216,880 
                   |      2.03       1.17       1.85 |      1.89 
-------------------+---------------------------------+----------
Diabetes, no HbA1c |     4,226        714        401 |     5,341 
                   |      0.05       0.04       0.04 |      0.05 
-------------------+---------------------------------+----------
             Total | 8,957,154  1,630,063    891,129 |11,478,346 
                   |    100.00     100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Non-haematolo |     people in the household
 gical cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 8,878,829  1,637,279    889,872 |11,405,980 
              |     97.56      98.96      98.19 |     97.81 
--------------+---------------------------------+----------
    Last year |    24,320      2,174      1,923 |    28,417 
              |      0.27       0.13       0.21 |      0.24 
--------------+---------------------------------+----------
2-5 years ago |    70,286      6,020      5,611 |    81,917 
              |      0.77       0.36       0.62 |      0.70 
--------------+---------------------------------+----------
     5+ years |   127,407      9,031      8,881 |   145,319 
              |      1.40       0.55       0.98 |      1.25 
--------------+---------------------------------+----------
        Total | 9,100,842  1,654,504    906,287 |11,661,633 
              |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Haematologica |     people in the household
     l cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 9,069,262  1,651,124    903,823 |11,624,209 
              |     99.65      99.80      99.73 |     99.68 
--------------+---------------------------------+----------
    Last year |     2,566        265        195 |     3,026 
              |      0.03       0.02       0.02 |      0.03 
--------------+---------------------------------+----------
2-5 years ago |     8,059        774        585 |     9,418 
              |      0.09       0.05       0.06 |      0.08 
--------------+---------------------------------+----------
     5+ years |    20,955      2,341      1,684 |    24,980 
              |      0.23       0.14       0.19 |      0.21 
--------------+---------------------------------+----------
        Total | 9,100,842  1,654,504    906,287 |11,661,633 
              |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |  Presence of children or young
        on |     people in the household
algorithm) |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 9,069,260  1,650,157    903,582 |11,622,999 
           |     99.65      99.74      99.70 |     99.67 
-----------+---------------------------------+----------
         1 |    31,582      4,347      2,705 |    38,634 
           |      0.35       0.26       0.30 |      0.33 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |  Presence of children or young
     organ |     people in the household
transplant |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 9,098,428  1,654,305    906,099 |11,658,832 
           |     99.97      99.99      99.98 |     99.98 
-----------+---------------------------------+----------
         1 |     2,414        199        188 |     2,801 
           |      0.03       0.01       0.02 |      0.02 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
  Asplenia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 9,089,306  1,653,213    905,375 |11,647,894 
           |     99.87      99.92      99.90 |     99.88 
-----------+---------------------------------+----------
         1 |    11,536      1,291        912 |    13,739 
           |      0.13       0.08       0.10 |      0.12 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
     liver |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 9,047,027  1,649,097    902,799 |11,598,923 
           |     99.41      99.67      99.62 |     99.46 
-----------+---------------------------------+----------
         1 |    53,815      5,407      3,488 |    62,710 
           |      0.59       0.33       0.38 |      0.54 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Neurologic |     people in the household
al disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 9,030,746  1,648,153    901,242 |11,580,141 
           |     99.23      99.62      99.44 |     99.30 
-----------+---------------------------------+----------
         1 |    70,096      6,351      5,045 |    81,492 
           |      0.77       0.38       0.56 |      0.70 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
 Stroke or |     people in the household
  dementia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 9,020,101  1,648,784    901,419 |11,570,304 
           |     99.11      99.65      99.46 |     99.22 
-----------+---------------------------------+----------
         1 |    80,741      5,720      4,868 |    91,329 
           |      0.89       0.35       0.54 |      0.78 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Calculated |     people in the household
      eGFR |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 |     4,304        364        299 |     4,967 
           |      0.07       0.03       0.04 |      0.06 
-----------+---------------------------------+----------
        15 |     6,020        471        413 |     6,904 
           |      0.09       0.04       0.06 |      0.08 
-----------+---------------------------------+----------
        30 |    14,955        963        772 |    16,690 
           |      0.24       0.08       0.12 |      0.20 
-----------+---------------------------------+----------
        45 |    94,728      5,005      5,052 |   104,785 
           |      1.49       0.44       0.76 |      1.28 
-----------+---------------------------------+----------
        60 | 6,239,885  1,127,269    660,915 | 8,028,069 
           |     98.11      99.40      99.02 |     98.37 
-----------+---------------------------------+----------
     Total | 6,359,892  1,134,072    667,451 | 8,161,415 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
       Reduced kidney |     people in the household
             function |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                 None | 8,980,835  1,647,701    899,751 |11,528,287 
                      |     98.68      99.59      99.28 |     98.86 
----------------------+---------------------------------+----------
Stage 3a/3b egfr 30-6 |   109,683      5,968      5,824 |   121,475 
                      |      1.21       0.36       0.64 |      1.04 
----------------------+---------------------------------+----------
    Stage 4/5 egfr<30 |    10,324        835        712 |    11,871 
                      |      0.11       0.05       0.08 |      0.10 
----------------------+---------------------------------+----------
                Total | 9,100,842  1,654,504    906,287 |11,661,633 
                      |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |  Presence of children or young
     renal |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 9,088,680  1,653,274    905,459 |11,647,413 
           |     99.87      99.93      99.91 |     99.88 
-----------+---------------------------------+----------
         1 |    12,162      1,230        828 |    14,220 
           |      0.13       0.07       0.09 |      0.12 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |  Presence of children or young
hypertensi |     people in the household
        on |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,951,299  1,558,203    817,022 |10,326,524 
           |     87.37      94.18      90.15 |     88.55 
-----------+---------------------------------+----------
         1 | 1,149,543     96,301     89,265 | 1,335,109 
           |     12.63       5.82       9.85 |     11.45 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Autoimmune |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 8,690,024  1,586,444    863,954 |11,140,422 
           |     95.49      95.89      95.33 |     95.53 
-----------+---------------------------------+----------
         1 |   410,818     68,060     42,333 |   521,211 
           |      4.51       4.11       4.67 |      4.47 
-----------+---------------------------------+----------
     Total | 9,100,842  1,654,504    906,287 |11,661,633 
           |    100.00     100.00     100.00 |    100.00 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  3,473,837    75.53805    7.082125         66        110
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |    793,282       22.84       22.84
     70-<80 |  1,722,685       49.59       72.43
        80+ |    957,870       27.57      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    204,147        5.88        5.88
          1 |  3,269,690       94.12      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,864,886       53.68       53.68
          1 |  1,608,951       46.32      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     59,224        1.87        1.87
  Normal (18.5-24.9) |    989,051       31.16       33.03
Overweight (25-29.9) |  1,238,077       39.01       72.03
   Obese I (30-34.9) |    609,304       19.20       91.23
  Obese II (35-39.9) |    200,506        6.32       97.55
     Obese III (40+) |     77,911        2.45      100.00
---------------------+-----------------------------------
               Total |  3,174,073      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     59,224        1.70        1.70
  Normal (18.5-24.9) |    989,051       28.47       30.18
Overweight (25-29.9) |  1,238,077       35.64       65.82
   Obese I (30-34.9) |    609,304       17.54       83.36
  Obese II (35-39.9) |    200,506        5.77       89.13
     Obese III (40+) |     77,911        2.24       91.37
        Unknown (.u) |    299,764        8.63      100.00
---------------------+-----------------------------------
               Total |  3,473,837      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  2,586,116       74.45       74.45
   Obese I (30-34.9) |    609,304       17.54       91.99
  Obese II (35-39.9) |    200,506        5.77       97.76
     Obese III (40+) |     77,911        2.24      100.00
---------------------+-----------------------------------
               Total |  3,473,837      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,390,831       40.12       40.12
      Former |  1,787,539       51.57       91.69
     Current |    288,122        8.31      100.00
-------------+-----------------------------------
       Total |  3,466,492      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,390,831       40.04       40.04
      Former |  1,787,539       51.46       91.49
     Current |    288,122        8.29       99.79
Unknown (.u) |      7,345        0.21      100.00
-------------+-----------------------------------
       Total |  3,473,837      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    392,830       11.37       11.37
      Elevated |    531,908       15.40       26.78
 High, stage I |  1,268,852       36.74       63.52
High, stage II |  1,259,944       36.48      100.00
---------------+-----------------------------------
         Total |  3,453,534      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    392,830       11.31       11.31
      Elevated |    531,908       15.31       26.62
 High, stage I |  1,268,852       36.53       63.15
High, stage II |  1,259,944       36.27       99.42
       Unknown |     20,303        0.58      100.00
---------------+-----------------------------------
         Total |  3,473,837      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,044,472       30.07       30.07
          1 |  2,429,365       69.93      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,044,472       30.07       30.07
          1 |  2,429,365       69.93      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    858,077       24.70       24.70
               2 |    822,138       23.67       48.37
               3 |    739,038       21.27       69.64
               4 |    607,001       17.47       87.12
 5 most deprived |    447,583       12.88      100.00
-----------------+-----------------------------------
           Total |  3,473,837      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    858,077       24.70       24.70
               2 |    822,138       23.67       48.37
               3 |    739,038       21.27       69.64
               4 |    607,001       17.47       87.12
 5 most deprived |    447,583       12.88      100.00
-----------------+-----------------------------------
           Total |  3,473,837      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,413,995       94.23       94.23
                 Mixed |      9,741        0.38       94.61
Asian or Asian British |     89,804        3.51       98.11
                 Black |     27,178        1.06       99.17
                 Other |     21,139        0.83      100.00
-----------------------+-----------------------------------
                 Total |  2,561,857      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,413,995       69.49       69.49
                 Mixed |      9,741        0.28       69.77
Asian or Asian British |     89,804        2.59       72.36
                 Black |     27,178        0.78       73.14
                 Other |     21,139        0.61       73.75
               Unknown |    911,980       26.25      100.00
-----------------------+-----------------------------------
                 Total |  3,473,837      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        324        0.01        0.01
          2 |    287,115        8.27        8.27
          3 |    155,650        4.48       12.76
          4 |     34,151        0.98       13.74
          5 |     23,652        0.68       14.42
          6 |    161,723        4.66       19.07
          7 |      9,242        0.27       19.34
          8 |    136,488        3.93       23.27
          9 |    128,668        3.70       26.97
         10 |    141,494        4.07       31.05
         11 |    142,247        4.09       35.14
         12 |     38,582        1.11       36.25
         13 |     68,228        1.96       38.22
         14 |     84,619        2.44       40.65
         15 |    111,444        3.21       43.86
         16 |    165,283        4.76       48.62
         17 |    123,044        3.54       52.16
         18 |    124,743        3.59       55.75
         19 |    109,514        3.15       58.90
         20 |    179,602        5.17       64.07
         21 |    133,243        3.84       67.91
         22 |      9,399        0.27       68.18
         23 |    152,044        4.38       72.56
         24 |      8,096        0.23       72.79
         25 |     45,519        1.31       74.10
         26 |    151,616        4.36       78.46
         27 |    146,656        4.22       82.69
         28 |    150,055        4.32       87.01
         29 |     97,424        2.80       89.81
         30 |     80,905        2.33       92.14
         31 |      4,884        0.14       92.28
         32 |    268,183        7.72      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  1,207,578       34.76       34.76
          2 |  1,784,381       51.37       86.13
          3 |    481,878       13.87      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

     Number |
  people in |
  household |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  1,190,016       34.26       34.26
          2 |  1,759,009       50.64       84.89
          3 |    320,355        9.22       94.11
          4 |    101,200        2.91       97.03
          5 |     48,270        1.39       98.42
          6 |     28,265        0.81       99.23
          7 |     14,541        0.42       99.65
          8 |      7,894        0.23       99.88
          9 |      4,287        0.12      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Number |
 people in |          Index of Multiple Deprivation (IMD)
 household | 1 least d          2          3          4  5 most de |     Total
-----------+-------------------------------------------------------+----------
         1 |   254,503    265,064    253,578    228,302    188,569 | 1,190,016 
           |     29.66      32.24      34.31      37.61      42.13 |     34.26 
-----------+-------------------------------------------------------+----------
         2 |   489,096    440,605    374,488    277,164    177,656 | 1,759,009 
           |     57.00      53.59      50.67      45.66      39.69 |     50.64 
-----------+-------------------------------------------------------+----------
         3 |    75,803     74,774     67,435     58,112     44,231 |   320,355 
           |      8.83       9.10       9.12       9.57       9.88 |      9.22 
-----------+-------------------------------------------------------+----------
         4 |    20,946     21,778     21,735     20,164     16,577 |   101,200 
           |      2.44       2.65       2.94       3.32       3.70 |      2.91 
-----------+-------------------------------------------------------+----------
         5 |     9,308      9,962     10,376     10,225      8,399 |    48,270 
           |      1.08       1.21       1.40       1.68       1.88 |      1.39 
-----------+-------------------------------------------------------+----------
         6 |     4,989      5,521      6,022      6,367      5,366 |    28,265 
           |      0.58       0.67       0.81       1.05       1.20 |      0.81 
-----------+-------------------------------------------------------+----------
         7 |     2,096      2,559      2,941      3,530      3,415 |    14,541 
           |      0.24       0.31       0.40       0.58       0.76 |      0.42 
-----------+-------------------------------------------------------+----------
         8 |       925      1,225      1,597      2,020      2,127 |     7,894 
           |      0.11       0.15       0.22       0.33       0.48 |      0.23 
-----------+-------------------------------------------------------+----------
         9 |       411        650        866      1,117      1,243 |     4,287 
           |      0.05       0.08       0.12       0.18       0.28 |      0.12 
-----------+-------------------------------------------------------+----------
     Total |   858,077    822,138    739,038    607,001    447,583 | 3,473,837 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(32) =  5.1e+04   Pr = 0.000
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,061,341       88.13       88.13
          1 |    412,496       11.87      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,021,683       86.98       86.98
          1 |    452,154       13.02      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,747,401       79.09       79.09
          1 |    726,436       20.91      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |  2,692,629       81.26       81.26
  T1DM, controlled |      4,554        0.14       81.39
T1DM, uncontrolled |      9,400        0.28       81.68
  T2DM, controlled |    416,402       12.57       94.24
T2DM, uncontrolled |    188,292        5.68       99.93
Diabetes, no HbA1c |      2,455        0.07      100.00
-------------------+-----------------------------------
             Total |  3,313,732      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  2,975,988       85.67       85.67
    Last year |     41,712        1.20       86.87
2-5 years ago |    123,930        3.57       90.44
     5+ years |    332,207        9.56      100.00
--------------+-----------------------------------
        Total |  3,473,837      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  3,422,524       98.52       98.52
    Last year |      4,947        0.14       98.67
2-5 years ago |     15,321        0.44       99.11
     5+ years |     31,045        0.89      100.00
--------------+-----------------------------------
        Total |  3,473,837      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,467,039       99.80       99.80
          1 |      6,798        0.20      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,472,709       99.97       99.97
          1 |      1,128        0.03      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,465,267       99.75       99.75
          1 |      8,570        0.25      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,441,813       99.08       99.08
          1 |     32,024        0.92      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,405,591       98.04       98.04
          1 |     68,246        1.96      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,216,703       92.60       92.60
          1 |    257,134        7.40      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,084        0.25        0.25
         15 |     47,200        1.43        1.68
         30 |    202,836        6.16        7.84
         45 |    550,902       16.72       24.56
         60 |  2,484,864       75.44      100.00
------------+-----------------------------------
      Total |  3,293,886      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |  2,664,815       76.71       76.71
Stage 3a/3b egfr 30-60       |    753,738       21.70       98.41
           Stage 4/5 egfr<30 |     55,284        1.59      100.00
-----------------------------+-----------------------------------
                       Total |  3,473,837      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,465,239       99.75       99.75
          1 |      8,598        0.25      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,535,426       44.20       44.20
          1 |  1,938,411       55.80      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,208,727       92.37       92.37
          1 |    265,110        7.63      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,274,124       65.46       65.46
          1 |  1,199,713       34.54      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

  Presence of |
  children or |
 young people |
       in the |
    household |      Freq.     Percent        Cum.
--------------+-----------------------------------
      No kids |  3,409,439       98.15       98.15
Kids under 12 |     37,194        1.07       99.22
Kids under 18 |     27,204        0.78      100.00
--------------+-----------------------------------
        Total |  3,473,837      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
           none |  3,409,439       98.15       98.15
 only >12 years |     27,204        0.78       98.93
    1 child <12 |     31,078        0.89       99.82
 2 children <12 |      5,448        0.16       99.98
3+ children <12 |        668        0.02      100.00
----------------+-----------------------------------
          Total |  3,473,837      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,464,932       99.74       99.74
          1 |      8,905        0.26      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,420,803       98.47       98.47
          1 |     53,034        1.53      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,458,254       99.55       99.55
          1 |     15,583        0.45      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,464,932       99.74       99.74
          1 |      8,905        0.26      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
     covid |     people in the household
 icu/death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,400,695     37,101     27,136 | 3,464,932 
           |     98.15       1.07       0.78 |    100.00 
           |     99.74      99.75      99.75 |     99.74 
-----------+---------------------------------+----------
         1 |     8,744         93         68 |     8,905 
           |     98.19       1.04       0.76 |    100.00 
           |      0.26       0.25       0.25 |      0.26 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |     98.15       1.07       0.78 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
31

**TABLE OF covid_death_icu gp_number_kids REDACTED DUE TO SMALL N**

0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,420,803       98.47       98.47
          1 |     53,034        1.53      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
 non-covid |     people in the household
     death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,357,116     36,817     26,870 | 3,420,803 
           |     98.14       1.08       0.79 |    100.00 
           |     98.47      98.99      98.77 |     98.47 
-----------+---------------------------------+----------
         1 |    52,323        377        334 |    53,034 
           |     98.66       0.71       0.63 |    100.00 
           |      1.53       1.01       1.23 |      1.53 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |     98.15       1.07       0.78 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |            Number kids under 12 years in hh
     death |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 3,357,116     26,870     30,762      5,394        661 | 3,420,803 
           |     98.14       0.79       0.90       0.16       0.02 |    100.00 
           |     98.47      98.77      98.98      99.01      98.95 |     98.47 
-----------+-------------------------------------------------------+----------
         1 |    52,323        334        316         54          7 |    53,034 
           |     98.66       0.63       0.60       0.10       0.01 |    100.00 
           |      1.53       1.23       1.02       0.99       1.05 |      1.53 
-----------+-------------------------------------------------------+----------
     Total | 3,409,439     27,204     31,078      5,448        668 | 3,473,837 
           |     98.15       0.78       0.89       0.16       0.02 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,458,254       99.55       99.55
          1 |     15,583        0.45      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
covid prob |     people in the household
      case |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,394,200     36,987     27,067 | 3,458,254 
           |     98.15       1.07       0.78 |    100.00 
           |     99.55      99.44      99.50 |     99.55 
-----------+---------------------------------+----------
         1 |    15,239        207        137 |    15,583 
           |     97.79       1.33       0.88 |    100.00 
           |      0.45       0.56       0.50 |      0.45 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |     98.15       1.07       0.78 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |            Number kids under 12 years in hh
      case |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 3,394,200     27,067     30,921      5,407        659 | 3,458,254 
           |     98.15       0.78       0.89       0.16       0.02 |    100.00 
           |     99.55      99.50      99.49      99.25      98.65 |     99.55 
-----------+-------------------------------------------------------+----------
         1 |    15,239        137        157         41          9 |    15,583 
           |     97.79       0.88       1.01       0.26       0.06 |    100.00 
           |      0.45       0.50       0.51       0.75       1.35 |      0.45 
-----------+-------------------------------------------------------+----------
     Total | 3,409,439     27,204     31,078      5,448        668 | 3,473,837 
           |     98.15       0.78       0.89       0.16       0.02 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
   Grouped |     people in the household
       age |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
    60-<70 |   770,168     14,443      8,671 |   793,282 
           |     22.59      38.83      31.87 |     22.84 
-----------+---------------------------------+----------
    70-<80 | 1,691,593     17,606     13,486 | 1,722,685 
           |     49.61      47.34      49.57 |     49.59 
-----------+---------------------------------+----------
       80+ |   947,678      5,145      5,047 |   957,870 
           |     27.80      13.83      18.55 |     27.57 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
      Male |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 1,830,620     19,870     14,396 | 1,864,886 
           |     53.69      53.42      52.92 |     53.68 
-----------+---------------------------------+----------
         1 | 1,578,819     17,324     12,808 | 1,608,951 
           |     46.31      46.58      47.08 |     46.32 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
                     |     people in the household
         Grouped BMI |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |    58,344        484        396 |    59,224 
                     |      1.71       1.30       1.46 |      1.70 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |   973,522      9,158      6,371 |   989,051 
                     |     28.55      24.62      23.42 |     28.47 
---------------------+---------------------------------+----------
Overweight (25-29.9) | 1,216,048     12,615      9,414 | 1,238,077 
                     |     35.67      33.92      34.61 |     35.64 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   596,853      7,205      5,246 |   609,304 
                     |     17.51      19.37      19.28 |     17.54 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   196,073      2,470      1,963 |   200,506 
                     |      5.75       6.64       7.22 |      5.77 
---------------------+---------------------------------+----------
     Obese III (40+) |    76,025      1,050        836 |    77,911 
                     |      2.23       2.82       3.07 |      2.24 
---------------------+---------------------------------+----------
        Unknown (.u) |   292,574      4,212      2,978 |   299,764 
                     |      8.58      11.32      10.95 |      8.63 
---------------------+---------------------------------+----------
               Total | 3,409,439     37,194     27,204 | 3,473,837 
                     |    100.00     100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |  Presence of children or young
     Smoking |     people in the household
      status |   No kids  Kids unde  Kids unde |     Total
-------------+---------------------------------+----------
       Never | 1,359,659     18,553     12,619 | 1,390,831 
             |     39.88      49.88      46.39 |     40.04 
-------------+---------------------------------+----------
      Former | 1,761,612     14,385     11,542 | 1,787,539 
             |     51.67      38.68      42.43 |     51.46 
-------------+---------------------------------+----------
     Current |   281,397      3,869      2,856 |   288,122 
             |      8.25      10.40      10.50 |      8.29 
-------------+---------------------------------+----------
Unknown (.u) |     6,771        387        187 |     7,345 
             |      0.20       1.04       0.69 |      0.21 
-------------+---------------------------------+----------
       Total | 3,409,439     37,194     27,204 | 3,473,837 
             |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
 Evidence of obesity |     people in the household
      (4 categories) |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
No record of obesity | 2,540,488     26,469     19,159 | 2,586,116 
                     |     74.51      71.16      70.43 |     74.45 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   596,853      7,205      5,246 |   609,304 
                     |     17.51      19.37      19.28 |     17.54 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   196,073      2,470      1,963 |   200,506 
                     |      5.75       6.64       7.22 |      5.77 
---------------------+---------------------------------+----------
     Obese III (40+) |    76,025      1,050        836 |    77,911 
                     |      2.23       2.82       3.07 |      2.24 
---------------------+---------------------------------+----------
               Total | 3,409,439     37,194     27,204 | 3,473,837 
                     |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
  Probable |     people in the household
 shielding |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 2,229,599     26,081     18,444 | 2,274,124 
           |     65.39      70.12      67.80 |     65.46 
-----------+---------------------------------+----------
         1 | 1,179,840     11,113      8,760 | 1,199,713 
           |     34.61      29.88      32.20 |     34.54 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Total |
    number |  Presence of children or young
 adults in |     people in the household
        hh |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 1,205,164      1,041      1,373 | 1,207,578 
           |     35.35       2.80       5.05 |     34.76 
-----------+---------------------------------+----------
         2 | 1,771,766      6,022      6,593 | 1,784,381 
           |     51.97      16.19      24.24 |     51.37 
-----------+---------------------------------+----------
         3 |   432,509     30,131     19,238 |   481,878 
           |     12.69      81.01      70.72 |     13.87 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Number |  Presence of children or young
 people in |     people in the household
 household |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 1,190,016          0          0 | 1,190,016 
           |     34.90       0.00       0.00 |     34.26 
-----------+---------------------------------+----------
         2 | 1,757,473        589        947 | 1,759,009 
           |     51.55       1.58       3.48 |     50.64 
-----------+---------------------------------+----------
         3 |   313,022      2,934      4,399 |   320,355 
           |      9.18       7.89      16.17 |      9.22 
-----------+---------------------------------+----------
         4 |    88,313      6,534      6,353 |   101,200 
           |      2.59      17.57      23.35 |      2.91 
-----------+---------------------------------+----------
         5 |    33,052      8,990      6,228 |    48,270 
           |      0.97      24.17      22.89 |      1.39 
-----------+---------------------------------+----------
         6 |    15,308      8,235      4,722 |    28,265 
           |      0.45      22.14      17.36 |      0.81 
-----------+---------------------------------+----------
         7 |     6,845      5,162      2,534 |    14,541 
           |      0.20      13.88       9.31 |      0.42 
-----------+---------------------------------+----------
         8 |     3,544      2,987      1,363 |     7,894 
           |      0.10       8.03       5.01 |      0.23 
-----------+---------------------------------+----------
         9 |     1,866      1,763        658 |     4,287 
           |      0.05       4.74       2.42 |      0.12 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |  Presence of children or young
     Deprivation |     people in the household
           (IMD) |   No kids  Kids unde  Kids unde |     Total
-----------------+---------------------------------+----------
1 least deprived |   846,495      6,403      5,179 |   858,077 
                 |     24.83      17.22      19.04 |     24.70 
-----------------+---------------------------------+----------
               2 |   810,090      6,892      5,156 |   822,138 
                 |     23.76      18.53      18.95 |     23.67 
-----------------+---------------------------------+----------
               3 |   726,051      7,420      5,567 |   739,038 
                 |     21.30      19.95      20.46 |     21.27 
-----------------+---------------------------------+----------
               4 |   592,882      8,250      5,869 |   607,001 
                 |     17.39      22.18      21.57 |     17.47 
-----------------+---------------------------------+----------
 5 most deprived |   433,921      8,229      5,433 |   447,583 
                 |     12.73      22.12      19.97 |     12.88 
-----------------+---------------------------------+----------
           Total | 3,409,439     37,194     27,204 | 3,473,837 
                 |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
                      |     people in the household
            Ethnicity |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                White | 2,381,339     17,934     14,722 | 2,413,995 
                      |     69.85      48.22      54.12 |     69.49 
----------------------+---------------------------------+----------
                Mixed |     9,032        418        291 |     9,741 
                      |      0.26       1.12       1.07 |      0.28 
----------------------+---------------------------------+----------
Asian or Asian Britis |    75,648      9,193      4,963 |    89,804 
                      |      2.22      24.72      18.24 |      2.59 
----------------------+---------------------------------+----------
                Black |    24,951      1,326        901 |    27,178 
                      |      0.73       3.57       3.31 |      0.78 
----------------------+---------------------------------+----------
                Other |    19,417      1,123        599 |    21,139 
                      |      0.57       3.02       2.20 |      0.61 
----------------------+---------------------------------+----------
              Unknown |   899,052      7,200      5,728 |   911,980 
                      |     26.37      19.36      21.06 |     26.25 
----------------------+---------------------------------+----------
                Total | 3,409,439     37,194     27,204 | 3,473,837 
                      |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |
      tion |  Presence of children or young
Partnershi |     people in the household
         p |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 |       308          8          8 |       324 
           |      0.01       0.02       0.03 |      0.01 
-----------+---------------------------------+----------
         2 |   280,184      4,234      2,697 |   287,115 
           |      8.22      11.38       9.91 |      8.27 
-----------+---------------------------------+----------
         3 |   153,778        981        891 |   155,650 
           |      4.51       2.64       3.28 |      4.48 
-----------+---------------------------------+----------
         4 |    33,585        282        284 |    34,151 
           |      0.99       0.76       1.04 |      0.98 
-----------+---------------------------------+----------
         5 |    23,334        192        126 |    23,652 
           |      0.68       0.52       0.46 |      0.68 
-----------+---------------------------------+----------
         6 |   159,461      1,236      1,026 |   161,723 
           |      4.68       3.32       3.77 |      4.66 
-----------+---------------------------------+----------
         7 |     9,147         51         44 |     9,242 
           |      0.27       0.14       0.16 |      0.27 
-----------+---------------------------------+----------
         8 |   134,663      1,006        819 |   136,488 
           |      3.95       2.70       3.01 |      3.93 
-----------+---------------------------------+----------
         9 |   127,016        826        826 |   128,668 
           |      3.73       2.22       3.04 |      3.70 
-----------+---------------------------------+----------
        10 |   139,491      1,124        879 |   141,494 
           |      4.09       3.02       3.23 |      4.07 
-----------+---------------------------------+----------
        11 |   138,369      2,286      1,592 |   142,247 
           |      4.06       6.15       5.85 |      4.09 
-----------+---------------------------------+----------
        12 |    37,013        956        613 |    38,582 
           |      1.09       2.57       2.25 |      1.11 
-----------+---------------------------------+----------
        13 |    66,240      1,213        775 |    68,228 
           |      1.94       3.26       2.85 |      1.96 
-----------+---------------------------------+----------
        14 |    82,811      1,023        785 |    84,619 
           |      2.43       2.75       2.89 |      2.44 
-----------+---------------------------------+----------
        15 |   109,176      1,340        928 |   111,444 
           |      3.20       3.60       3.41 |      3.21 
-----------+---------------------------------+----------
        16 |   163,242      1,134        907 |   165,283 
           |      4.79       3.05       3.33 |      4.76 
-----------+---------------------------------+----------
        17 |   121,369        918        757 |   123,044 
           |      3.56       2.47       2.78 |      3.54 
-----------+---------------------------------+----------
        18 |   121,055      2,239      1,449 |   124,743 
           |      3.55       6.02       5.33 |      3.59 
-----------+---------------------------------+----------
        19 |   107,330      1,268        916 |   109,514 
           |      3.15       3.41       3.37 |      3.15 
-----------+---------------------------------+----------
        20 |   176,202      1,903      1,497 |   179,602 
           |      5.17       5.12       5.50 |      5.17 
-----------+---------------------------------+----------
        21 |   125,955      4,662      2,626 |   133,243 
           |      3.69      12.53       9.65 |      3.84 
-----------+---------------------------------+----------
        22 |     8,857        370        172 |     9,399 
           |      0.26       0.99       0.63 |      0.27 
-----------+---------------------------------+----------
        23 |   149,855      1,279        910 |   152,044 
           |      4.40       3.44       3.35 |      4.38 
-----------+---------------------------------+----------
        24 |     8,001         53         42 |     8,096 
           |      0.23       0.14       0.15 |      0.23 
-----------+---------------------------------+----------
        25 |    44,860        376        283 |    45,519 
           |      1.32       1.01       1.04 |      1.31 
-----------+---------------------------------+----------
        26 |   149,735        984        897 |   151,616 
           |      4.39       2.65       3.30 |      4.36 
-----------+---------------------------------+----------
        27 |   144,615      1,149        892 |   146,656 
           |      4.24       3.09       3.28 |      4.22 
-----------+---------------------------------+----------
        28 |   148,131      1,067        857 |   150,055 
           |      4.34       2.87       3.15 |      4.32 
-----------+---------------------------------+----------
        29 |    95,984        762        678 |    97,424 
           |      2.82       2.05       2.49 |      2.80 
-----------+---------------------------------+----------
        30 |    79,949        501        455 |    80,905 
           |      2.34       1.35       1.67 |      2.33 
-----------+---------------------------------+----------
        31 |     4,830         30         24 |     4,884 
           |      0.14       0.08       0.09 |      0.14 
-----------+---------------------------------+----------
        32 |   264,893      1,741      1,549 |   268,183 
           |      7.77       4.68       5.69 |      7.72 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
Respirator |     people in the household
y Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,003,968     33,360     24,013 | 3,061,341 
           |     88.11      89.69      88.27 |     88.13 
-----------+---------------------------------+----------
         1 |   405,471      3,834      3,191 |   412,496 
           |     11.89      10.31      11.73 |     11.87 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
    Asthma |     people in the household
  category |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 2,966,485     31,913     23,285 | 3,021,683 
           |     87.01      85.80      85.59 |     86.98 
-----------+---------------------------------+----------
         1 |   442,954      5,281      3,919 |   452,154 
           |     12.99      14.20      14.41 |     13.02 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
   Cardiac |     people in the household
  Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 2,696,014     29,952     21,435 | 2,747,401 
           |     79.08      80.53      78.79 |     79.09 
-----------+---------------------------------+----------
         1 |   713,425      7,242      5,769 |   726,436 
           |     20.92      19.47      21.21 |     20.91 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |  Presence of children or young
                   |     people in the household
          Diabetes |   No kids  Kids unde  Kids unde |     Total
-------------------+---------------------------------+----------
       No diabetes | 2,649,065     24,721     18,843 | 2,692,629 
                   |     81.43      70.77      73.32 |     81.26 
-------------------+---------------------------------+----------
  T1DM, controlled |     4,485         40         29 |     4,554 
                   |      0.14       0.11       0.11 |      0.14 
-------------------+---------------------------------+----------
T1DM, uncontrolled |     9,254         75         71 |     9,400 
                   |      0.28       0.21       0.28 |      0.28 
-------------------+---------------------------------+----------
  T2DM, controlled |   405,935      6,162      4,305 |   416,402 
                   |     12.48      17.64      16.75 |     12.57 
-------------------+---------------------------------+----------
T2DM, uncontrolled |   182,065      3,832      2,395 |   188,292 
                   |      5.60      10.97       9.32 |      5.68 
-------------------+---------------------------------+----------
Diabetes, no HbA1c |     2,298        102         55 |     2,455 
                   |      0.07       0.29       0.21 |      0.07 
-------------------+---------------------------------+----------
             Total | 3,253,102     34,932     25,698 | 3,313,732 
                   |    100.00     100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Non-haematolo |     people in the household
 gical cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 2,917,929     33,724     24,335 | 2,975,988 
              |     85.58      90.67      89.45 |     85.67 
--------------+---------------------------------+----------
    Last year |    41,100        353        259 |    41,712 
              |      1.21       0.95       0.95 |      1.20 
--------------+---------------------------------+----------
2-5 years ago |   122,154        970        806 |   123,930 
              |      3.58       2.61       2.96 |      3.57 
--------------+---------------------------------+----------
     5+ years |   328,256      2,147      1,804 |   332,207 
              |      9.63       5.77       6.63 |      9.56 
--------------+---------------------------------+----------
        Total | 3,409,439     37,194     27,204 | 3,473,837 
              |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Haematologica |     people in the household
     l cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 3,358,866     36,797     26,861 | 3,422,524 
              |     98.52      98.93      98.74 |     98.52 
--------------+---------------------------------+----------
    Last year |     4,883         32         32 |     4,947 
              |      0.14       0.09       0.12 |      0.14 
--------------+---------------------------------+----------
2-5 years ago |    15,075        131        115 |    15,321 
              |      0.44       0.35       0.42 |      0.44 
--------------+---------------------------------+----------
     5+ years |    30,615        234        196 |    31,045 
              |      0.90       0.63       0.72 |      0.89 
--------------+---------------------------------+----------
        Total | 3,409,439     37,194     27,204 | 3,473,837 
              |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |  Presence of children or young
        on |     people in the household
algorithm) |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,402,793     37,101     27,145 | 3,467,039 
           |     99.81      99.75      99.78 |     99.80 
-----------+---------------------------------+----------
         1 |     6,646         93         59 |     6,798 
           |      0.19       0.25       0.22 |      0.20 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |  Presence of children or young
     organ |     people in the household
transplant |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,408,347     37,174     27,188 | 3,472,709 
           |     99.97      99.95      99.94 |     99.97 
-----------+---------------------------------+----------
         1 |     1,092         20         16 |     1,128 
           |      0.03       0.05       0.06 |      0.03 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
  Asplenia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,401,007     37,120     27,140 | 3,465,267 
           |     99.75      99.80      99.76 |     99.75 
-----------+---------------------------------+----------
         1 |     8,432         74         64 |     8,570 
           |      0.25       0.20       0.24 |      0.25 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
     liver |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,378,063     36,818     26,932 | 3,441,813 
           |     99.08      98.99      99.00 |     99.08 
-----------+---------------------------------+----------
         1 |    31,376        376        272 |    32,024 
           |      0.92       1.01       1.00 |      0.92 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Neurologic |     people in the household
al disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,342,334     36,535     26,722 | 3,405,591 
           |     98.03      98.23      98.23 |     98.04 
-----------+---------------------------------+----------
         1 |    67,105        659        482 |    68,246 
           |      1.97       1.77       1.77 |      1.96 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
 Stroke or |     people in the household
  dementia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,156,602     34,801     25,300 | 3,216,703 
           |     92.58      93.57      93.00 |     92.60 
-----------+---------------------------------+----------
         1 |   252,837      2,393      1,904 |   257,134 
           |      7.42       6.43       7.00 |      7.40 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Calculated |     people in the household
      eGFR |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 |     7,857        133         94 |     8,084 
           |      0.24       0.40       0.38 |      0.25 
-----------+---------------------------------+----------
        15 |    46,410        451        339 |    47,200 
           |      1.43       1.34       1.36 |      1.43 
-----------+---------------------------------+----------
        30 |   199,940      1,573      1,323 |   202,836 
           |      6.18       4.67       5.29 |      6.16 
-----------+---------------------------------+----------
        45 |   542,646      4,475      3,781 |   550,902 
           |     16.77      13.30      15.12 |     16.72 
-----------+---------------------------------+----------
        60 | 2,438,370     27,019     19,475 | 2,484,864 
           |     75.37      80.29      77.86 |     75.44 
-----------+---------------------------------+----------
     Total | 3,235,223     33,651     25,012 | 3,293,886 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
       Reduced kidney |     people in the household
             function |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                 None | 2,612,586     30,562     21,667 | 2,664,815 
                      |     76.63      82.17      79.65 |     76.71 
----------------------+---------------------------------+----------
Stage 3a/3b egfr 30-6 |   742,586      6,048      5,104 |   753,738 
                      |     21.78      16.26      18.76 |     21.70 
----------------------+---------------------------------+----------
    Stage 4/5 egfr<30 |    54,267        584        433 |    55,284 
                      |      1.59       1.57       1.59 |      1.59 
----------------------+---------------------------------+----------
                Total | 3,409,439     37,194     27,204 | 3,473,837 
                      |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |  Presence of children or young
     renal |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,401,100     37,033     27,106 | 3,465,239 
           |     99.76      99.57      99.64 |     99.75 
-----------+---------------------------------+----------
         1 |     8,339        161         98 |     8,598 
           |      0.24       0.43       0.36 |      0.25 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |  Presence of children or young
hypertensi |     people in the household
        on |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 1,505,490     17,633     12,303 | 1,535,426 
           |     44.16      47.41      45.22 |     44.20 
-----------+---------------------------------+----------
         1 | 1,903,949     19,561     14,901 | 1,938,411 
           |     55.84      52.59      54.78 |     55.80 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Autoimmune |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,148,557     34,920     25,250 | 3,208,727 
           |     92.35      93.89      92.82 |     92.37 
-----------+---------------------------------+----------
         1 |   260,882      2,274      1,954 |   265,110 
           |      7.65       6.11       7.18 |      7.63 
-----------+---------------------------------+----------
     Total | 3,409,439     37,194     27,204 | 3,473,837 
           |    100.00     100.00     100.00 |    100.00 

. * Close the log file
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\03a_an_descriptive_tables.log
  log type:  text
 closed on:  22 Aug 2020, 13:21:36
----------------------------------------------------------------------------------------------------------------------------------
