----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\04a_an_descriptive_tables.log
  log type:  text
 opened on:  22 Aug 2020, 13:07:56

. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_ageband_`x', clear
  3. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. ta shield
 16. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd            ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 17.                                                 
. safetab `var'
 18. }
 19. 
. safetab imd 
 20. safetab imd, m
 21. safetab ethnicity
 22. safetab ethnicity, m
 23. safetab stp
 24. 
. 
. * Outcomes
. safetab non_covid_death
 25. safetab covid_death
 26. safetab covid_tpp_prob
 27. safetab covid_death_icu
 28. safetab covid_icu
 29. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death_icu non_covid_death {
 30. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                        `outvar', col
 31.         safetab male                                                            `outvar', col
 32.         safetab bmicat                                                          `outvar', col m 
 33.         safetab smoke                                                           `outvar', col m
 34.         safetab obese4cat                                                       `outvar', col m 
 35.         safetab shield                                                          `outvar', col m 
 36. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 esrd ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 37.         safetab `var'           `outvar', col
 38. }
 39.         
.         safetab imd                                                             `outvar', col m
 40.         safetab ethnicity                                                       `outvar', col m
 41.         *safetab urban                                                          `outvar', col
.         safetab stp                                                             `outvar', col
 42. }
 43. 
. 
. ********************************************
. *  Cumulative incidence of ONS COVID DEATH*
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_death_icu_ageband_`x'.dta", clear
 44. 
. sts list , at(0 80) by(agegroup male) fail
 45. 
. 
. ********************************************
. *  Cumulative incidence of ONS NON COVID DEATH*
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_non_covid_death_ageband_`x'.dta", clear
 46. 
. sts list , at(0 80) by(agegroup male) fail
 47. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROBABLE CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'.dta", clear
 48. 
. sts list , at(0 80) by(agegroup male) fail
 49. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 11,661,633    41.89455    13.22727         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  2,590,202       22.21       22.21
     30-<40 |  2,703,210       23.18       45.39
     40-<50 |  2,458,941       21.09       66.48
     50-<60 |  2,598,630       22.28       88.76
     60-<70 |  1,310,650       11.24      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,661,633      100.00      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  5,891,933       50.52       50.52
          1 |  5,769,700       49.48      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    219,615        2.41        2.41
  Normal (18.5-24.9) |  3,383,773       37.15       39.56
Overweight (25-29.9) |  2,990,922       32.84       72.40
   Obese I (30-34.9) |  1,537,333       16.88       89.27
  Obese II (35-39.9) |    633,057        6.95       96.22
     Obese III (40+) |    343,997        3.78      100.00
---------------------+-----------------------------------
               Total |  9,108,697      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    219,615        1.88        1.88
  Normal (18.5-24.9) |  3,383,773       29.02       30.90
Overweight (25-29.9) |  2,990,922       25.65       56.55
   Obese I (30-34.9) |  1,537,333       13.18       69.73
  Obese II (35-39.9) |    633,057        5.43       75.16
     Obese III (40+) |    343,997        2.95       78.11
        Unknown (.u) |  2,552,936       21.89      100.00
---------------------+-----------------------------------
               Total | 11,661,633      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  9,147,246       78.44       78.44
   Obese I (30-34.9) |  1,537,333       13.18       91.62
  Obese II (35-39.9) |    633,057        5.43       97.05
     Obese III (40+) |    343,997        2.95      100.00
---------------------+-----------------------------------
               Total | 11,661,633      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,726,231       49.98       49.98
      Former |  3,302,174       28.82       78.80
     Current |  2,428,631       21.20      100.00
-------------+-----------------------------------
       Total | 11,457,036      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,726,231       49.10       49.10
      Former |  3,302,174       28.32       77.42
     Current |  2,428,631       20.83       98.25
Unknown (.u) |    204,597        1.75      100.00
-------------+-----------------------------------
       Total | 11,661,633      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,039,378       29.22       29.22
      Elevated |  1,680,731       16.16       45.38
 High, stage I |  3,656,085       35.15       80.53
High, stage II |  2,024,773       19.47      100.00
---------------+-----------------------------------
         Total | 10,400,967      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,039,378       26.06       26.06
      Elevated |  1,680,731       14.41       40.48
 High, stage I |  3,656,085       31.35       71.83
High, stage II |  2,024,773       17.36       89.19
       Unknown |  1,260,666       10.81      100.00
---------------+-----------------------------------
         Total | 11,661,633      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,860,758       75.98       75.98
          1 |  2,800,875       24.02      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,200,449       78.90       78.90
          1 |  2,461,184       21.10      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,433,218       98.04       98.04
          1 |    228,415        1.96      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,640,246       82.67       82.67
          1 |  2,021,387       17.33      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,328,961       97.15       97.15
          1 |    332,672        2.85      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 10,915,953       95.10       95.10
  T1DM, controlled |     16,341        0.14       95.24
T1DM, uncontrolled |     49,049        0.43       95.67
  T2DM, controlled |    274,782        2.39       98.06
T2DM, uncontrolled |    216,880        1.89       99.95
Diabetes, no HbA1c |      5,341        0.05      100.00
-------------------+-----------------------------------
             Total | 11,478,346      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,405,980       97.81       97.81
    Last year |     28,417        0.24       98.05
2-5 years ago |     81,917        0.70       98.75
     5+ years |    145,319        1.25      100.00
--------------+-----------------------------------
        Total | 11,661,633      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,624,209       99.68       99.68
    Last year |      3,026        0.03       99.71
2-5 years ago |      9,418        0.08       99.79
     5+ years |     24,980        0.21      100.00
--------------+-----------------------------------
        Total | 11,661,633      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,622,999       99.67       99.67
          1 |     38,634        0.33      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,658,832       99.98       99.98
          1 |      2,801        0.02      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,647,894       99.88       99.88
          1 |     13,739        0.12      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,598,923       99.46       99.46
          1 |     62,710        0.54      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,580,141       99.30       99.30
          1 |     81,492        0.70      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,570,304       99.22       99.22
          1 |     91,329        0.78      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,967        0.06        0.06
         15 |      6,904        0.08        0.15
         30 |     16,690        0.20        0.35
         45 |    104,785        1.28        1.63
         60 |  8,028,069       98.37      100.00
------------+-----------------------------------
      Total |  8,161,415      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 11,528,287       98.86       98.86
Stage 3a/3b egfr 30-60       |    121,475        1.04       99.90
           Stage 4/5 egfr<30 |     11,871        0.10      100.00
-----------------------------+-----------------------------------
                       Total | 11,661,633      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,647,413       99.88       99.88
          1 |     14,220        0.12      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,326,524       88.55       88.55
          1 |  1,335,109       11.45      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,140,422       95.53       95.53
          1 |    521,211        4.47      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,202,080       18.88       18.88
               2 |  2,326,807       19.95       38.84
               3 |  2,363,210       20.26       59.10
               4 |  2,457,892       21.08       80.18
 5 most deprived |  2,311,644       19.82      100.00
-----------------+-----------------------------------
           Total | 11,661,633      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,202,080       18.88       18.88
               2 |  2,326,807       19.95       38.84
               3 |  2,363,210       20.26       59.10
               4 |  2,457,892       21.08       80.18
 5 most deprived |  2,311,644       19.82      100.00
-----------------+-----------------------------------
           Total | 11,661,633      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,447,428       82.83       82.83
                 Mixed |    153,747        1.71       84.54
Asian or Asian British |    811,754        9.03       93.57
                 Black |    298,222        3.32       96.89
                 Other |    279,981        3.11      100.00
-----------------------+-----------------------------------
                 Total |  8,991,132      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,447,428       63.86       63.86
                 Mixed |    153,747        1.32       65.18
Asian or Asian British |    811,754        6.96       72.14
                 Black |    298,222        2.56       74.70
                 Other |    279,981        2.40       77.10
               Unknown |  2,670,501       22.90      100.00
-----------------------+-----------------------------------
                 Total | 11,661,633      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,143        0.03        0.03
          2 |  1,112,430        9.54        9.57
          3 |    508,599        4.36       13.93
          4 |    117,057        1.00       14.93
          5 |     81,859        0.70       15.63
          6 |    547,952        4.70       20.33
          7 |     31,962        0.27       20.61
          8 |    427,096        3.66       24.27
          9 |    330,192        2.83       27.10
         10 |    465,302        3.99       31.09
         11 |    523,379        4.49       35.58
         12 |    175,756        1.51       37.09
         13 |    261,804        2.25       39.33
         14 |    324,100        2.78       42.11
         15 |    417,102        3.58       45.69
         16 |    412,025        3.53       49.22
         17 |    357,492        3.07       52.28
         18 |    515,798        4.42       56.71
         19 |    401,849        3.45       60.15
         20 |    577,011        4.95       65.10
         21 |    919,696        7.89       72.99
         22 |     60,889        0.52       73.51
         23 |    444,332        3.81       77.32
         24 |     21,053        0.18       77.50
         25 |    113,960        0.98       78.48
         26 |    356,922        3.06       81.54
         27 |    445,766        3.82       85.36
         28 |    360,299        3.09       88.45
         29 |    301,882        2.59       91.04
         30 |    232,455        1.99       93.03
         31 |     13,658        0.12       93.15
         32 |    798,813        6.85      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,651,416       99.91       99.91
          1 |     10,217        0.09      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,660,180       99.99       99.99
          1 |      1,453        0.01      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,628,183       99.71       99.71
          1 |     33,450        0.29      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,658,927       99.98       99.98
          1 |      2,706        0.02      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,659,823       99.98       99.98
          1 |      1,810        0.02      100.00
------------+-----------------------------------
      Total | 11,661,633      100.00
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,584,662      5,540 | 2,590,202 
           |     22.23      16.56 |     22.21 
-----------+----------------------+----------
    30-<40 | 2,696,259      6,951 | 2,703,210 
           |     23.19      20.78 |     23.18 
-----------+----------------------+----------
    40-<50 | 2,451,334      7,607 | 2,458,941 
           |     21.08      22.74 |     21.09 
-----------+----------------------+----------
    50-<60 | 2,589,537      9,093 | 2,598,630 
           |     22.27      27.18 |     22.28 
-----------+----------------------+----------
    60-<70 | 1,306,391      4,259 | 1,310,650 
           |     11.23      12.73 |     11.24 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,872,577     19,356 | 5,891,933 
           |     50.50      57.87 |     50.52 
-----------+----------------------+----------
         1 | 5,755,606     14,094 | 5,769,700 
           |     49.50      42.13 |     49.48 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   219,100        515 |   219,615 
                     |      1.88       1.54 |      1.88 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,375,870      7,903 | 3,383,773 
                     |     29.03      23.63 |     29.02 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,981,445      9,477 | 2,990,922 
                     |     25.64      28.33 |     25.65 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,531,343      5,990 | 1,537,333 
                     |     13.17      17.91 |     13.18 
---------------------+----------------------+----------
  Obese II (35-39.9) |   630,136      2,921 |   633,057 
                     |      5.42       8.73 |      5.43 
---------------------+----------------------+----------
     Obese III (40+) |   342,059      1,938 |   343,997 
                     |      2.94       5.79 |      2.95 
---------------------+----------------------+----------
        Unknown (.u) | 2,548,230      4,706 | 2,552,936 
                     |     21.91      14.07 |     21.89 
---------------------+----------------------+----------
               Total |11,628,183     33,450 |11,661,633 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,708,423     17,808 | 5,726,231 
             |     49.09      53.24 |     49.10 
-------------+----------------------+----------
      Former | 3,291,350     10,824 | 3,302,174 
             |     28.30      32.36 |     28.32 
-------------+----------------------+----------
     Current | 2,424,052      4,579 | 2,428,631 
             |     20.85      13.69 |     20.83 
-------------+----------------------+----------
Unknown (.u) |   204,358        239 |   204,597 
             |      1.76       0.71 |      1.75 
-------------+----------------------+----------
       Total |11,628,183     33,450 |11,661,633 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,124,645     22,601 | 9,147,246 
                     |     78.47      67.57 |     78.44 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,531,343      5,990 | 1,537,333 
                     |     13.17      17.91 |     13.18 
---------------------+----------------------+----------
  Obese II (35-39.9) |   630,136      2,921 |   633,057 
                     |      5.42       8.73 |      5.43 
---------------------+----------------------+----------
     Obese III (40+) |   342,059      1,938 |   343,997 
                     |      2.94       5.79 |      2.95 
---------------------+----------------------+----------
               Total |11,628,183     33,450 |11,661,633 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,176,133     24,316 | 9,200,449 
           |     78.91      72.69 |     78.90 
-----------+----------------------+----------
         1 | 2,452,050      9,134 | 2,461,184 
           |     21.09      27.31 |     21.10 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,401,183     32,035 |11,433,218 
           |     98.05      95.77 |     98.04 
-----------+----------------------+----------
         1 |   227,000      1,415 |   228,415 
           |      1.95       4.23 |      1.96 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,613,528     26,718 | 9,640,246 
           |     82.67      79.87 |     82.67 
-----------+----------------------+----------
         1 | 2,014,655      6,732 | 2,021,387 
           |     17.33      20.13 |     17.33 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,297,309     31,652 |11,328,961 
           |     97.15      94.62 |     97.15 
-----------+----------------------+----------
         1 |   330,874      1,798 |   332,672 
           |      2.85       5.38 |      2.85 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: covid prob
                   |         case
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |10,887,074     28,879 |10,915,953 
                   |     95.12      88.56 |     95.10 
-------------------+----------------------+----------
  T1DM, controlled |    16,278         63 |    16,341 
                   |      0.14       0.19 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    48,818        231 |    49,049 
                   |      0.43       0.71 |      0.43 
-------------------+----------------------+----------
  T2DM, controlled |   273,037      1,745 |   274,782 
                   |      2.39       5.35 |      2.39 
-------------------+----------------------+----------
T2DM, uncontrolled |   215,211      1,669 |   216,880 
                   |      1.88       5.12 |      1.89 
-------------------+----------------------+----------
Diabetes, no HbA1c |     5,319         22 |     5,341 
                   |      0.05       0.07 |      0.05 
-------------------+----------------------+----------
             Total |11,445,737     32,609 |11,478,346 
                   |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,373,571     32,409 |11,405,980 
              |     97.81      96.89 |     97.81 
--------------+----------------------+----------
    Last year |    28,238        179 |    28,417 
              |      0.24       0.54 |      0.24 
--------------+----------------------+----------
2-5 years ago |    81,575        342 |    81,917 
              |      0.70       1.02 |      0.70 
--------------+----------------------+----------
     5+ years |   144,799        520 |   145,319 
              |      1.25       1.55 |      1.25 
--------------+----------------------+----------
        Total |11,628,183     33,450 |11,661,633 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,591,016     33,193 |11,624,209 
              |     99.68      99.23 |     99.68 
--------------+----------------------+----------
    Last year |     2,991         35 |     3,026 
              |      0.03       0.10 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,334         84 |     9,418 
              |      0.08       0.25 |      0.08 
--------------+----------------------+----------
     5+ years |    24,842        138 |    24,980 
              |      0.21       0.41 |      0.21 
--------------+----------------------+----------
        Total |11,628,183     33,450 |11,661,633 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |11,589,819     33,180 |11,622,999 
           |     99.67      99.19 |     99.67 
-----------+----------------------+----------
         1 |    38,364        270 |    38,634 
           |      0.33       0.81 |      0.33 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |11,625,428     33,404 |11,658,832 
           |     99.98      99.86 |     99.98 
-----------+----------------------+----------
         1 |     2,755         46 |     2,801 
           |      0.02       0.14 |      0.02 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,614,553     33,341 |11,647,894 
           |     99.88      99.67 |     99.88 
-----------+----------------------+----------
         1 |    13,630        109 |    13,739 
           |      0.12       0.33 |      0.12 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,565,868     33,055 |11,598,923 
           |     99.46      98.82 |     99.46 
-----------+----------------------+----------
         1 |    62,315        395 |    62,710 
           |      0.54       1.18 |      0.54 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,547,073     33,068 |11,580,141 
           |     99.30      98.86 |     99.30 
-----------+----------------------+----------
         1 |    81,110        382 |    81,492 
           |      0.70       1.14 |      0.70 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,537,421     32,883 |11,570,304 
           |     99.22      98.30 |     99.22 
-----------+----------------------+----------
         1 |    90,762        567 |    91,329 
           |      0.78       1.70 |      0.78 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,808        159 |     4,967 
           |      0.06       0.57 |      0.06 
-----------+----------------------+----------
        15 |     6,818         86 |     6,904 
           |      0.08       0.31 |      0.08 
-----------+----------------------+----------
        30 |    16,535        155 |    16,690 
           |      0.20       0.56 |      0.20 
-----------+----------------------+----------
        45 |   104,277        508 |   104,785 
           |      1.28       1.83 |      1.28 
-----------+----------------------+----------
        60 | 8,001,145     26,924 | 8,028,069 
           |     98.37      96.74 |     98.37 
-----------+----------------------+----------
     Total | 8,133,583     27,832 | 8,161,415 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,614,253     33,160 |11,647,413 
           |     99.88      99.13 |     99.88 
-----------+----------------------+----------
         1 |    13,930        290 |    14,220 
           |      0.12       0.87 |      0.12 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,495,745     32,542 |11,528,287 
                      |     98.86      97.29 |     98.86 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   120,812        663 |   121,475 
                      |      1.04       1.98 |      1.04 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,626        245 |    11,871 
                      |      0.10       0.73 |      0.10 
----------------------+----------------------+----------
                Total |11,628,183     33,450 |11,661,633 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,299,380     27,144 |10,326,524 
           |     88.57      81.15 |     88.55 
-----------+----------------------+----------
         1 | 1,328,803      6,306 | 1,335,109 
           |     11.43      18.85 |     11.45 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,108,893     31,529 |11,140,422 
           |     95.53      94.26 |     95.53 
-----------+----------------------+----------
         1 |   519,290      1,921 |   521,211 
           |      4.47       5.74 |      4.47 
-----------+----------------------+----------
     Total |11,628,183     33,450 |11,661,633 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,197,243      4,837 | 2,202,080 
                 |     18.90      14.46 |     18.88 
-----------------+----------------------+----------
               2 | 2,321,045      5,762 | 2,326,807 
                 |     19.96      17.23 |     19.95 
-----------------+----------------------+----------
               3 | 2,357,142      6,068 | 2,363,210 
                 |     20.27      18.14 |     20.26 
-----------------+----------------------+----------
               4 | 2,450,172      7,720 | 2,457,892 
                 |     21.07      23.08 |     21.08 
-----------------+----------------------+----------
 5 most deprived | 2,302,581      9,063 | 2,311,644 
                 |     19.80      27.09 |     19.82 
-----------------+----------------------+----------
           Total |11,628,183     33,450 |11,661,633 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,429,211     18,217 | 7,447,428 
                      |     63.89      54.46 |     63.86 
----------------------+----------------------+----------
                Mixed |   153,218        529 |   153,747 
                      |      1.32       1.58 |      1.32 
----------------------+----------------------+----------
Asian or Asian Britis |   805,700      6,054 |   811,754 
                      |      6.93      18.10 |      6.96 
----------------------+----------------------+----------
                Black |   296,825      1,397 |   298,222 
                      |      2.55       4.18 |      2.56 
----------------------+----------------------+----------
                Other |   279,204        777 |   279,981 
                      |      2.40       2.32 |      2.40 
----------------------+----------------------+----------
              Unknown | 2,664,025      6,476 | 2,670,501 
                      |     22.91      19.36 |     22.90 
----------------------+----------------------+----------
                Total |11,628,183     33,450 |11,661,633 
                      |    100.00     100.00 |    100.00 
19

**TABLE OF stp covid_tpp_prob REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |       icu/death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,590,151         51 | 2,590,202 
           |     22.22       1.88 |     22.21 
-----------+----------------------+----------
    30-<40 | 2,703,028        182 | 2,703,210 
           |     23.18       6.73 |     23.18 
-----------+----------------------+----------
    40-<50 | 2,458,478        463 | 2,458,941 
           |     21.09      17.11 |     21.09 
-----------+----------------------+----------
    50-<60 | 2,597,540      1,090 | 2,598,630 
           |     22.28      40.28 |     22.28 
-----------+----------------------+----------
    60-<70 | 1,309,730        920 | 1,310,650 
           |     11.23      34.00 |     11.24 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,891,010        923 | 5,891,933 
           |     50.53      34.11 |     50.52 
-----------+----------------------+----------
         1 | 5,767,917      1,783 | 5,769,700 
           |     49.47      65.89 |     49.48 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |       icu/death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   219,581         34 |   219,615 
                     |      1.88       1.26 |      1.88 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,383,406        367 | 3,383,773 
                     |     29.02      13.56 |     29.02 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,990,247        675 | 2,990,922 
                     |     25.65      24.94 |     25.65 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,536,697        636 | 1,537,333 
                     |     13.18      23.50 |     13.18 
---------------------+----------------------+----------
  Obese II (35-39.9) |   632,674        383 |   633,057 
                     |      5.43      14.15 |      5.43 
---------------------+----------------------+----------
     Obese III (40+) |   343,714        283 |   343,997 
                     |      2.95      10.46 |      2.95 
---------------------+----------------------+----------
        Unknown (.u) | 2,552,608        328 | 2,552,936 
                     |     21.89      12.12 |     21.89 
---------------------+----------------------+----------
               Total |11,658,927      2,706 |11,661,633 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |       icu/death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,724,982      1,249 | 5,726,231 
             |     49.10      46.16 |     49.10 
-------------+----------------------+----------
      Former | 3,301,049      1,125 | 3,302,174 
             |     28.31      41.57 |     28.32 
-------------+----------------------+----------
     Current | 2,428,301        330 | 2,428,631 
             |     20.83      12.20 |     20.83 
-------------+----------------------+----------
Unknown (.u) |   204,595          2 |   204,597 
             |      1.75       0.07 |      1.75 
-------------+----------------------+----------
       Total |11,658,927      2,706 |11,661,633 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |       icu/death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,145,842      1,404 | 9,147,246 
                     |     78.44      51.88 |     78.44 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,536,697        636 | 1,537,333 
                     |     13.18      23.50 |     13.18 
---------------------+----------------------+----------
  Obese II (35-39.9) |   632,674        383 |   633,057 
                     |      5.43      14.15 |      5.43 
---------------------+----------------------+----------
     Obese III (40+) |   343,714        283 |   343,997 
                     |      2.95      10.46 |      2.95 
---------------------+----------------------+----------
               Total |11,658,927      2,706 |11,661,633 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |       icu/death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,198,810      1,639 | 9,200,449 
           |     78.90      60.57 |     78.90 
-----------+----------------------+----------
         1 | 2,460,117      1,067 | 2,461,184 
           |     21.10      39.43 |     21.10 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |       icu/death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,430,835      2,383 |11,433,218 
           |     98.04      88.06 |     98.04 
-----------+----------------------+----------
         1 |   228,092        323 |   228,415 
           |      1.96      11.94 |      1.96 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |       icu/death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,638,090      2,156 | 9,640,246 
           |     82.67      79.67 |     82.67 
-----------+----------------------+----------
         1 | 2,020,837        550 | 2,021,387 
           |     17.33      20.33 |     17.33 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |       icu/death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,326,675      2,286 |11,328,961 
           |     97.15      84.48 |     97.15 
-----------+----------------------+----------
         1 |   332,252        420 |   332,672 
           |      2.85      15.52 |      2.85 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |    outcome: covid
                   |       icu/death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |10,914,209      1,744 |10,915,953 
                   |     95.11      67.73 |     95.10 
-------------------+----------------------+----------
  T1DM, controlled |    16,331         10 |    16,341 
                   |      0.14       0.39 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    49,008         41 |    49,049 
                   |      0.43       1.59 |      0.43 
-------------------+----------------------+----------
  T2DM, controlled |   274,436        346 |   274,782 
                   |      2.39      13.44 |      2.39 
-------------------+----------------------+----------
T2DM, uncontrolled |   216,454        426 |   216,880 
                   |      1.89      16.54 |      1.89 
-------------------+----------------------+----------
Diabetes, no HbA1c |     5,333          8 |     5,341 
                   |      0.05       0.31 |      0.05 
-------------------+----------------------+----------
             Total |11,475,771      2,575 |11,478,346 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |       icu/death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,403,458      2,522 |11,405,980 
              |     97.81      93.20 |     97.81 
--------------+----------------------+----------
    Last year |    28,371         46 |    28,417 
              |      0.24       1.70 |      0.24 
--------------+----------------------+----------
2-5 years ago |    81,847         70 |    81,917 
              |      0.70       2.59 |      0.70 
--------------+----------------------+----------
     5+ years |   145,251         68 |   145,319 
              |      1.25       2.51 |      1.25 
--------------+----------------------+----------
        Total |11,658,927      2,706 |11,661,633 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |       icu/death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,621,563      2,646 |11,624,209 
              |     99.68      97.78 |     99.68 
--------------+----------------------+----------
    Last year |     3,017          9 |     3,026 
              |      0.03       0.33 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,392         26 |     9,418 
              |      0.08       0.96 |      0.08 
--------------+----------------------+----------
     5+ years |    24,955         25 |    24,980 
              |      0.21       0.92 |      0.21 
--------------+----------------------+----------
        Total |11,658,927      2,706 |11,661,633 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |       icu/death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |11,620,331      2,668 |11,622,999 
           |     99.67      98.60 |     99.67 
-----------+----------------------+----------
         1 |    38,596         38 |    38,634 
           |      0.33       1.40 |      0.33 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |    outcome: covid
     organ |       icu/death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |11,656,132      2,700 |11,658,832 
           |     99.98      99.78 |     99.98 
-----------+----------------------+----------
         1 |     2,795          6 |     2,801 
           |      0.02       0.22 |      0.02 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,645,204      2,690 |11,647,894 
           |     99.88      99.41 |     99.88 
-----------+----------------------+----------
         1 |    13,723         16 |    13,739 
           |      0.12       0.59 |      0.12 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,596,314      2,609 |11,598,923 
           |     99.46      96.42 |     99.46 
-----------+----------------------+----------
         1 |    62,613         97 |    62,710 
           |      0.54       3.58 |      0.54 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |       icu/death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,577,535      2,606 |11,580,141 
           |     99.30      96.30 |     99.30 
-----------+----------------------+----------
         1 |    81,392        100 |    81,492 
           |      0.70       3.70 |      0.70 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |       icu/death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,567,763      2,541 |11,570,304 
           |     99.22      93.90 |     99.22 
-----------+----------------------+----------
         1 |    91,164        165 |    91,329 
           |      0.78       6.10 |      0.78 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |       icu/death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,913         54 |     4,967 
           |      0.06       2.19 |      0.06 
-----------+----------------------+----------
        15 |     6,855         49 |     6,904 
           |      0.08       1.98 |      0.08 
-----------+----------------------+----------
        30 |    16,616         74 |    16,690 
           |      0.20       3.00 |      0.20 
-----------+----------------------+----------
        45 |   104,648        137 |   104,785 
           |      1.28       5.55 |      1.28 
-----------+----------------------+----------
        60 | 8,025,914      2,155 | 8,028,069 
           |     98.37      87.28 |     98.37 
-----------+----------------------+----------
     Total | 8,158,946      2,469 | 8,161,415 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |    outcome: covid
     renal |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,644,807      2,606 |11,647,413 
           |     99.88      96.30 |     99.88 
-----------+----------------------+----------
         1 |    14,120        100 |    14,220 
           |      0.12       3.70 |      0.12 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |       icu/death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,525,895      2,392 |11,528,287 
                      |     98.86      88.40 |     98.86 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   121,264        211 |   121,475 
                      |      1.04       7.80 |      1.04 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,768        103 |    11,871 
                      |      0.10       3.81 |      0.10 
----------------------+----------------------+----------
                Total |11,658,927      2,706 |11,661,633 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |       icu/death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,325,000      1,524 |10,326,524 
           |     88.56      56.32 |     88.55 
-----------+----------------------+----------
         1 | 1,333,927      1,182 | 1,335,109 
           |     11.44      43.68 |     11.45 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,137,924      2,498 |11,140,422 
           |     95.53      92.31 |     95.53 
-----------+----------------------+----------
         1 |   521,003        208 |   521,211 
           |      4.47       7.69 |      4.47 
-----------+----------------------+----------
     Total |11,658,927      2,706 |11,661,633 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |       icu/death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,201,725        355 | 2,202,080 
                 |     18.88      13.12 |     18.88 
-----------------+----------------------+----------
               2 | 2,326,381        426 | 2,326,807 
                 |     19.95      15.74 |     19.95 
-----------------+----------------------+----------
               3 | 2,362,719        491 | 2,363,210 
                 |     20.27      18.14 |     20.26 
-----------------+----------------------+----------
               4 | 2,457,190        702 | 2,457,892 
                 |     21.08      25.94 |     21.08 
-----------------+----------------------+----------
 5 most deprived | 2,310,912        732 | 2,311,644 
                 |     19.82      27.05 |     19.82 
-----------------+----------------------+----------
           Total |11,658,927      2,706 |11,661,633 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |       icu/death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,445,985      1,443 | 7,447,428 
                      |     63.87      53.33 |     63.86 
----------------------+----------------------+----------
                Mixed |   153,690         57 |   153,747 
                      |      1.32       2.11 |      1.32 
----------------------+----------------------+----------
Asian or Asian Britis |   811,347        407 |   811,754 
                      |      6.96      15.04 |      6.96 
----------------------+----------------------+----------
                Black |   298,024        198 |   298,222 
                      |      2.56       7.32 |      2.56 
----------------------+----------------------+----------
                Other |   279,895         86 |   279,981 
                      |      2.40       3.18 |      2.40 
----------------------+----------------------+----------
              Unknown | 2,669,986        515 | 2,670,501 
                      |     22.90      19.03 |     22.90 
----------------------+----------------------+----------
                Total |11,658,927      2,706 |11,661,633 
                      |    100.00     100.00 |    100.00 
20

**TABLE OF stp covid_death_icu REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,590,024        178 | 2,590,202 
           |     22.23       1.74 |     22.21 
-----------+----------------------+----------
    30-<40 | 2,702,754        456 | 2,703,210 
           |     23.20       4.46 |     23.18 
-----------+----------------------+----------
    40-<50 | 2,457,489      1,452 | 2,458,941 
           |     21.09      14.21 |     21.09 
-----------+----------------------+----------
    50-<60 | 2,594,702      3,928 | 2,598,630 
           |     22.27      38.45 |     22.28 
-----------+----------------------+----------
    60-<70 | 1,306,447      4,203 | 1,310,650 
           |     11.21      41.14 |     11.24 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,887,679      4,254 | 5,891,933 
           |     50.53      41.64 |     50.52 
-----------+----------------------+----------
         1 | 5,763,737      5,963 | 5,769,700 
           |     49.47      58.36 |     49.48 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   219,064        551 |   219,615 
                     |      1.88       5.39 |      1.88 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,380,820      2,953 | 3,383,773 
                     |     29.02      28.90 |     29.02 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,988,461      2,461 | 2,990,922 
                     |     25.65      24.09 |     25.65 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,535,826      1,507 | 1,537,333 
                     |     13.18      14.75 |     13.18 
---------------------+----------------------+----------
  Obese II (35-39.9) |   632,317        740 |   633,057 
                     |      5.43       7.24 |      5.43 
---------------------+----------------------+----------
     Obese III (40+) |   343,424        573 |   343,997 
                     |      2.95       5.61 |      2.95 
---------------------+----------------------+----------
        Unknown (.u) | 2,551,504      1,432 | 2,552,936 
                     |     21.90      14.02 |     21.89 
---------------------+----------------------+----------
               Total |11,651,416     10,217 |11,661,633 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,723,399      2,832 | 5,726,231 
             |     49.12      27.72 |     49.10 
-------------+----------------------+----------
      Former | 3,298,580      3,594 | 3,302,174 
             |     28.31      35.18 |     28.32 
-------------+----------------------+----------
     Current | 2,424,873      3,758 | 2,428,631 
             |     20.81      36.78 |     20.83 
-------------+----------------------+----------
Unknown (.u) |   204,564         33 |   204,597 
             |      1.76       0.32 |      1.75 
-------------+----------------------+----------
       Total |11,651,416     10,217 |11,661,633 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,139,849      7,397 | 9,147,246 
                     |     78.44      72.40 |     78.44 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,535,826      1,507 | 1,537,333 
                     |     13.18      14.75 |     13.18 
---------------------+----------------------+----------
  Obese II (35-39.9) |   632,317        740 |   633,057 
                     |      5.43       7.24 |      5.43 
---------------------+----------------------+----------
     Obese III (40+) |   343,424        573 |   343,997 
                     |      2.95       5.61 |      2.95 
---------------------+----------------------+----------
               Total |11,651,416     10,217 |11,661,633 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,196,893      3,556 | 9,200,449 
           |     78.93      34.80 |     78.90 
-----------+----------------------+----------
         1 | 2,454,523      6,661 | 2,461,184 
           |     21.07      65.20 |     21.10 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,424,778      8,440 |11,433,218 
           |     98.05      82.61 |     98.04 
-----------+----------------------+----------
         1 |   226,638      1,777 |   228,415 
           |      1.95      17.39 |      1.96 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,631,814      8,432 | 9,640,246 
           |     82.67      82.53 |     82.67 
-----------+----------------------+----------
         1 | 2,019,602      1,785 | 2,021,387 
           |     17.33      17.47 |     17.33 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,320,573      8,388 |11,328,961 
           |     97.16      82.10 |     97.15 
-----------+----------------------+----------
         1 |   330,843      1,829 |   332,672 
           |      2.84      17.90 |      2.85 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: non-covid
                   |         death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |10,908,116      7,837 |10,915,953 
                   |     95.11      78.84 |     95.10 
-------------------+----------------------+----------
  T1DM, controlled |    16,276         65 |    16,341 
                   |      0.14       0.65 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    48,874        175 |    49,049 
                   |      0.43       1.76 |      0.43 
-------------------+----------------------+----------
  T2DM, controlled |   273,822        960 |   274,782 
                   |      2.39       9.66 |      2.39 
-------------------+----------------------+----------
T2DM, uncontrolled |   216,004        876 |   216,880 
                   |      1.88       8.81 |      1.89 
-------------------+----------------------+----------
Diabetes, no HbA1c |     5,314         27 |     5,341 
                   |      0.05       0.27 |      0.05 
-------------------+----------------------+----------
             Total |11,468,406      9,940 |11,478,346 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,399,419      6,561 |11,405,980 
              |     97.84      64.22 |     97.81 
--------------+----------------------+----------
    Last year |    27,036      1,381 |    28,417 
              |      0.23      13.52 |      0.24 
--------------+----------------------+----------
2-5 years ago |    80,451      1,466 |    81,917 
              |      0.69      14.35 |      0.70 
--------------+----------------------+----------
     5+ years |   144,510        809 |   145,319 
              |      1.24       7.92 |      1.25 
--------------+----------------------+----------
        Total |11,651,416     10,217 |11,661,633 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,614,309      9,900 |11,624,209 
              |     99.68      96.90 |     99.68 
--------------+----------------------+----------
    Last year |     2,941         85 |     3,026 
              |      0.03       0.83 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,299        119 |     9,418 
              |      0.08       1.16 |      0.08 
--------------+----------------------+----------
     5+ years |    24,867        113 |    24,980 
              |      0.21       1.11 |      0.21 
--------------+----------------------+----------
        Total |11,651,416     10,217 |11,661,633 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |11,612,926     10,073 |11,622,999 
           |     99.67      98.59 |     99.67 
-----------+----------------------+----------
         1 |    38,490        144 |    38,634 
           |      0.33       1.41 |      0.33 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |11,648,648     10,184 |11,658,832 
           |     99.98      99.68 |     99.98 
-----------+----------------------+----------
         1 |     2,768         33 |     2,801 
           |      0.02       0.32 |      0.02 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,637,771     10,123 |11,647,894 
           |     99.88      99.08 |     99.88 
-----------+----------------------+----------
         1 |    13,645         94 |    13,739 
           |      0.12       0.92 |      0.12 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,589,693      9,230 |11,598,923 
           |     99.47      90.34 |     99.46 
-----------+----------------------+----------
         1 |    61,723        987 |    62,710 
           |      0.53       9.66 |      0.54 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,570,345      9,796 |11,580,141 
           |     99.30      95.88 |     99.30 
-----------+----------------------+----------
         1 |    81,071        421 |    81,492 
           |      0.70       4.12 |      0.70 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,560,816      9,488 |11,570,304 
           |     99.22      92.86 |     99.22 
-----------+----------------------+----------
         1 |    90,600        729 |    91,329 
           |      0.78       7.14 |      0.78 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,794        173 |     4,967 
           |      0.06       1.85 |      0.06 
-----------+----------------------+----------
        15 |     6,738        166 |     6,904 
           |      0.08       1.77 |      0.08 
-----------+----------------------+----------
        30 |    16,459        231 |    16,690 
           |      0.20       2.47 |      0.20 
-----------+----------------------+----------
        45 |   104,312        473 |   104,785 
           |      1.28       5.05 |      1.28 
-----------+----------------------+----------
        60 | 8,019,750      8,319 | 8,028,069 
           |     98.38      88.86 |     98.37 
-----------+----------------------+----------
     Total | 8,152,053      9,362 | 8,161,415 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,637,417      9,996 |11,647,413 
           |     99.88      97.84 |     99.88 
-----------+----------------------+----------
         1 |    13,999        221 |    14,220 
           |      0.12       2.16 |      0.12 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,519,113      9,174 |11,528,287 
                      |     98.86      89.79 |     98.86 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   120,771        704 |   121,475 
                      |      1.04       6.89 |      1.04 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,532        339 |    11,871 
                      |      0.10       3.32 |      0.10 
----------------------+----------------------+----------
                Total |11,651,416     10,217 |11,661,633 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,319,817      6,707 |10,326,524 
           |     88.57      65.65 |     88.55 
-----------+----------------------+----------
         1 | 1,331,599      3,510 | 1,335,109 
           |     11.43      34.35 |     11.45 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,130,980      9,442 |11,140,422 
           |     95.53      92.41 |     95.53 
-----------+----------------------+----------
         1 |   520,436        775 |   521,211 
           |      4.47       7.59 |      4.47 
-----------+----------------------+----------
     Total |11,651,416     10,217 |11,661,633 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,200,677      1,403 | 2,202,080 
                 |     18.89      13.73 |     18.88 
-----------------+----------------------+----------
               2 | 2,325,131      1,676 | 2,326,807 
                 |     19.96      16.40 |     19.95 
-----------------+----------------------+----------
               3 | 2,361,271      1,939 | 2,363,210 
                 |     20.27      18.98 |     20.26 
-----------------+----------------------+----------
               4 | 2,455,639      2,253 | 2,457,892 
                 |     21.08      22.05 |     21.08 
-----------------+----------------------+----------
 5 most deprived | 2,308,698      2,946 | 2,311,644 
                 |     19.81      28.83 |     19.82 
-----------------+----------------------+----------
           Total |11,651,416     10,217 |11,661,633 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,440,413      7,015 | 7,447,428 
                      |     63.86      68.66 |     63.86 
----------------------+----------------------+----------
                Mixed |   153,689         58 |   153,747 
                      |      1.32       0.57 |      1.32 
----------------------+----------------------+----------
Asian or Asian Britis |   811,367        387 |   811,754 
                      |      6.96       3.79 |      6.96 
----------------------+----------------------+----------
                Black |   298,008        214 |   298,222 
                      |      2.56       2.09 |      2.56 
----------------------+----------------------+----------
                Other |   279,900         81 |   279,981 
                      |      2.40       0.79 |      2.40 
----------------------+----------------------+----------
              Unknown | 2,668,039      2,462 | 2,670,501 
                      |     22.90      24.10 |     22.90 
----------------------+----------------------+----------
                Total |11,651,416     10,217 |11,661,633 
                      |    100.00     100.00 |    100.00 
20

**TABLE OF stp non_covid_death REDACTED DUE TO SMALL N**


         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000 
      80   1.4e+06       13              0.0000 
18-<30 male=1 
       0         0        0              0.0000 
      80   1.2e+06       25              0.0000 
30-<40 male=0 
       0         0        0              0.0000 
      80   1.4e+06       48              0.0000 
30-<40 male=1 
       0         0        0              0.0000 
      80   1.3e+06       88              0.0001 
40-<50 male=0 
       0         0        0              0.0000 
      80   1.2e+06       99              0.0001 
40-<50 male=1 
       0         0        0              0.0000 
      80   1.3e+06      230              0.0002 
50-<60 male=0 
       0         0        0              0.0000 
      80   1.3e+06      252              0.0002 
50-<60 male=1 
       0         0        0              0.0000 
      80   1.3e+06      536              0.0004 
60-<70 male=0 
       0         0        0              0.0000 
      80    659451      196              0.0003 
60-<70 male=1 
       0         0        0              0.0000 
      80    647955      432              0.0007 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000 
      80   1.4e+06       22              0.0000 
18-<30 male=1 
       0         0        0              0.0000 
      80   1.2e+06       67              0.0001 
30-<40 male=0 
       0         0        0              0.0000 
      80   1.4e+06      109              0.0001 
30-<40 male=1 
       0         0        0              0.0000 
      80   1.3e+06      134              0.0001 
40-<50 male=0 
       0         0        0              0.0000 
      80   1.2e+06      318              0.0003 
40-<50 male=1 
       0         0        0              0.0000 
      80   1.3e+06      399              0.0003 
50-<60 male=0 
       0         0        0              0.0000 
      80   1.3e+06      827              0.0006 
50-<60 male=1 
       0         0        0              0.0000 
      80   1.3e+06     1156              0.0009 
60-<70 male=0 
       0         0        0              0.0000 
      80    659681      836              0.0013 
60-<70 male=1 
       0         0        0              0.0000 
      80    648176     1239              0.0019 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000 
      80   1.3e+06      945              0.0007 
18-<30 male=1 
       0         0        0              0.0000 
      80   1.2e+06      436              0.0004 
30-<40 male=0 
       0         0        0              0.0000 
      80   1.4e+06     1434              0.0011 
30-<40 male=1 
       0         0        0              0.0000 
      80   1.3e+06      845              0.0006 
40-<50 male=0 
       0         0        0              0.0000 
      80   1.2e+06     1754              0.0014 
40-<50 male=1 
       0         0        0              0.0000 
      80   1.2e+06     1198              0.0010 
50-<60 male=0 
       0         0        0              0.0000 
      80   1.3e+06     2234              0.0017 
50-<60 male=1 
       0         0        0              0.0000 
      80   1.3e+06     1970              0.0015 
60-<70 male=0 
       0         0        0              0.0000 
      80    658263      988              0.0015 
60-<70 male=1 
       0         0        0              0.0000 
      80    644627     1126              0.0017 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  3,473,837    75.53805    7.082125         66        110
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |    793,282       22.84       22.84
     70-<80 |  1,722,685       49.59       72.43
        80+ |    957,870       27.57      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    204,147        5.88        5.88
          1 |  3,269,690       94.12      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,864,886       53.68       53.68
          1 |  1,608,951       46.32      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     59,224        1.87        1.87
  Normal (18.5-24.9) |    989,051       31.16       33.03
Overweight (25-29.9) |  1,238,077       39.01       72.03
   Obese I (30-34.9) |    609,304       19.20       91.23
  Obese II (35-39.9) |    200,506        6.32       97.55
     Obese III (40+) |     77,911        2.45      100.00
---------------------+-----------------------------------
               Total |  3,174,073      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     59,224        1.70        1.70
  Normal (18.5-24.9) |    989,051       28.47       30.18
Overweight (25-29.9) |  1,238,077       35.64       65.82
   Obese I (30-34.9) |    609,304       17.54       83.36
  Obese II (35-39.9) |    200,506        5.77       89.13
     Obese III (40+) |     77,911        2.24       91.37
        Unknown (.u) |    299,764        8.63      100.00
---------------------+-----------------------------------
               Total |  3,473,837      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  2,586,116       74.45       74.45
   Obese I (30-34.9) |    609,304       17.54       91.99
  Obese II (35-39.9) |    200,506        5.77       97.76
     Obese III (40+) |     77,911        2.24      100.00
---------------------+-----------------------------------
               Total |  3,473,837      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,390,831       40.12       40.12
      Former |  1,787,539       51.57       91.69
     Current |    288,122        8.31      100.00
-------------+-----------------------------------
       Total |  3,466,492      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,390,831       40.04       40.04
      Former |  1,787,539       51.46       91.49
     Current |    288,122        8.29       99.79
Unknown (.u) |      7,345        0.21      100.00
-------------+-----------------------------------
       Total |  3,473,837      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    392,830       11.37       11.37
      Elevated |    531,908       15.40       26.78
 High, stage I |  1,268,852       36.74       63.52
High, stage II |  1,259,944       36.48      100.00
---------------+-----------------------------------
         Total |  3,453,534      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    392,830       11.31       11.31
      Elevated |    531,908       15.31       26.62
 High, stage I |  1,268,852       36.53       63.15
High, stage II |  1,259,944       36.27       99.42
       Unknown |     20,303        0.58      100.00
---------------+-----------------------------------
         Total |  3,473,837      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,044,472       30.07       30.07
          1 |  2,429,365       69.93      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,274,124       65.46       65.46
          1 |  1,199,713       34.54      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,061,341       88.13       88.13
          1 |    412,496       11.87      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,021,683       86.98       86.98
          1 |    452,154       13.02      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,747,401       79.09       79.09
          1 |    726,436       20.91      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |  2,692,629       81.26       81.26
  T1DM, controlled |      4,554        0.14       81.39
T1DM, uncontrolled |      9,400        0.28       81.68
  T2DM, controlled |    416,402       12.57       94.24
T2DM, uncontrolled |    188,292        5.68       99.93
Diabetes, no HbA1c |      2,455        0.07      100.00
-------------------+-----------------------------------
             Total |  3,313,732      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  2,975,988       85.67       85.67
    Last year |     41,712        1.20       86.87
2-5 years ago |    123,930        3.57       90.44
     5+ years |    332,207        9.56      100.00
--------------+-----------------------------------
        Total |  3,473,837      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  3,422,524       98.52       98.52
    Last year |      4,947        0.14       98.67
2-5 years ago |     15,321        0.44       99.11
     5+ years |     31,045        0.89      100.00
--------------+-----------------------------------
        Total |  3,473,837      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,467,039       99.80       99.80
          1 |      6,798        0.20      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,472,709       99.97       99.97
          1 |      1,128        0.03      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,465,267       99.75       99.75
          1 |      8,570        0.25      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,441,813       99.08       99.08
          1 |     32,024        0.92      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,405,591       98.04       98.04
          1 |     68,246        1.96      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,216,703       92.60       92.60
          1 |    257,134        7.40      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,084        0.25        0.25
         15 |     47,200        1.43        1.68
         30 |    202,836        6.16        7.84
         45 |    550,902       16.72       24.56
         60 |  2,484,864       75.44      100.00
------------+-----------------------------------
      Total |  3,293,886      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |  2,664,815       76.71       76.71
Stage 3a/3b egfr 30-60       |    753,738       21.70       98.41
           Stage 4/5 egfr<30 |     55,284        1.59      100.00
-----------------------------+-----------------------------------
                       Total |  3,473,837      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,465,239       99.75       99.75
          1 |      8,598        0.25      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,535,426       44.20       44.20
          1 |  1,938,411       55.80      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,208,727       92.37       92.37
          1 |    265,110        7.63      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    858,077       24.70       24.70
               2 |    822,138       23.67       48.37
               3 |    739,038       21.27       69.64
               4 |    607,001       17.47       87.12
 5 most deprived |    447,583       12.88      100.00
-----------------+-----------------------------------
           Total |  3,473,837      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    858,077       24.70       24.70
               2 |    822,138       23.67       48.37
               3 |    739,038       21.27       69.64
               4 |    607,001       17.47       87.12
 5 most deprived |    447,583       12.88      100.00
-----------------+-----------------------------------
           Total |  3,473,837      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,413,995       94.23       94.23
                 Mixed |      9,741        0.38       94.61
Asian or Asian British |     89,804        3.51       98.11
                 Black |     27,178        1.06       99.17
                 Other |     21,139        0.83      100.00
-----------------------+-----------------------------------
                 Total |  2,561,857      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,413,995       69.49       69.49
                 Mixed |      9,741        0.28       69.77
Asian or Asian British |     89,804        2.59       72.36
                 Black |     27,178        0.78       73.14
                 Other |     21,139        0.61       73.75
               Unknown |    911,980       26.25      100.00
-----------------------+-----------------------------------
                 Total |  3,473,837      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        324        0.01        0.01
          2 |    287,115        8.27        8.27
          3 |    155,650        4.48       12.76
          4 |     34,151        0.98       13.74
          5 |     23,652        0.68       14.42
          6 |    161,723        4.66       19.07
          7 |      9,242        0.27       19.34
          8 |    136,488        3.93       23.27
          9 |    128,668        3.70       26.97
         10 |    141,494        4.07       31.05
         11 |    142,247        4.09       35.14
         12 |     38,582        1.11       36.25
         13 |     68,228        1.96       38.22
         14 |     84,619        2.44       40.65
         15 |    111,444        3.21       43.86
         16 |    165,283        4.76       48.62
         17 |    123,044        3.54       52.16
         18 |    124,743        3.59       55.75
         19 |    109,514        3.15       58.90
         20 |    179,602        5.17       64.07
         21 |    133,243        3.84       67.91
         22 |      9,399        0.27       68.18
         23 |    152,044        4.38       72.56
         24 |      8,096        0.23       72.79
         25 |     45,519        1.31       74.10
         26 |    151,616        4.36       78.46
         27 |    146,656        4.22       82.69
         28 |    150,055        4.32       87.01
         29 |     97,424        2.80       89.81
         30 |     80,905        2.33       92.14
         31 |      4,884        0.14       92.28
         32 |    268,183        7.72      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,420,803       98.47       98.47
          1 |     53,034        1.53      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,465,286       99.75       99.75
          1 |      8,551        0.25      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,458,254       99.55       99.55
          1 |     15,583        0.45      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,464,932       99.74       99.74
          1 |      8,905        0.26      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,472,969       99.98       99.98
          1 |        868        0.02      100.00
------------+-----------------------------------
      Total |  3,473,837      100.00
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   791,017      2,265 |   793,282 
           |     22.87      14.54 |     22.84 
-----------+----------------------+----------
    70-<80 | 1,716,683      6,002 | 1,722,685 
           |     49.64      38.52 |     49.59 
-----------+----------------------+----------
       80+ |   950,554      7,316 |   957,870 
           |     27.49      46.95 |     27.57 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,857,240      7,646 | 1,864,886 
           |     53.70      49.07 |     53.68 
-----------+----------------------+----------
         1 | 1,601,014      7,937 | 1,608,951 
           |     46.30      50.93 |     46.32 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    58,632        592 |    59,224 
                     |      1.70       3.80 |      1.70 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   984,570      4,481 |   989,051 
                     |     28.47      28.76 |     28.47 
---------------------+----------------------+----------
Overweight (25-29.9) | 1,233,080      4,997 | 1,238,077 
                     |     35.66      32.07 |     35.64 
---------------------+----------------------+----------
   Obese I (30-34.9) |   606,382      2,922 |   609,304 
                     |     17.53      18.75 |     17.54 
---------------------+----------------------+----------
  Obese II (35-39.9) |   199,406      1,100 |   200,506 
                     |      5.77       7.06 |      5.77 
---------------------+----------------------+----------
     Obese III (40+) |    77,371        540 |    77,911 
                     |      2.24       3.47 |      2.24 
---------------------+----------------------+----------
        Unknown (.u) |   298,813        951 |   299,764 
                     |      8.64       6.10 |      8.63 
---------------------+----------------------+----------
               Total | 3,458,254     15,583 | 3,473,837 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,385,676      5,155 | 1,390,831 
             |     40.07      33.08 |     40.04 
-------------+----------------------+----------
      Former | 1,778,255      9,284 | 1,787,539 
             |     51.42      59.58 |     51.46 
-------------+----------------------+----------
     Current |   286,998      1,124 |   288,122 
             |      8.30       7.21 |      8.29 
-------------+----------------------+----------
Unknown (.u) |     7,325         20 |     7,345 
             |      0.21       0.13 |      0.21 
-------------+----------------------+----------
       Total | 3,458,254     15,583 | 3,473,837 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 2,575,095     11,021 | 2,586,116 
                     |     74.46      70.72 |     74.45 
---------------------+----------------------+----------
   Obese I (30-34.9) |   606,382      2,922 |   609,304 
                     |     17.53      18.75 |     17.54 
---------------------+----------------------+----------
  Obese II (35-39.9) |   199,406      1,100 |   200,506 
                     |      5.77       7.06 |      5.77 
---------------------+----------------------+----------
     Obese III (40+) |    77,371        540 |    77,911 
                     |      2.24       3.47 |      2.24 
---------------------+----------------------+----------
               Total | 3,458,254     15,583 | 3,473,837 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,266,650      7,474 | 2,274,124 
           |     65.54      47.96 |     65.46 
-----------+----------------------+----------
         1 | 1,191,604      8,109 | 1,199,713 
           |     34.46      52.04 |     34.54 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,049,633     11,708 | 3,061,341 
           |     88.18      75.13 |     88.13 
-----------+----------------------+----------
         1 |   408,621      3,875 |   412,496 
           |     11.82      24.87 |     11.87 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,008,819     12,864 | 3,021,683 
           |     87.00      82.55 |     86.98 
-----------+----------------------+----------
         1 |   449,435      2,719 |   452,154 
           |     13.00      17.45 |     13.02 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,737,629      9,772 | 2,747,401 
           |     79.16      62.71 |     79.09 
-----------+----------------------+----------
         1 |   720,625      5,811 |   726,436 
           |     20.84      37.29 |     20.91 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: covid prob
                   |         case
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,682,678      9,951 | 2,692,629 
                   |     81.32      67.54 |     81.26 
-------------------+----------------------+----------
  T1DM, controlled |     4,516         38 |     4,554 
                   |      0.14       0.26 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |     9,305         95 |     9,400 
                   |      0.28       0.64 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   413,395      3,007 |   416,402 
                   |     12.53      20.41 |     12.57 
-------------------+----------------------+----------
T2DM, uncontrolled |   186,676      1,616 |   188,292 
                   |      5.66      10.97 |      5.68 
-------------------+----------------------+----------
Diabetes, no HbA1c |     2,429         26 |     2,455 
                   |      0.07       0.18 |      0.07 
-------------------+----------------------+----------
             Total | 3,298,999     14,733 | 3,313,732 
                   |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,963,307     12,681 | 2,975,988 
              |     85.69      81.38 |     85.67 
--------------+----------------------+----------
    Last year |    41,376        336 |    41,712 
              |      1.20       2.16 |      1.20 
--------------+----------------------+----------
2-5 years ago |   123,227        703 |   123,930 
              |      3.56       4.51 |      3.57 
--------------+----------------------+----------
     5+ years |   330,344      1,863 |   332,207 
              |      9.55      11.96 |      9.56 
--------------+----------------------+----------
        Total | 3,458,254     15,583 | 3,473,837 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 3,407,450     15,074 | 3,422,524 
              |     98.53      96.73 |     98.52 
--------------+----------------------+----------
    Last year |     4,866         81 |     4,947 
              |      0.14       0.52 |      0.14 
--------------+----------------------+----------
2-5 years ago |    15,163        158 |    15,321 
              |      0.44       1.01 |      0.44 
--------------+----------------------+----------
     5+ years |    30,775        270 |    31,045 
              |      0.89       1.73 |      0.89 
--------------+----------------------+----------
        Total | 3,458,254     15,583 | 3,473,837 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,451,523     15,516 | 3,467,039 
           |     99.81      99.57 |     99.80 
-----------+----------------------+----------
         1 |     6,731         67 |     6,798 
           |      0.19       0.43 |      0.20 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,457,143     15,566 | 3,472,709 
           |     99.97      99.89 |     99.97 
-----------+----------------------+----------
         1 |     1,111         17 |     1,128 
           |      0.03       0.11 |      0.03 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,449,743     15,524 | 3,465,267 
           |     99.75      99.62 |     99.75 
-----------+----------------------+----------
         1 |     8,511         59 |     8,570 
           |      0.25       0.38 |      0.25 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,426,517     15,296 | 3,441,813 
           |     99.08      98.16 |     99.08 
-----------+----------------------+----------
         1 |    31,737        287 |    32,024 
           |      0.92       1.84 |      0.92 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,390,752     14,839 | 3,405,591 
           |     98.05      95.23 |     98.04 
-----------+----------------------+----------
         1 |    67,502        744 |    68,246 
           |      1.95       4.77 |      1.96 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,203,814     12,889 | 3,216,703 
           |     92.64      82.71 |     92.60 
-----------+----------------------+----------
         1 |   254,440      2,694 |   257,134 
           |      7.36      17.29 |      7.40 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,835        249 |     8,084 
           |      0.24       1.64 |      0.25 
-----------+----------------------+----------
        15 |    46,560        640 |    47,200 
           |      1.42       4.23 |      1.43 
-----------+----------------------+----------
        30 |   200,987      1,849 |   202,836 
           |      6.13      12.21 |      6.16 
-----------+----------------------+----------
        45 |   547,779      3,123 |   550,902 
           |     16.71      20.63 |     16.72 
-----------+----------------------+----------
        60 | 2,475,587      9,277 | 2,484,864 
           |     75.50      61.28 |     75.44 
-----------+----------------------+----------
     Total | 3,278,748     15,138 | 3,293,886 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,449,904     15,335 | 3,465,239 
           |     99.76      98.41 |     99.75 
-----------+----------------------+----------
         1 |     8,350        248 |     8,598 
           |      0.24       1.59 |      0.25 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,655,093      9,722 | 2,664,815 
                      |     76.78      62.39 |     76.71 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   748,766      4,972 |   753,738 
                      |     21.65      31.91 |     21.70 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    54,395        889 |    55,284 
                      |      1.57       5.70 |      1.59 
----------------------+----------------------+----------
                Total | 3,458,254     15,583 | 3,473,837 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,530,380      5,046 | 1,535,426 
           |     44.25      32.38 |     44.20 
-----------+----------------------+----------
         1 | 1,927,874     10,537 | 1,938,411 
           |     55.75      67.62 |     55.80 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,194,798     13,929 | 3,208,727 
           |     92.38      89.39 |     92.37 
-----------+----------------------+----------
         1 |   263,456      1,654 |   265,110 
           |      7.62      10.61 |      7.63 
-----------+----------------------+----------
     Total | 3,458,254     15,583 | 3,473,837 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   855,093      2,984 |   858,077 
                 |     24.73      19.15 |     24.70 
-----------------+----------------------+----------
               2 |   818,891      3,247 |   822,138 
                 |     23.68      20.84 |     23.67 
-----------------+----------------------+----------
               3 |   735,929      3,109 |   739,038 
                 |     21.28      19.95 |     21.27 
-----------------+----------------------+----------
               4 |   603,733      3,268 |   607,001 
                 |     17.46      20.97 |     17.47 
-----------------+----------------------+----------
 5 most deprived |   444,608      2,975 |   447,583 
                 |     12.86      19.09 |     12.88 
-----------------+----------------------+----------
           Total | 3,458,254     15,583 | 3,473,837 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,403,524     10,471 | 2,413,995 
                      |     69.50      67.20 |     69.49 
----------------------+----------------------+----------
                Mixed |     9,687         54 |     9,741 
                      |      0.28       0.35 |      0.28 
----------------------+----------------------+----------
Asian or Asian Britis |    89,028        776 |    89,804 
                      |      2.57       4.98 |      2.59 
----------------------+----------------------+----------
                Black |    26,954        224 |    27,178 
                      |      0.78       1.44 |      0.78 
----------------------+----------------------+----------
                Other |    21,029        110 |    21,139 
                      |      0.61       0.71 |      0.61 
----------------------+----------------------+----------
              Unknown |   908,032      3,948 |   911,980 
                      |     26.26      25.34 |     26.25 
----------------------+----------------------+----------
                Total | 3,458,254     15,583 | 3,473,837 
                      |    100.00     100.00 |    100.00 
19

**TABLE OF stp covid_tpp_prob REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |       icu/death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   792,565        717 |   793,282 
           |     22.87       8.05 |     22.84 
-----------+----------------------+----------
    70-<80 | 1,719,932      2,753 | 1,722,685 
           |     49.64      30.92 |     49.59 
-----------+----------------------+----------
       80+ |   952,435      5,435 |   957,870 
           |     27.49      61.03 |     27.57 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,861,269      3,617 | 1,864,886 
           |     53.72      40.62 |     53.68 
-----------+----------------------+----------
         1 | 1,603,663      5,288 | 1,608,951 
           |     46.28      59.38 |     46.32 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |       icu/death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    58,873        351 |    59,224 
                     |      1.70       3.94 |      1.70 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   986,422      2,629 |   989,051 
                     |     28.47      29.52 |     28.47 
---------------------+----------------------+----------
Overweight (25-29.9) | 1,235,418      2,659 | 1,238,077 
                     |     35.65      29.86 |     35.64 
---------------------+----------------------+----------
   Obese I (30-34.9) |   607,714      1,590 |   609,304 
                     |     17.54      17.86 |     17.54 
---------------------+----------------------+----------
  Obese II (35-39.9) |   199,854        652 |   200,506 
                     |      5.77       7.32 |      5.77 
---------------------+----------------------+----------
     Obese III (40+) |    77,616        295 |    77,911 
                     |      2.24       3.31 |      2.24 
---------------------+----------------------+----------
        Unknown (.u) |   299,035        729 |   299,764 
                     |      8.63       8.19 |      8.63 
---------------------+----------------------+----------
               Total | 3,464,932      8,905 | 3,473,837 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |       icu/death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,388,158      2,673 | 1,390,831 
             |     40.06      30.02 |     40.04 
-------------+----------------------+----------
      Former | 1,781,911      5,628 | 1,787,539 
             |     51.43      63.20 |     51.46 
-------------+----------------------+----------
     Current |   287,533        589 |   288,122 
             |      8.30       6.61 |      8.29 
-------------+----------------------+----------
Unknown (.u) |     7,330         15 |     7,345 
             |      0.21       0.17 |      0.21 
-------------+----------------------+----------
       Total | 3,464,932      8,905 | 3,473,837 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |       icu/death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 2,579,748      6,368 | 2,586,116 
                     |     74.45      71.51 |     74.45 
---------------------+----------------------+----------
   Obese I (30-34.9) |   607,714      1,590 |   609,304 
                     |     17.54      17.86 |     17.54 
---------------------+----------------------+----------
  Obese II (35-39.9) |   199,854        652 |   200,506 
                     |      5.77       7.32 |      5.77 
---------------------+----------------------+----------
     Obese III (40+) |    77,616        295 |    77,911 
                     |      2.24       3.31 |      2.24 
---------------------+----------------------+----------
               Total | 3,464,932      8,905 | 3,473,837 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |       icu/death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,269,733      4,391 | 2,274,124 
           |     65.51      49.31 |     65.46 
-----------+----------------------+----------
         1 | 1,195,199      4,514 | 1,199,713 
           |     34.49      50.69 |     34.54 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |       icu/death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,054,621      6,720 | 3,061,341 
           |     88.16      75.46 |     88.13 
-----------+----------------------+----------
         1 |   410,311      2,185 |   412,496 
           |     11.84      24.54 |     11.87 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |       icu/death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,014,131      7,552 | 3,021,683 
           |     86.99      84.81 |     86.98 
-----------+----------------------+----------
         1 |   450,801      1,353 |   452,154 
           |     13.01      15.19 |     13.02 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |       icu/death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,742,187      5,214 | 2,747,401 
           |     79.14      58.55 |     79.09 
-----------+----------------------+----------
         1 |   722,745      3,691 |   726,436 
           |     20.86      41.45 |     20.91 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |    outcome: covid
                   |       icu/death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,687,217      5,412 | 2,692,629 
                   |     81.30      64.16 |     81.26 
-------------------+----------------------+----------
  T1DM, controlled |     4,532         22 |     4,554 
                   |      0.14       0.26 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |     9,333         67 |     9,400 
                   |      0.28       0.79 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   414,572      1,830 |   416,402 
                   |     12.54      21.70 |     12.57 
-------------------+----------------------+----------
T2DM, uncontrolled |   187,206      1,086 |   188,292 
                   |      5.66      12.87 |      5.68 
-------------------+----------------------+----------
Diabetes, no HbA1c |     2,437         18 |     2,455 
                   |      0.07       0.21 |      0.07 
-------------------+----------------------+----------
             Total | 3,305,297      8,435 | 3,313,732 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |       icu/death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,968,801      7,187 | 2,975,988 
              |     85.68      80.71 |     85.67 
--------------+----------------------+----------
    Last year |    41,476        236 |    41,712 
              |      1.20       2.65 |      1.20 
--------------+----------------------+----------
2-5 years ago |   123,519        411 |   123,930 
              |      3.56       4.62 |      3.57 
--------------+----------------------+----------
     5+ years |   331,136      1,071 |   332,207 
              |      9.56      12.03 |      9.56 
--------------+----------------------+----------
        Total | 3,464,932      8,905 | 3,473,837 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |       icu/death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 3,413,930      8,594 | 3,422,524 
              |     98.53      96.51 |     98.52 
--------------+----------------------+----------
    Last year |     4,899         48 |     4,947 
              |      0.14       0.54 |      0.14 
--------------+----------------------+----------
2-5 years ago |    15,211        110 |    15,321 
              |      0.44       1.24 |      0.44 
--------------+----------------------+----------
     5+ years |    30,892        153 |    31,045 
              |      0.89       1.72 |      0.89 
--------------+----------------------+----------
        Total | 3,464,932      8,905 | 3,473,837 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |       icu/death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,458,170      8,869 | 3,467,039 
           |     99.80      99.60 |     99.80 
-----------+----------------------+----------
         1 |     6,762         36 |     6,798 
           |      0.20       0.40 |      0.20 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |    outcome: covid
     organ |       icu/death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,463,815      8,894 | 3,472,709 
           |     99.97      99.88 |     99.97 
-----------+----------------------+----------
         1 |     1,117         11 |     1,128 
           |      0.03       0.12 |      0.03 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,456,389      8,878 | 3,465,267 
           |     99.75      99.70 |     99.75 
-----------+----------------------+----------
         1 |     8,543         27 |     8,570 
           |      0.25       0.30 |      0.25 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,433,077      8,736 | 3,441,813 
           |     99.08      98.10 |     99.08 
-----------+----------------------+----------
         1 |    31,855        169 |    32,024 
           |      0.92       1.90 |      0.92 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |       icu/death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,397,200      8,391 | 3,405,591 
           |     98.05      94.23 |     98.04 
-----------+----------------------+----------
         1 |    67,732        514 |    68,246 
           |      1.95       5.77 |      1.96 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |       icu/death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,209,592      7,111 | 3,216,703 
           |     92.63      79.85 |     92.60 
-----------+----------------------+----------
         1 |   255,340      1,794 |   257,134 
           |      7.37      20.15 |      7.40 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |       icu/death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,884        200 |     8,084 
           |      0.24       2.30 |      0.25 
-----------+----------------------+----------
        15 |    46,604        596 |    47,200 
           |      1.42       6.85 |      1.43 
-----------+----------------------+----------
        30 |   201,399      1,437 |   202,836 
           |      6.13      16.52 |      6.16 
-----------+----------------------+----------
        45 |   548,910      1,992 |   550,902 
           |     16.71      22.91 |     16.72 
-----------+----------------------+----------
        60 | 2,480,393      4,471 | 2,484,864 
           |     75.50      51.41 |     75.44 
-----------+----------------------+----------
     Total | 3,285,190      8,696 | 3,293,886 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |    outcome: covid
     renal |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,456,496      8,743 | 3,465,239 
           |     99.76      98.18 |     99.75 
-----------+----------------------+----------
         1 |     8,436        162 |     8,598 
           |      0.24       1.82 |      0.25 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |       icu/death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,660,135      4,680 | 2,664,815 
                      |     76.77      52.55 |     76.71 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   750,309      3,429 |   753,738 
                      |     21.65      38.51 |     21.70 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    54,488        796 |    55,284 
                      |      1.57       8.94 |      1.59 
----------------------+----------------------+----------
                Total | 3,464,932      8,905 | 3,473,837 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |       icu/death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,532,774      2,652 | 1,535,426 
           |     44.24      29.78 |     44.20 
-----------+----------------------+----------
         1 | 1,932,158      6,253 | 1,938,411 
           |     55.76      70.22 |     55.80 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,200,691      8,036 | 3,208,727 
           |     92.37      90.24 |     92.37 
-----------+----------------------+----------
         1 |   264,241        869 |   265,110 
           |      7.63       9.76 |      7.63 
-----------+----------------------+----------
     Total | 3,464,932      8,905 | 3,473,837 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |       icu/death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   856,410      1,667 |   858,077 
                 |     24.72      18.72 |     24.70 
-----------------+----------------------+----------
               2 |   820,352      1,786 |   822,138 
                 |     23.68      20.06 |     23.67 
-----------------+----------------------+----------
               3 |   737,226      1,812 |   739,038 
                 |     21.28      20.35 |     21.27 
-----------------+----------------------+----------
               4 |   605,158      1,843 |   607,001 
                 |     17.47      20.70 |     17.47 
-----------------+----------------------+----------
 5 most deprived |   445,786      1,797 |   447,583 
                 |     12.87      20.18 |     12.88 
-----------------+----------------------+----------
           Total | 3,464,932      8,905 | 3,473,837 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |       icu/death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,408,091      5,904 | 2,413,995 
                      |     69.50      66.30 |     69.49 
----------------------+----------------------+----------
                Mixed |     9,705         36 |     9,741 
                      |      0.28       0.40 |      0.28 
----------------------+----------------------+----------
Asian or Asian Britis |    89,333        471 |    89,804 
                      |      2.58       5.29 |      2.59 
----------------------+----------------------+----------
                Black |    27,027        151 |    27,178 
                      |      0.78       1.70 |      0.78 
----------------------+----------------------+----------
                Other |    21,075         64 |    21,139 
                      |      0.61       0.72 |      0.61 
----------------------+----------------------+----------
              Unknown |   909,701      2,279 |   911,980 
                      |     26.25      25.59 |     26.25 
----------------------+----------------------+----------
                Total | 3,464,932      8,905 | 3,473,837 
                      |    100.00     100.00 |    100.00 
20

**TABLE OF stp covid_death_icu REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   789,337      3,945 |   793,282 
           |     23.07       7.44 |     22.84 
-----------+----------------------+----------
    70-<80 | 1,706,381     16,304 | 1,722,685 
           |     49.88      30.74 |     49.59 
-----------+----------------------+----------
       80+ |   925,085     32,785 |   957,870 
           |     27.04      61.82 |     27.57 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,839,009     25,877 | 1,864,886 
           |     53.76      48.79 |     53.68 
-----------+----------------------+----------
         1 | 1,581,794     27,157 | 1,608,951 
           |     46.24      51.21 |     46.32 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    55,802      3,422 |    59,224 
                     |      1.63       6.45 |      1.70 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   969,821     19,230 |   989,051 
                     |     28.35      36.26 |     28.47 
---------------------+----------------------+----------
Overweight (25-29.9) | 1,223,341     14,736 | 1,238,077 
                     |     35.76      27.79 |     35.64 
---------------------+----------------------+----------
   Obese I (30-34.9) |   602,433      6,871 |   609,304 
                     |     17.61      12.96 |     17.54 
---------------------+----------------------+----------
  Obese II (35-39.9) |   198,005      2,501 |   200,506 
                     |      5.79       4.72 |      5.77 
---------------------+----------------------+----------
     Obese III (40+) |    76,771      1,140 |    77,911 
                     |      2.24       2.15 |      2.24 
---------------------+----------------------+----------
        Unknown (.u) |   294,630      5,134 |   299,764 
                     |      8.61       9.68 |      8.63 
---------------------+----------------------+----------
               Total | 3,420,803     53,034 | 3,473,837 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,374,473     16,358 | 1,390,831 
             |     40.18      30.84 |     40.04 
-------------+----------------------+----------
      Former | 1,756,914     30,625 | 1,787,539 
             |     51.36      57.75 |     51.46 
-------------+----------------------+----------
     Current |   282,135      5,987 |   288,122 
             |      8.25      11.29 |      8.29 
-------------+----------------------+----------
Unknown (.u) |     7,281         64 |     7,345 
             |      0.21       0.12 |      0.21 
-------------+----------------------+----------
       Total | 3,420,803     53,034 | 3,473,837 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 2,543,594     42,522 | 2,586,116 
                     |     74.36      80.18 |     74.45 
---------------------+----------------------+----------
   Obese I (30-34.9) |   602,433      6,871 |   609,304 
                     |     17.61      12.96 |     17.54 
---------------------+----------------------+----------
  Obese II (35-39.9) |   198,005      2,501 |   200,506 
                     |      5.79       4.72 |      5.77 
---------------------+----------------------+----------
     Obese III (40+) |    76,771      1,140 |    77,911 
                     |      2.24       2.15 |      2.24 
---------------------+----------------------+----------
               Total | 3,420,803     53,034 | 3,473,837 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,253,989     20,135 | 2,274,124 
           |     65.89      37.97 |     65.46 
-----------+----------------------+----------
         1 | 1,166,814     32,899 | 1,199,713 
           |     34.11      62.03 |     34.54 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,021,709     39,632 | 3,061,341 
           |     88.33      74.73 |     88.13 
-----------+----------------------+----------
         1 |   399,094     13,402 |   412,496 
           |     11.67      25.27 |     11.87 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,975,454     46,229 | 3,021,683 
           |     86.98      87.17 |     86.98 
-----------+----------------------+----------
         1 |   445,349      6,805 |   452,154 
           |     13.02      12.83 |     13.02 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,716,500     30,901 | 2,747,401 
           |     79.41      58.27 |     79.09 
-----------+----------------------+----------
         1 |   704,303     22,133 |   726,436 
           |     20.59      41.73 |     20.91 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: non-covid
                   |         death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,656,360     36,269 | 2,692,629 
                   |     81.41      71.68 |     81.26 
-------------------+----------------------+----------
  T1DM, controlled |     4,420        134 |     4,554 
                   |      0.14       0.26 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |     9,108        292 |     9,400 
                   |      0.28       0.58 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   406,997      9,405 |   416,402 
                   |     12.47      18.59 |     12.57 
-------------------+----------------------+----------
T2DM, uncontrolled |   183,873      4,419 |   188,292 
                   |      5.63       8.73 |      5.68 
-------------------+----------------------+----------
Diabetes, no HbA1c |     2,377         78 |     2,455 
                   |      0.07       0.15 |      0.07 
-------------------+----------------------+----------
             Total | 3,263,135     50,597 | 3,313,732 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,940,045     35,943 | 2,975,988 
              |     85.95      67.77 |     85.67 
--------------+----------------------+----------
    Last year |    37,483      4,229 |    41,712 
              |      1.10       7.97 |      1.20 
--------------+----------------------+----------
2-5 years ago |   119,076      4,854 |   123,930 
              |      3.48       9.15 |      3.57 
--------------+----------------------+----------
     5+ years |   324,199      8,008 |   332,207 
              |      9.48      15.10 |      9.56 
--------------+----------------------+----------
        Total | 3,420,803     53,034 | 3,473,837 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 3,371,607     50,917 | 3,422,524 
              |     98.56      96.01 |     98.52 
--------------+----------------------+----------
    Last year |     4,525        422 |     4,947 
              |      0.13       0.80 |      0.14 
--------------+----------------------+----------
2-5 years ago |    14,637        684 |    15,321 
              |      0.43       1.29 |      0.44 
--------------+----------------------+----------
     5+ years |    30,034      1,011 |    31,045 
              |      0.88       1.91 |      0.89 
--------------+----------------------+----------
        Total | 3,420,803     53,034 | 3,473,837 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,414,255     52,784 | 3,467,039 
           |     99.81      99.53 |     99.80 
-----------+----------------------+----------
         1 |     6,548        250 |     6,798 
           |      0.19       0.47 |      0.20 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,419,713     52,996 | 3,472,709 
           |     99.97      99.93 |     99.97 
-----------+----------------------+----------
         1 |     1,090         38 |     1,128 
           |      0.03       0.07 |      0.03 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,412,473     52,794 | 3,465,267 
           |     99.76      99.55 |     99.75 
-----------+----------------------+----------
         1 |     8,330        240 |     8,570 
           |      0.24       0.45 |      0.25 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,390,047     51,766 | 3,441,813 
           |     99.10      97.61 |     99.08 
-----------+----------------------+----------
         1 |    30,756      1,268 |    32,024 
           |      0.90       2.39 |      0.92 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,355,112     50,479 | 3,405,591 
           |     98.08      95.18 |     98.04 
-----------+----------------------+----------
         1 |    65,691      2,555 |    68,246 
           |      1.92       4.82 |      1.96 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,174,064     42,639 | 3,216,703 
           |     92.79      80.40 |     92.60 
-----------+----------------------+----------
         1 |   246,739     10,395 |   257,134 
           |      7.21      19.60 |      7.40 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,123        961 |     8,084 
           |      0.22       1.87 |      0.25 
-----------+----------------------+----------
        15 |    43,584      3,616 |    47,200 
           |      1.34       7.02 |      1.43 
-----------+----------------------+----------
        30 |   194,687      8,149 |   202,836 
           |      6.00      15.82 |      6.16 
-----------+----------------------+----------
        45 |   539,734     11,168 |   550,902 
           |     16.65      21.68 |     16.72 
-----------+----------------------+----------
        60 | 2,457,251     27,613 | 2,484,864 
           |     75.79      53.61 |     75.44 
-----------+----------------------+----------
     Total | 3,242,379     51,507 | 3,293,886 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,412,801     52,438 | 3,465,239 
           |     99.77      98.88 |     99.75 
-----------+----------------------+----------
         1 |     8,002        596 |     8,598 
           |      0.23       1.12 |      0.25 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,635,675     29,140 | 2,664,815 
                      |     77.05      54.95 |     76.71 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   734,421     19,317 |   753,738 
                      |     21.47      36.42 |     21.70 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    50,707      4,577 |    55,284 
                      |      1.48       8.63 |      1.59 
----------------------+----------------------+----------
                Total | 3,420,803     53,034 | 3,473,837 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,518,763     16,663 | 1,535,426 
           |     44.40      31.42 |     44.20 
-----------+----------------------+----------
         1 | 1,902,040     36,371 | 1,938,411 
           |     55.60      68.58 |     55.80 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,160,466     48,261 | 3,208,727 
           |     92.39      91.00 |     92.37 
-----------+----------------------+----------
         1 |   260,337      4,773 |   265,110 
           |      7.61       9.00 |      7.63 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   847,227     10,850 |   858,077 
                 |     24.77      20.46 |     24.70 
-----------------+----------------------+----------
               2 |   810,570     11,568 |   822,138 
                 |     23.70      21.81 |     23.67 
-----------------+----------------------+----------
               3 |   727,777     11,261 |   739,038 
                 |     21.28      21.23 |     21.27 
-----------------+----------------------+----------
               4 |   596,701     10,300 |   607,001 
                 |     17.44      19.42 |     17.47 
-----------------+----------------------+----------
 5 most deprived |   438,528      9,055 |   447,583 
                 |     12.82      17.07 |     12.88 
-----------------+----------------------+----------
           Total | 3,420,803     53,034 | 3,473,837 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,378,392     35,603 | 2,413,995 
                      |     69.53      67.13 |     69.49 
----------------------+----------------------+----------
                Mixed |     9,627        114 |     9,741 
                      |      0.28       0.21 |      0.28 
----------------------+----------------------+----------
Asian or Asian Britis |    88,648      1,156 |    89,804 
                      |      2.59       2.18 |      2.59 
----------------------+----------------------+----------
                Black |    26,814        364 |    27,178 
                      |      0.78       0.69 |      0.78 
----------------------+----------------------+----------
                Other |    20,947        192 |    21,139 
                      |      0.61       0.36 |      0.61 
----------------------+----------------------+----------
              Unknown |   896,375     15,605 |   911,980 
                      |     26.20      29.42 |     26.25 
----------------------+----------------------+----------
                Total | 3,420,803     53,034 | 3,473,837 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       318          6 |       324 
           |      0.01       0.01 |      0.01 
-----------+----------------------+----------
         2 |   282,503      4,612 |   287,115 
           |      8.26       8.70 |      8.27 
-----------+----------------------+----------
         3 |   153,173      2,477 |   155,650 
           |      4.48       4.67 |      4.48 
-----------+----------------------+----------
         4 |    33,605        546 |    34,151 
           |      0.98       1.03 |      0.98 
-----------+----------------------+----------
         5 |    23,287        365 |    23,652 
           |      0.68       0.69 |      0.68 
-----------+----------------------+----------
         6 |   159,115      2,608 |   161,723 
           |      4.65       4.92 |      4.66 
-----------+----------------------+----------
         7 |     9,063        179 |     9,242 
           |      0.26       0.34 |      0.27 
-----------+----------------------+----------
         8 |   134,381      2,107 |   136,488 
           |      3.93       3.97 |      3.93 
-----------+----------------------+----------
         9 |   126,591      2,077 |   128,668 
           |      3.70       3.92 |      3.70 
-----------+----------------------+----------
        10 |   139,259      2,235 |   141,494 
           |      4.07       4.21 |      4.07 
-----------+----------------------+----------
        11 |   140,084      2,163 |   142,247 
           |      4.10       4.08 |      4.09 
-----------+----------------------+----------
        12 |    37,837        745 |    38,582 
           |      1.11       1.40 |      1.11 
-----------+----------------------+----------
        13 |    67,128      1,100 |    68,228 
           |      1.96       2.07 |      1.96 
-----------+----------------------+----------
        14 |    83,371      1,248 |    84,619 
           |      2.44       2.35 |      2.44 
-----------+----------------------+----------
        15 |   109,885      1,559 |   111,444 
           |      3.21       2.94 |      3.21 
-----------+----------------------+----------
        16 |   162,715      2,568 |   165,283 
           |      4.76       4.84 |      4.76 
-----------+----------------------+----------
        17 |   121,212      1,832 |   123,044 
           |      3.54       3.45 |      3.54 
-----------+----------------------+----------
        18 |   122,941      1,802 |   124,743 
           |      3.59       3.40 |      3.59 
-----------+----------------------+----------
        19 |   107,731      1,783 |   109,514 
           |      3.15       3.36 |      3.15 
-----------+----------------------+----------
        20 |   176,875      2,727 |   179,602 
           |      5.17       5.14 |      5.17 
-----------+----------------------+----------
        21 |   131,481      1,762 |   133,243 
           |      3.84       3.32 |      3.84 
-----------+----------------------+----------
        22 |     9,268        131 |     9,399 
           |      0.27       0.25 |      0.27 
-----------+----------------------+----------
        23 |   149,828      2,216 |   152,044 
           |      4.38       4.18 |      4.38 
-----------+----------------------+----------
        24 |     7,973        123 |     8,096 
           |      0.23       0.23 |      0.23 
-----------+----------------------+----------
        25 |    44,930        589 |    45,519 
           |      1.31       1.11 |      1.31 
-----------+----------------------+----------
        26 |   149,432      2,184 |   151,616 
           |      4.37       4.12 |      4.36 
-----------+----------------------+----------
        27 |   144,425      2,231 |   146,656 
           |      4.22       4.21 |      4.22 
-----------+----------------------+----------
        28 |   147,844      2,211 |   150,055 
           |      4.32       4.17 |      4.32 
-----------+----------------------+----------
        29 |    95,947      1,477 |    97,424 
           |      2.80       2.79 |      2.80 
-----------+----------------------+----------
        30 |    79,779      1,126 |    80,905 
           |      2.33       2.12 |      2.33 
-----------+----------------------+----------
        31 |     4,824         60 |     4,884 
           |      0.14       0.11 |      0.14 
-----------+----------------------+----------
        32 |   263,998      4,185 |   268,183 
           |      7.72       7.89 |      7.72 
-----------+----------------------+----------
     Total | 3,420,803     53,034 | 3,473,837 
           |    100.00     100.00 |    100.00 

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000 
      80    405102      154              0.0004 
60-<70 male=1 
       0         0        0              0.0000 
      80    383028      314              0.0008 
70-<80 male=0 
       0         0        0              0.0000 
      80    895536      560              0.0006 
70-<80 male=1 
       0         0        0              0.0000 
      80    814768     1125              0.0014 
80+ male=0 
       0         0        0              0.0000 
      80    542176     1148              0.0021 
80+ male=1 
       0         0        0              0.0000 
      80    401027     1658              0.0041 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000 
      80    405154      732              0.0018 
60-<70 male=1 
       0         0        0              0.0000 
      80    382877     1174              0.0031 
70-<80 male=0 
       0         0        0              0.0000 
      80    895544     3409              0.0038 
70-<80 male=1 
       0         0        0              0.0000 
      80    815193     4534              0.0055 
80+ male=0 
       0         0        0              0.0000 
      80    543009     8520              0.0154 
80+ male=1 
       0         0        0              0.0000 
      80    400030     7893              0.0193 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000 
      80    404421      581              0.0014 
60-<70 male=1 
       0         0        0              0.0000 
      80    382190      689              0.0018 
70-<80 male=0 
       0         0        0              0.0000 
      80    892318     1577              0.0018 
70-<80 male=1 
       0         0        0              0.0000 
      80    810718     1989              0.0024 
80+ male=0 
       0         0        0              0.0000 
      80    537757     2137              0.0039 
80+ male=1 
       0         0        0              0.0000 
      80    400593     2146              0.0053 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\04a_an_descriptive_tables.log
  log type:  text
 closed on:  22 Aug 2020, 13:22:48
----------------------------------------------------------------------------------------------------------------------------------
