----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07a_an_multivariable_cox_models_non_covid_death.log
  log type:  text
 opened on:  22 Aug 2020, 13:08:19

. 
. 
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure'                                      ///
>                         `demogadjlist'                                  ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  4. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
. }
  9. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 10. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 11. if _rc==0{
 12. estimates
 13. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_ageband_`x', replace
 14. *estat concordance /*c-statistic*/
.  }
 15.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 16. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.bmicat) smoking(i.smoke)
 17. if _rc==0{
 18. estimates
 19. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_bmi_smok_ageband_`x', replace
 20. *estat concordance /*c-statistic*/
.  }
 21.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 22.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.bmicat) smoking(i.smoke)
 23. if _rc==0{
 24. estimates
 25. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCnoeth_bmi_smok_ageband_`x', replace
 26. *estat concordance /*c-statistic*/
.  }
 27.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 28.  
. }
 29. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 30. foreach exposure_type in kids_cat3   {
 31. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 32. if _rc==0{
 33. estimates
 34. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo_ageband_`x', replace
 35. *estat concordance /*c-statistic*/
. }
 36. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
 37. 
. 
. }       
 38. 
. }       
   1:     75.49 /        1 =      75.4920

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,483             Number of obs    =     359,905
No. of failures      =       10,217
Time at risk         =   2145469056
                                                Wald chi2(2)     =     1000.01
Log pseudolikelihood =    -132594.4             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 353,434 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .2588036   .0126362   -27.68   0.000     .2351852    .2847939
Kids under 18  |   .4335085   .0219341   -16.52   0.000     .3925813    .4787024
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_ageband_0.ster saved
   1:     43.60 /        1 =      43.6040

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,483             Number of obs    =     359,905
No. of failures      =       10,217
Time at risk         =   2145469056
                                                Wald chi2(2)     =     1000.01
Log pseudolikelihood =    -132594.4             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 353,434 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .2588036   .0126362   -27.68   0.000     .2351852    .2847939
Kids under 18  |   .4335085   .0219341   -16.52   0.000     .3925813    .4787024
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_ageband_0.ster saved
   1:     36.34 /        1 =      36.3360

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,483             Number of obs    =     359,905
No. of failures      =       10,217
Time at risk         =   2145469056
                                                Wald chi2(2)     =     1000.01
Log pseudolikelihood =    -132594.4             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 353,434 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .2588036   .0126362   -27.68   0.000     .2351852    .2847939
Kids under 18  |   .4335085   .0219341   -16.52   0.000     .3925813    .4787024
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster saved
   1:     29.34 /        1 =      29.3420

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,483             Number of obs    =     359,905
No. of failures      =       10,217
Time at risk         =   2145469056
                                                Wald chi2(2)     =     1000.01
Log pseudolikelihood =    -132594.4             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 353,434 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .2588036   .0126362   -27.68   0.000     .2351852    .2847939
Kids under 18  |   .4335085   .0219341   -16.52   0.000     .3925813    .4787024
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster saved
   1:     36.70 /        1 =      36.6950

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,483             Number of obs    =     359,905
No. of failures      =       10,217
Time at risk         =   2145469056
                                                Wald chi2(4)     =      999.08
Log pseudolikelihood =   -132592.63             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 353,434 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .4335053   .0219339   -16.52   0.000     .3925784    .4786988
    1 child <12  |   .2698571   .0143251   -24.68   0.000     .2431917    .2994463
 2 children <12  |   .2131449   .0270381   -12.19   0.000     .1662254    .2733081
3+ children <12  |   .2115521   .0751198    -4.37   0.000     .1054788    .4242965
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth_ageband_0.ster saved
   1:     35.26 /        1 =      35.2580

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,483             Number of obs    =     359,905
No. of failures      =       10,217
Time at risk         =   2145469056
                                                Wald chi2(4)     =      999.08
Log pseudolikelihood =   -132592.63             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 353,434 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .4335053   .0219339   -16.52   0.000     .3925784    .4786988
    1 child <12  |   .2698571   .0143251   -24.68   0.000     .2431917    .2994463
 2 children <12  |   .2131449   .0270381   -12.19   0.000     .1662254    .2733081
3+ children <12  |   .2115521   .0751198    -4.37   0.000     .1054788    .4242965
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_ageband_0.ster saved
   1:     35.46 /        1 =      35.4630

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,483             Number of obs    =     359,905
No. of failures      =       10,217
Time at risk         =   2145469056
                                                Wald chi2(4)     =      999.08
Log pseudolikelihood =   -132592.63             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 353,434 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .4335053   .0219339   -16.52   0.000     .3925784    .4786988
    1 child <12  |   .2698571   .0143251   -24.68   0.000     .2431917    .2994463
 2 children <12  |   .2131449   .0270381   -12.19   0.000     .1662254    .2733081
3+ children <12  |   .2115521   .0751198    -4.37   0.000     .1054788    .4242965
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster saved
   1:     36.89 /        1 =      36.8940

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,483             Number of obs    =     359,905
No. of failures      =       10,217
Time at risk         =   2145469056
                                                Wald chi2(4)     =      999.08
Log pseudolikelihood =   -132592.63             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 353,434 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .4335053   .0219339   -16.52   0.000     .3925784    .4786988
    1 child <12  |   .2698571   .0143251   -24.68   0.000     .2431917    .2994463
 2 children <12  |   .2131449   .0270381   -12.19   0.000     .1662254    .2733081
3+ children <12  |   .2115521   .0751198    -4.37   0.000     .1054788    .4242965
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster saved
(24,642 observations deleted)
   1:     25.60 /        1 =      25.5970

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   10,861,541             Number of obs    =     335,263
No. of failures      =        9,708
Time at risk         =   1997416002
                                                Wald chi2(2)     =      984.51
Log pseudolikelihood =   -125308.74             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 329,437 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .2486082   .0126643   -27.32   0.000     .2249855    .2747113
Kids under 18  |   .4228338    .021901   -16.62   0.000     .3820156    .4680134
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo_ageband_0.ster saved
   1:      8.57 /        1 =       8.5710

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,472,967             Number of obs    =     155,632
No. of failures      =       53,034
Time at risk         =  632830785.7
                                                Wald chi2(2)     =       56.44
Log pseudolikelihood =   -627740.47             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 153,630 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .6644191    .039822    -6.82   0.000     .5907793    .7472379
Kids under 18  |   .8114714   .0528098    -3.21   0.001     .7142953    .9218679
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_ageband_1.ster saved
   1:      8.86 /        1 =       8.8560

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,472,967             Number of obs    =     155,632
No. of failures      =       53,034
Time at risk         =  632830785.7
                                                Wald chi2(2)     =       56.44
Log pseudolikelihood =   -627740.47             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 153,630 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .6644191    .039822    -6.82   0.000     .5907793    .7472379
Kids under 18  |   .8114714   .0528098    -3.21   0.001     .7142953    .9218679
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_ageband_1.ster saved
   1:      8.86 /        1 =       8.8560

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,472,967             Number of obs    =     155,632
No. of failures      =       53,034
Time at risk         =  632830785.7
                                                Wald chi2(2)     =       56.44
Log pseudolikelihood =   -627740.47             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 153,630 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .6644191    .039822    -6.82   0.000     .5907793    .7472379
Kids under 18  |   .8114714   .0528098    -3.21   0.001     .7142953    .9218679
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster saved
   1:      9.11 /        1 =       9.1060

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,472,967             Number of obs    =     155,632
No. of failures      =       53,034
Time at risk         =  632830785.7
                                                Wald chi2(2)     =       56.44
Log pseudolikelihood =   -627740.47             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 153,630 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .6644191    .039822    -6.82   0.000     .5907793    .7472379
Kids under 18  |   .8114714   .0528098    -3.21   0.001     .7142953    .9218679
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster saved
   1:     12.13 /        1 =      12.1270

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,472,967             Number of obs    =     155,632
No. of failures      =       53,034
Time at risk         =  632830785.7
                                                Wald chi2(4)     =       56.99
Log pseudolikelihood =   -627740.04             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 153,630 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .8114631   .0528093    -3.21   0.001      .714288    .9218585
    1 child <12  |   .6585942   .0431165    -6.38   0.000     .5792844    .7487623
 2 children <12  |   .7269284   .1151514    -2.01   0.044     .5329107    .9915826
3+ children <12  |   .5253742   .2157632    -1.57   0.117     .2349055    1.175017
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth_ageband_1.ster saved
   1:     11.49 /        1 =      11.4930

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,472,967             Number of obs    =     155,632
No. of failures      =       53,034
Time at risk         =  632830785.7
                                                Wald chi2(4)     =       56.99
Log pseudolikelihood =   -627740.04             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 153,630 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .8114631   .0528093    -3.21   0.001      .714288    .9218585
    1 child <12  |   .6585942   .0431165    -6.38   0.000     .5792844    .7487623
 2 children <12  |   .7269284   .1151514    -2.01   0.044     .5329107    .9915826
3+ children <12  |   .5253742   .2157632    -1.57   0.117     .2349055    1.175017
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_ageband_1.ster saved
   1:     11.47 /        1 =      11.4690

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,472,967             Number of obs    =     155,632
No. of failures      =       53,034
Time at risk         =  632830785.7
                                                Wald chi2(4)     =       56.99
Log pseudolikelihood =   -627740.04             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 153,630 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .8114631   .0528093    -3.21   0.001      .714288    .9218585
    1 child <12  |   .6585942   .0431165    -6.38   0.000     .5792844    .7487623
 2 children <12  |   .7269284   .1151514    -2.01   0.044     .5329107    .9915826
3+ children <12  |   .5253742   .2157632    -1.57   0.117     .2349055    1.175017
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster saved
   1:     11.18 /        1 =      11.1810

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,472,967             Number of obs    =     155,632
No. of failures      =       53,034
Time at risk         =  632830785.7
                                                Wald chi2(4)     =       56.99
Log pseudolikelihood =   -627740.04             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 153,630 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .8114631   .0528093    -3.21   0.001      .714288    .9218585
    1 child <12  |   .6585942   .0431165    -6.38   0.000     .5792844    .7487623
 2 children <12  |   .7269284   .1151514    -2.01   0.044     .5329107    .9915826
3+ children <12  |   .5253742   .2157632    -1.57   0.117     .2349055    1.175017
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster saved
(3,742 observations deleted)
   1:      8.08 /        1 =       8.0760

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,395,020             Number of obs    =     151,890
No. of failures      =       51,587
Time at risk         =  618669626.6
                                                Wald chi2(2)     =       58.35
Log pseudolikelihood =      -609446             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 149,959 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .6567885   .0405372    -6.81   0.000     .5819546    .7412453
Kids under 18  |   .7904512   .0528577    -3.52   0.000     .6933539    .9011459
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo_ageband_1.ster saved

.         
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07a_an_multivariable_cox_models_non_covid_death.log
  log type:  text
 closed on:  22 Aug 2020, 13:15:56
----------------------------------------------------------------------------------------------------------------------------------
