----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense3_non_covid_death.lo
> g
  log type:  text
 opened on:  22 Aug 2020, 13:08:46

. 
. 
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure'                      ///
>                         `demogadjlist'                          ///
>                         `comordidadjlist'                       ///
>                         `if'                                            ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. foreach exposure_type in        kids_cat3   {
  4.  
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.bmicat) smoking(i.smoke)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_CCnoeth_bmi_smok_ageband_`x', 
> replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 10.  }
 11. 
. }
   1:     63.73 /        1 =      63.7330

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,483             Number of obs    =     359,905
No. of failures      =       10,217
Time at risk         =   2145469056
                                                Wald chi2(2)     =     1000.01
Log pseudolikelihood =    -132594.4             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 353,434 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .2588036   .0126362   -27.68   0.000     .2351852    .2847939
Kids under 18  |   .4335085   .0219341   -16.52   0.000     .3925813    .4787024
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_CCnoeth_bmi_smok_ageband_0.ster not fo
> und)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_CCnoeth_bmi_smok_ageband_0.ster saved
   1:     12.46 /        1 =      12.4550

----------------------------------------------------------------------------------------------------------------------------------
active results
----------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,472,967             Number of obs    =     155,632
No. of failures      =       53,034
Time at risk         =  632830785.7
                                                Wald chi2(2)     =       56.44
Log pseudolikelihood =   -627740.47             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 153,630 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .6644191    .039822    -6.82   0.000     .5907793    .7472379
Kids under 18  |   .8114714   .0528098    -3.21   0.001     .7142953    .9218679
--------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_CCnoeth_bmi_smok_ageband_1.ster not fo
> und)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_CCnoeth_bmi_smok_ageband_1.ster saved

. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense3_non_covid_death.lo
> g
  log type:  text
 closed on:  22 Aug 2020, 13:10:07
----------------------------------------------------------------------------------------------------------------------------------
