----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_shield_covid_death_icu.log
  log type:  text
 opened on:  22 Aug 2020, 13:08:45

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6. stcox   `exposure'                                                              ///
>                         `demogadjlist'                                                  ///
>                         `comordidadjlist'                                               ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3.         
. 
. 
. foreach int_type in shield {
  4. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  5. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  6. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposu
> re_type')
  7. if _rc==0{
  8. testparm 1.`int_type'#i.`exposure_type'
  9. di _n "`exposure_type' <66" _n "****************"
 10. lincom 2.`exposure_type', eform
 11. di "`exposure_type' 66+" _n "****************"
 12. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 13. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noe
> th_ageband_`x', replace
 14. }
 15. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. 
. }
 18. }

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 11,666,004.55508)
Iteration 0:   log pseudolikelihood = -35440.272
Iteration 1:   log pseudolikelihood = -35381.592
Iteration 2:   log pseudolikelihood = -35379.071
Iteration 3:   log pseudolikelihood = -35379.061
Refining estimates:
Iteration 0:   log pseudolikelihood = -35379.061

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,005             Number of obs    =     352,604
No. of failures      =        2,705
Time at risk         =   2145297922
                                                Wald chi2(2)     =       99.51
Log pseudolikelihood =   -35379.061             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 346,280 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .4853291   .0355062    -9.88   0.000     .4204973    .5601565
Kids under 18  |   .8484246   .0635385    -2.19   0.028     .7325998    .9825615
--------------------------------------------------------------------------------
                                                             Stratified by stp
   1:     51.93 /        1 =      51.9270

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 11,666,004.55508)
Iteration 0:   log pseudolikelihood = -35440.272
Iteration 1:   log pseudolikelihood = -35361.377
Iteration 2:   log pseudolikelihood = -35356.093
Iteration 3:   log pseudolikelihood = -35356.037
Iteration 4:   log pseudolikelihood = -35356.037
Refining estimates:
Iteration 0:   log pseudolikelihood = -35356.037

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,005             Number of obs    =     352,604
No. of failures      =        2,705
Time at risk         =   2145297922
                                                Wald chi2(4)     =      131.90
Log pseudolikelihood =   -35356.037             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 346,280 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .3894439   .0347018   -10.58   0.000     .3270376    .4637587
  Kids under 18  |   .7111579   .0641947    -3.78   0.000     .5958404    .8487938
                 |
shield#kids_cat3 |
1#Kids under 12  |   2.273813   .3347895     5.58   0.000      1.70383    3.034472
1#Kids under 18  |   1.917181   .2881304     4.33   0.000     1.428029    2.573884
----------------------------------------------------------------------------------
                                                             Stratified by stp
   1:     32.67 /        1 =      32.6700

 ( 1)  1.shield#1.kids_cat3 = 0
 ( 2)  1.shield#2.kids_cat3 = 0

           chi2(  2) =   49.84
         Prob > chi2 =    0.0000

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7111579   .0641947    -3.78   0.000     .5958404    .8487938
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.shield#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.363418   .1703192     2.48   0.013     1.067324    1.741654
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_0
> .ster not found)
file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster s
> aved

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 3,471,971.5345612)
Iteration 0:   log pseudolikelihood = -105161.42
Iteration 1:   log pseudolikelihood = -105159.14
Iteration 2:   log pseudolikelihood = -105159.13
Iteration 3:   log pseudolikelihood = -105159.13
Refining estimates:
Iteration 0:   log pseudolikelihood = -105159.13

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,471,972             Number of obs    =     112,797
No. of failures      =        8,905
Time at risk         =  632768378.9
                                                Wald chi2(2)     =        3.93
Log pseudolikelihood =   -105159.13             Prob > chi2      =      0.1402

                       (Std. Err. adjusted for 111,700 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .8253063   .0901762    -1.76   0.079     .6662075      1.0224
Kids under 18  |   .8854726   .1148053    -0.94   0.348     .6867729    1.141661
--------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      6.67 /        1 =       6.6720

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 3,471,971.5345612)
Iteration 0:   log pseudolikelihood = -105161.42
Iteration 1:   log pseudolikelihood = -105147.48
Iteration 2:   log pseudolikelihood = -105146.94
Iteration 3:   log pseudolikelihood = -105146.94
Refining estimates:
Iteration 0:   log pseudolikelihood = -105146.94

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,471,972             Number of obs    =     112,797
No. of failures      =        8,905
Time at risk         =  632768378.9
                                                Wald chi2(4)     =       24.62
Log pseudolikelihood =   -105146.94             Prob > chi2      =      0.0001

                         (Std. Err. adjusted for 111,700 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .6136241   .0920929    -3.25   0.001     .4572501    .8234762
  Kids under 18  |   .6410931   .1125465    -2.53   0.011     .4544532    .9043844
                 |
shield#kids_cat3 |
1#Kids under 12  |   2.126501    .464298     3.46   0.001     1.386165    3.262241
1#Kids under 18  |   2.317905   .5874085     3.32   0.001      1.41053    3.808982
----------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      9.13 /        1 =       9.1270

 ( 1)  1.shield#1.kids_cat3 = 0
 ( 2)  1.shield#2.kids_cat3 = 0

           chi2(  2) =   22.95
         Prob > chi2 =    0.0000

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6410931   .1125465    -2.53   0.011     .4544532    .9043844
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.shield#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.485993   .2803327     2.10   0.036     1.026686     2.15078
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_1
> .ster not found)
file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster s
> aved

. 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_shield_covid_death_icu.log
  log type:  text
 closed on:  22 Aug 2020, 13:10:28
----------------------------------------------------------------------------------------------------------------------------------
