----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_time_covid_death_icu.log
  log type:  text
 opened on:  22 Aug 2020, 13:08:44

. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6. stcox   `exposure'                                                              ///
>                         `demogadjlist'                                                  ///
>                         `comordidadjlist'                                               ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. *Split data by time of study period: days to April 3rd (31 d March, 3d April)
. stsplit cat_time, at(0,34, 200)
  4. recode cat_time 34=1 200=2 
  5. recode `outcome' .=0 
  6. tab cat_time
  7.  
. /*Overlapping time periods
> gen cat_time0=1 if cat==0
> gen cat_time1=1 if cat==0 | cat==0.25
> */
.         
. 
. 
. foreach int_type in cat_time  {
  8. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  9. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 10. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposu
> re_type')
 11. if _rc==0{
 12. testparm 1.`int_type'#i.`exposure_type'
 13. di _n "`exposure_type' <66" _n "****************"
 14. lincom 2.`exposure_type', eform
 15. di "`exposure_type' 66+" _n "****************"
 16. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 17. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noe
> th_ageband_`x', replace
 18. }
 19. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 20. 
. }
 21. 
. }
 22. 
. }
(352,547 observations (episodes) created)
(cat_time: 352547 changes made)
(covid_death_icu: 352547 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    352,604       50.00       50.00
          1 |    352,547       50.00      100.00
------------+-----------------------------------
      Total |    705,151      100.00

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 23,330,173.776897)
Iteration 0:   log pseudolikelihood = -35440.272
Iteration 1:   log pseudolikelihood = -35381.592
Iteration 2:   log pseudolikelihood = -35379.071
Iteration 3:   log pseudolikelihood = -35379.061
Refining estimates:
Iteration 0:   log pseudolikelihood = -35379.061

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,005             Number of obs    =     705,151
No. of failures      =        2,705
Time at risk         =   2145297922
                                                Wald chi2(2)     =       99.51
Log pseudolikelihood =   -35379.061             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 346,280 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .4853291   .0355062    -9.88   0.000     .4204973    .5601565
Kids under 18  |   .8484246   .0635385    -2.19   0.028     .7325998    .9825615
--------------------------------------------------------------------------------
                                                             Stratified by stp
   1:     70.06 /        1 =      70.0550

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 23,330,173.776897)
Iteration 0:   log pseudolikelihood = -35440.272
Iteration 1:   log pseudolikelihood = -35382.656
Iteration 2:   log pseudolikelihood = -35380.057
Iteration 3:   log pseudolikelihood = -35378.585
Iteration 4:   log pseudolikelihood = -35378.535
Iteration 5:   log pseudolikelihood = -35378.386
Iteration 6:   log pseudolikelihood = -35378.024
Iteration 7:   log pseudolikelihood = -35377.636
Iteration 8:   log pseudolikelihood = -35377.581
Iteration 9:   log pseudolikelihood = -35377.581
Refining estimates:
Iteration 0:   log pseudolikelihood = -35377.581

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,666,005             Number of obs    =     705,151
No. of failures      =        2,705
Time at risk         =   2145297922
                                                Wald chi2(3)     =    38961.32
Log pseudolikelihood =   -35377.581             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 346,280 clusters in household_id)
------------------------------------------------------------------------------------
                   |               Robust
                _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
         kids_cat3 |
    Kids under 12  |   5.56e-07   4.07e-08  -196.86   0.000     4.82e-07    6.42e-07
    Kids under 18  |   11.22318   17.87829     1.52   0.129     .4945046    254.7192
                   |
cat_time#kids_cat3 |
  1#Kids under 12  |     872809          .        .       .            .           .
  1#Kids under 18  |   .0752403   .1199894    -1.62   0.105     .0033037    1.713578
------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:     63.39 /        1 =      63.3930

 ( 1)  1.cat_time#1.kids_cat3 = 0
 ( 2)  1.cat_time#2.kids_cat3 = 0
       Constraint 1 dropped

           chi2(  1) =    2.63
         Prob > chi2 =    0.1048

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   11.22318   17.87829     1.52   0.129     .4945046    254.7192
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.cat_time#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8444355   .0633843    -2.25   0.024     .7289107    .9782699
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband
> _0.ster not found)
file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster
>  saved
(112,464 observations (episodes) created)
(cat_time: 112464 changes made)
(covid_death_icu: 112464 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    112,797       50.07       50.07
          1 |    112,464       49.93      100.00
------------+-----------------------------------
      Total |    225,261      100.00

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 6,932,940.0695419)
Iteration 0:   log pseudolikelihood = -105161.42
Iteration 1:   log pseudolikelihood = -105159.14
Iteration 2:   log pseudolikelihood = -105159.13
Iteration 3:   log pseudolikelihood = -105159.13
Refining estimates:
Iteration 0:   log pseudolikelihood = -105159.13

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,471,972             Number of obs    =     225,261
No. of failures      =        8,905
Time at risk         =  632768378.9
                                                Wald chi2(2)     =        3.93
Log pseudolikelihood =   -105159.13             Prob > chi2      =      0.1402

                       (Std. Err. adjusted for 111,700 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .8253063   .0901762    -1.76   0.079     .6662075      1.0224
Kids under 18  |   .8854726   .1148053    -0.94   0.348     .6867729    1.141661
--------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      9.89 /        1 =       9.8930

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

(sum of wgt is 6,932,940.0695419)
Iteration 0:   log pseudolikelihood = -105161.42
Iteration 1:   log pseudolikelihood = -105159.11
Iteration 2:   log pseudolikelihood = -105159.08
Iteration 3:   log pseudolikelihood = -105159.07
Iteration 4:   log pseudolikelihood = -105159.07
Iteration 5:   log pseudolikelihood = -105159.07
Iteration 6:   log pseudolikelihood = -105159.07
Iteration 7:   log pseudolikelihood = -105159.07
Iteration 8:   log pseudolikelihood = -105159.07
Iteration 9:   log pseudolikelihood = -105159.07
Iteration 10:  log pseudolikelihood = -105159.07
Iteration 11:  log pseudolikelihood = -105159.07
Iteration 12:  log pseudolikelihood = -105159.07
Iteration 13:  log pseudolikelihood = -105159.07
Iteration 14:  log pseudolikelihood = -105159.07
Refining estimates:
Iteration 0:   log pseudolikelihood = -105159.07

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,471,972             Number of obs    =     225,261
No. of failures      =        8,905
Time at risk         =  632768378.9
                                                Wald chi2(2)     =    25651.19
Log pseudolikelihood =   -105159.07             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 111,700 clusters in household_id)
------------------------------------------------------------------------------------
                   |               Robust
                _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
         kids_cat3 |
    Kids under 12  |   2.18e-06   2.38e-07  -119.31   0.000     1.76e-06    2.70e-06
    Kids under 18  |   8.02e-07   1.04e-07  -108.25   0.000     6.22e-07    1.03e-06
                   |
cat_time#kids_cat3 |
  1#Kids under 12  |   378646.3          .        .       .            .           .
  1#Kids under 18  |    1104059          .        .       .            .           .
------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:     17.45 /        1 =      17.4530

 ( 1)  1.cat_time#1.kids_cat3 = 0
 ( 2)  1.cat_time#2.kids_cat3 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   8.02e-07   1.04e-07  -108.25   0.000     6.22e-07    1.03e-06
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.cat_time#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8858345   .1148529    -0.93   0.350     .6870527    1.142129
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband
> _1.ster not found)
file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster
>  saved

. 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_time_covid_death_icu.log
  log type:  text
 closed on:  22 Aug 2020, 13:11:50
----------------------------------------------------------------------------------------------------------------------------------
