----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\WORMS_01_cr_analysis_dataset.log
  log type:  text
 opened on:  23 Aug 2020, 16:05:15

. 
. /* CONVERT STRINGS TO DATE====================================================*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                                                                                     
>   */
. 
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(22,749,281 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(1,323,484 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(411,116 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 permanent_immunodeficiency  ///
>                                                 temporary_immunodeficiency  ///
>                                                 dialysis                                        ///
>                                                 kidney_transplant                       ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 dereg_date ///
>                                                 worms ///
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(22,852,893 real changes made)
(22,047,521 real changes made)
(22,047,521 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(22,852,893 real changes made)
(21,498,179 real changes made)
(21,498,179 missing values generated)
variable diabetes was str7 now str10
(22,852,893 real changes made)
(21,014,681 real changes made)
(21,014,681 missing values generated)
variable cancer_haem was str7 now str10
(22,852,893 real changes made)
(22,734,427 real changes made)
(22,734,427 missing values generated)
variable cancer_nonhaem was str7 now str10
(22,852,893 real changes made)
(21,858,288 real changes made)
(21,858,288 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(22,852,893 real changes made)
(22,801,912 real changes made)
(22,801,912 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(22,852,893 real changes made)
(22,847,367 real changes made)
(22,847,367 missing values generated)
variable dialysis was str7 now str10
(22,852,893 real changes made)
(22,828,993 real changes made)
(22,828,993 missing values generated)
variable kidney_transplant was str7 now str10
(22,852,893 real changes made)
(22,837,209 real changes made)
(22,837,209 missing values generated)
variable other_transplant was str7 now str10
(22,852,893 real changes made)
(22,847,908 real changes made)
(22,847,908 missing values generated)
variable asplenia was str7 now str10
(22,852,893 real changes made)
(22,825,280 real changes made)
(22,825,280 missing values generated)
variable chronic_liver_disease was str7 now str10
(22,852,893 real changes made)
(22,735,123 real changes made)
(22,735,123 missing values generated)
variable other_neuro was str7 now str10
(22,852,893 real changes made)
(22,647,604 real changes made)
(22,647,604 missing values generated)
variable stroke_dementia was str7 now str10
(22,852,893 real changes made)
(22,378,941 real changes made)
(22,378,941 missing values generated)
variable esrf was str7 now str10
(22,852,893 real changes made)
(22,823,803 real changes made)
(22,823,803 missing values generated)
variable hypertension was str7 now str10
(22,852,893 real changes made)
(18,864,345 real changes made)
(18,864,345 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(22,852,893 real changes made)
(21,883,990 real changes made)
(21,883,990 missing values generated)
variable bmi_date_measured was str7 now str10
(22,852,893 real changes made)
(7,982,878 real changes made)
(7,982,878 missing values generated)
variable bp_sys_date_measured was str7 now str10
(22,852,893 real changes made)
(6,021,589 real changes made)
(6,021,589 missing values generated)
variable bp_dias_date_measured was str7 now str10
(22,852,893 real changes made)
(6,024,850 real changes made)
(6,024,850 missing values generated)
variable creatinine_date was str7 now str10
(22,852,893 real changes made)
(8,973,141 real changes made)
(8,973,141 missing values generated)
variable smoking_status_date was str7 now str10
(22,852,893 real changes made)
(4,581,934 real changes made)
(4,581,934 missing values generated)
variable dereg_date was str7 now str10
(22,852,893 real changes made)
(21,754,814 real changes made)
(21,754,814 missing values generated)
variable worms was str7 now str10
(22,852,893 real changes made)
(22,442,740 real changes made)
(22,442,740 missing values generated)

. 
. * Recode to dates from the strings 
. foreach var of varlist  died_date_ons                           {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td 
  7.         
. }
(22,749,910 missing values generated)

. 
. /*Tab all variables in initial extract*/
. sum, d f

                         patient_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%       415334           2878
 5%      1982246           7276
10%      4082798           9969       Obs          22,852,893
25%     1.02e+07           9970       Sum of Wgt.    22852893

50%     2.11e+07                      Mean           2.23e+07
                        Largest       Std. Dev.      1.41e+07
75%     3.36e+07       5.32e+07
90%     4.32e+07       5.32e+07       Variance       1.98e+14
95%     4.64e+07       5.32e+07       Skewness       .2475728
99%     4.94e+07       5.32e+07       Kurtosis       1.943896

                       dereg_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2019      15feb2019
 5%    15feb2019      15feb2019
10%    15mar2019      15feb2019       Obs           1,098,079
25%    15jun2019      15feb2019       Sum of Wgt.   1,098,079

50%    15oct2019                      Mean          19oct2019
                        Largest       Std. Dev.      150.7976
75%    15feb2020      15jul2020
90%    15may2020      15jul2020       Variance       22739.92
95%    15jun2020      15jul2020       Skewness       .0617431
99%    15jul2020      15jul2020       Kurtosis       1.928207

                         worms_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15dec1985      15dec1899
 5%    15jun1991      15dec1899
10%    15nov1993      15dec1899       Obs             410,153
25%    15dec2001      15dec1899       Sum of Wgt.     410,153

50%    15mar2008                      Mean          31aug2006
                        Largest       Std. Dev.      3180.989
75%    15oct2012      15jul2020
90%    15may2016      15jul2020       Variance       1.01e+07
95%    15dec2017      15jul2020       Skewness      -1.665976
99%    15nov2019      15jul2020       Kurtosis       13.98534

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1             -2
 5%            4             -1
10%            9              0       Obs          22,852,893
25%           22              0       Sum of Wgt.    22852893

50%           40                      Mean           40.91146
                        Largest       Std. Dev.      23.41787
75%           59            119
90%           73            119       Variance       548.3966
95%           80            119       Skewness       .1116764
99%           89            120       Kurtosis       2.063712

                             sex
-------------------------------------------------------------
no observations

                             imd
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%         1200             -1
10%         2800             -1       Obs          22,852,893
25%         7700             -1       Sum of Wgt.    22852893

50%        16000                      Mean           15922.05
                        Largest       Std. Dev.      9470.918
75%        24000          32800
90%        29100          32800       Variance       8.97e+07
95%        30900          32800       Skewness       .0146614
99%        32400          32800       Kurtosis       1.820105

                             stp
-------------------------------------------------------------
no observations

                          ethnicity
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs          16,462,460
25%            1              1       Sum of Wgt.    16462460

50%            1                      Mean           1.374163
                        Largest       Std. Dev.       .939097
75%            1              5
90%            3              5       Variance       .8819031
95%            4              5       Skewness       2.490536
99%            5              5       Kurtosis       8.232182

                       ethnicity_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%         2003           1888
 5%         2007           1899
10%         2008           1899       Obs          16,462,460
25%         2010           1899       Sum of Wgt.    16462460

50%         2013                      Mean            2012.61
                        Largest       Std. Dev.      8.206693
75%         2016           2075
90%         2018           2081       Variance       67.34981
95%         2019           2092       Skewness      -10.28021
99%         2020           2095       Kurtosis       140.0373

                        household_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          22,852,893
25%      1125730              0       Sum of Wgt.    22852893

50%      4075427                      Mean            4209569
                        Largest       Std. Dev.       3210983
75%      6944322       1.01e+07
90%      8837836       1.01e+07       Variance       1.03e+13
95%      9494814       1.01e+07       Skewness       .1776491
99%     1.00e+07       1.01e+07       Kurtosis       1.735789

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          22,852,893
25%            1              0       Sum of Wgt.    22852893

50%            2                      Mean           4.411771
                        Largest       Std. Dev.        44.975
75%            4           3355
90%            5           3355       Variance        2022.75
95%            7           3355       Skewness       46.64013
99%           13           3355       Kurtosis       2882.616

                       care_home_type
-------------------------------------------------------------
no observations

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0        -3460.2
 5%            0         -277.8
10%            0           -2.1       Obs          22,852,893
25%            0           -1.8       Sum of Wgt.    22852893

50%         22.9                      Mean           58.55147
                        Largest       Std. Dev.      8063.203
75%         28.1        1520000
90%           33        1805556       Variance       6.50e+07
95%         36.6       1.95e+07       Skewness       2559.756
99%         44.9       2.85e+07       Kurtosis        8318520

                   bmi_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug2010      15feb2010
 5%    15apr2012      15feb2010
10%    15sep2013      15feb2010       Obs          14,870,015
25%    15may2016      15feb2010       Sum of Wgt.    14870015

50%    15aug2018                      Mean          29sep2017
                        Largest       Std. Dev.      1823.301
75%    15sep2019      15mar9909
90%    15feb2020      15apr9909       Variance        3324428
95%    15apr2020      15apr9912       Skewness       1133.418
99%    15jul2020      15jul9935       Kurtosis        1754267

                           bp_sys
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs          22,852,893
25%            0             -1       Sum of Wgt.    22852893

50%          120                      Mean           93.14078
                        Largest       Std. Dev.       66.4146
75%          132          14090
90%          142          14292       Variance       4410.899
95%          149          15090       Skewness       343.8463
99%          167         130170       Kurtosis       646780.6

                  bp_sys_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan2003      15jan1860
 5%    15mar2010      15sep1899
10%    15mar2013      15dec1899       Obs          16,831,304
25%    15apr2016      15dec1899       Sum of Wgt.    16831304

50%    15feb2018                      Mean          24oct2016
                        Largest       Std. Dev.      1257.648
75%    15sep2018      15feb2019
90%    15dec2018      15feb2019       Variance        1581677
95%    15jan2019      15feb2019       Skewness      -5.428355
99%    15jan2019      15feb2019       Kurtosis       107.1749

                           bp_dias
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs          22,852,893
25%            0             -1       Sum of Wgt.    22852893

50%           70                      Mean           55.94505
                        Largest       Std. Dev.      48.97887
75%           80          10070
90%           86          83135       Variance        2398.93
95%           90          89147       Skewness       974.2803
99%          100         110080       Kurtosis        1955777

                 bp_dias_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2003      15jan1860
 5%    15mar2010      15sep1899
10%    15mar2013      15dec1899       Obs          16,828,043
25%    15apr2016      15dec1899       Sum of Wgt.    16828043

50%    15feb2018                      Mean          25oct2016
                        Largest       Std. Dev.       1228.76
75%    15sep2018      15feb2019
90%    15dec2018      15feb2019       Variance        1509852
95%    15jan2019      15feb2019       Skewness      -4.194829
99%    15jan2019      15feb2019       Kurtosis       61.21006

                         creatinine
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0            -40
 5%            0             -1
10%            0             -1       Obs          22,852,893
25%            0             -1       Sum of Wgt.    22852893

50%           59                      Mean           1411.857
                        Largest       Std. Dev.      336176.9
75%           77       1.19e+08
90%           92       1.20e+08       Variance       1.13e+11
95%          101       1.21e+08       Skewness       258.4211
99%          130       1.58e+08       Kurtosis       69288.76

                    creatinine_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun2004      15dec1899
 5%    15mar2010      15dec1899
10%    15oct2012      15dec1899       Obs          13,879,752
25%    15jan2016      15jan1900       Sum of Wgt.    13879752

50%    15jan2018                      Mean          04oct2016
                        Largest       Std. Dev.      1149.983
75%    15sep2018      15feb2019
90%    15dec2018      15feb2019       Variance        1322460
95%    15jan2019      15feb2019       Skewness      -3.941309
99%    15jan2019      15feb2019       Kurtosis        72.7504

                       smoking_status
-------------------------------------------------------------
no observations

                  smoking_status_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul2004      15sep1899
 5%    15jul2009      15sep1899
10%    15feb2012      15sep1899       Obs          18,270,959
25%    15nov2014      15sep1899       Sum of Wgt.    18270959

50%    15jun2017                      Mean          21mar2016
                        Largest       Std. Dev.      1277.746
75%    15jul2018      15feb2019
90%    15nov2018      15feb2019       Variance        1632634
95%    15dec2018      15feb2019       Skewness      -5.335574
99%    15jan2019      15feb2019       Kurtosis        120.954

              chronic_respiratory_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jun1991      15jan1840
10%    15feb2001      15jan1860       Obs             805,372
25%    15aug2007      15dec1899       Sum of Wgt.     805,372

50%    15feb2013                      Mean          10mar2009
                        Largest       Std. Dev.       6367.32
75%    15feb2017      15jul2020
90%    15feb2019      15jul2020       Variance       4.05e+07
95%    15sep2019      15jul2020       Skewness      -4.805681
99%    15mar2020      15jul2020       Kurtosis       29.14064

                chronic_cardiac_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1840
 5%    15jun1986      15dec1840
10%    15apr1994      15jan1850       Obs           1,354,714
25%    15apr2003      15jan1850       Sum of Wgt.   1,354,714

50%    15mar2011                      Mean          06nov2006
                        Largest       Std. Dev.      6598.186
75%    15jul2016      15jul2020
90%    15jan2019      15jul2020       Variance       4.35e+07
95%    15sep2019      15jul2020       Skewness      -4.229138
99%    15may2020      15jul2020       Kurtosis       24.64407

                        diabetes_type
-------------------------------------------------------------
no observations

                     diabetes_exeter_os
-------------------------------------------------------------
no observations

                       diabetes_exeter
-------------------------------------------------------------
no observations

                     hba1c_mmol_per_mol
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0           -782
 5%            0             -2
10%            0             -1       Obs          22,852,893
25%            0             -1       Sum of Wgt.    22852893

50%            0                      Mean           18.46843
                        Largest       Std. Dev.      1831.164
75%           37         107000
90%           42         111000       Variance        3353161
95%           47         759550       Skewness       4676.722
99%           73        8688000       Kurtosis       2.22e+07

                   hba1c_mmol_per_mol_date
-------------------------------------------------------------
no observations

                      hba1c_percentage
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -1
10%            0             -1       Obs          22,852,893
25%            0             -1       Sum of Wgt.    22852893

50%            0                      Mean           1.582715
                        Largest       Std. Dev.      4002.968
75%            0            935
90%          5.1         231855       Variance       1.60e+07
95%          5.8         930709       Skewness       4763.022
99%          7.7       1.91e+07       Kurtosis       2.27e+07

                    hba1c_percentage_date
-------------------------------------------------------------
no observations

                      cancer_haem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1840
 5%    15feb1986      15jan1860
10%    15jan1995      15dec1899       Obs             118,466
25%    15jun2005      15dec1899       Sum of Wgt.     118,466

50%    15jan2013                      Mean          13oct2008
                        Largest       Std. Dev.      5679.037
75%    15jul2017      15jul2020
90%    15may2019      15jul2020       Variance       3.23e+07
95%    15dec2019      15jul2020       Skewness      -4.355723
99%    15jun2020      15jul2020       Kurtosis       29.01924

                     cancer_nonhaem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15mar1970      15dec1840
 5%    15jan1991      15jan1860
10%    15sep1997      15jan1860       Obs             994,605
25%    15jan2006      15jan1860       Sum of Wgt.     994,605

50%    15feb2013                      Mean          15nov2009
                        Largest       Std. Dev.      4638.125
75%    15aug2017      15jul2020
90%    15may2019      15jul2020       Variance       2.15e+07
95%    15dec2019      15nov2020       Skewness      -4.554411
99%    15may2020      15dec2100       Kurtosis       36.28205

               permanent_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1900
 5%    15jan1993      15jan1900
10%    15dec1999      15jan1900       Obs              50,981
25%    15sep2006      15jan1900       Sum of Wgt.      50,981

50%    15jun2012                      Mean          06sep2008
                        Largest       Std. Dev.      6040.676
75%    15apr2016      15jan2019
90%    15feb2018      15jan2019       Variance       3.65e+07
95%    15sep2018      15jan2019       Skewness       -5.18687
99%    15jan2019      15jan2019       Kurtosis       33.69252

                        asplenia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15mar1956      15dec1899
10%    15jan1967      15dec1899       Obs              27,613
25%    15aug1980      15dec1899       Sum of Wgt.      27,613

50%    15jan1999                      Mean          25apr1993
                        Largest       Std. Dev.      9049.642
75%    15jan2012      15jul2020
90%    15oct2017      15jul2020       Variance       8.19e+07
95%    15mar2019      15jul2020       Skewness      -1.773744
99%    15mar2020      15jul2020       Kurtosis       7.234815

               temporary_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2018      15feb2018
 5%    15feb2018      15feb2018
10%    15mar2018      15feb2018       Obs               5,526
25%    15jun2018      15feb2018       Sum of Wgt.       5,526

50%    15sep2018                      Mean          04sep2018
                        Largest       Std. Dev.      102.0672
75%    15nov2018      15jan2019
90%    15jan2019      15jan2019       Variance       10417.71
95%    15jan2019      15jan2019       Skewness      -.4805175
99%    15jan2019      15jan2019       Kurtosis       2.100068

                 chronic_liver_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1840
 5%    15jan1992      15dec1899
10%    15sep1999      15dec1899       Obs             117,770
25%    15may2007      15dec1899       Sum of Wgt.     117,770

50%    15mar2014                      Mean          18sep2009
                        Largest       Std. Dev.      6296.202
75%    15dec2017      15jul2020
90%    15jun2019      15jul2020       Variance       3.96e+07
95%    15dec2019      15nov2020       Skewness      -4.926934
99%    15jun2020      15oct2021       Kurtosis       30.97311

                    stroke_dementia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1899
 5%    15nov1994      15dec1899
10%    15sep2000      15dec1899       Obs             473,952
25%    15jan2008      15dec1899       Sum of Wgt.     473,952

50%    15apr2014                      Mean          23jul2010
                        Largest       Std. Dev.      5504.385
75%    15nov2017      15jul2020
90%    15jul2019      15sep2020       Variance       3.03e+07
95%    15jan2020      15oct2020       Skewness      -5.431662
99%    15jun2020      15jul2096       Kurtosis       39.04559

                      other_neuro_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jan1965      15jan1800
10%    15may1980      15dec1899       Obs             205,289
25%    15jan1998      15dec1899       Sum of Wgt.     205,289

50%    15apr2009                      Mean          22jul2002
                        Largest       Std. Dev.       8081.29
75%    15jan2016      15jul2020
90%    15oct2018      15jul2020       Variance       6.53e+07
95%    15aug2019      15jul2020       Skewness      -2.891877
99%    15apr2020      15jul2020       Kurtosis       13.01376

                          esrf_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15jan1987      15dec1899
10%    15dec1995      15dec1899       Obs              29,090
25%    15mar2006      15dec1899       Sum of Wgt.      29,090

50%    15dec2013                      Mean          11sep2008
                        Largest       Std. Dev.      6714.721
75%    15dec2017      15jul2020
90%    15jul2019      15jul2020       Variance       4.51e+07
95%    15dec2019      15jul2020       Skewness      -4.406602
99%    15jun2020      15jul2020       Kurtosis       25.64128

                        dialysis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15jul1990      15dec1899
10%    15jul1998      15dec1899       Obs              23,900
25%    15jul2007      15dec1899       Sum of Wgt.      23,900

50%    15aug2014                      Mean          01nov2009
                        Largest       Std. Dev.      6293.077
75%    15apr2018      15jul2020
90%    15aug2019      15jul2020       Variance       3.96e+07
95%    15jan2020      15jul2020       Skewness      -4.803994
99%    15jun2020      15jul2020       Kurtosis       30.08997

                   kidney_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15mar1987      15dec1899
10%    15jan1994      15dec1899       Obs              15,684
25%    15jan2004      15jan1900       Sum of Wgt.      15,684

50%    15jul2011                      Mean          29sep2007
                        Largest       Std. Dev.        5582.8
75%    15jun2016      15jul2020
90%    15oct2018      15jul2020       Variance       3.12e+07
95%    15aug2019      15jul2020       Skewness       -4.43611
99%    15mar2020      15jul2020       Kurtosis       30.28964

                    other_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15mar1965      15jan1900
 5%    15dec1992      15jan1900
10%    15jan1997      15jan1900       Obs               4,985
25%    15jan2004      15jan1900       Sum of Wgt.       4,985

50%    15sep2010                      Mean          04apr2008
                        Largest       Std. Dev.      4762.063
75%    15nov2015      15jul2020
90%    15aug2018      15jul2020       Variance       2.27e+07
95%    15jul2019      15jul2020       Skewness      -4.969931
99%    15mar2020      15jul2020       Kurtosis       40.01307

                      hypertension_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jan1986      15jan1800
10%    15dec1993      15jan1800       Obs           3,988,548
25%    15oct2001      15jan1800       Sum of Wgt.   3,988,548

50%    15dec2007                      Mean          26jun2004
                        Largest       Std. Dev.      7217.398
75%    15jul2014      15sep2037
90%    15feb2018      15jun2055       Variance       5.21e+07
95%    15mar2019      15nov2056       Skewness      -4.093309
99%    15feb2020      15feb2058       Kurtosis       21.83914

                    ra_sle_psoriasis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jan1972      15jan1800
10%    15jun1984      15jan1840       Obs             968,903
25%    15jan1998      15jan1840       Sum of Wgt.     968,903

50%    15jul2007                      Mean          02jul2002
                        Largest       Std. Dev.      7304.674
75%    15mar2014      15jul2020
90%    15nov2017      15jul2020       Variance       5.34e+07
95%    15jan2019      15mar2082       Skewness      -3.098669
99%    15feb2020      15mar3000       Kurtosis       22.61991

                           asthma
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          22,852,893
25%            0              0       Sum of Wgt.    22852893

50%            0                      Mean           .1608806
                        Largest       Std. Dev.      .4039413
75%            0              2
90%            1              2       Variance       .1631686
95%            1              2       Skewness       2.465103
99%            2              2       Kurtosis       8.545228

                        diabetes_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1860
 5%    15jan1995      15jan1860
10%    15nov2000      15jan1885       Obs           1,838,212
25%    15sep2006      15aug1888       Sum of Wgt.   1,838,212

50%    15mar2013                      Mean          31dec2009
                        Largest       Std. Dev.      5234.648
75%    15jun2017      15feb2020
90%    15jan2019      15feb2020       Variance       2.74e+07
95%    15jul2019      15feb2020       Skewness      -5.473504
99%    15dec2019      15feb2020       Kurtosis       41.01693

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    02feb2020      01feb2020
 5%    10feb2020      01feb2020
10%    19feb2020      01feb2020       Obs             102,983
25%    17mar2020      01feb2020       Sum of Wgt.     102,983

50%    16apr2020                      Mean          18apr2020
                        Largest       Std. Dev.      43.20663
75%    21may2020      19jul2020
90%    21jun2020      19jul2020       Variance       1866.813
95%    03jul2020      20jul2020       Skewness        .131521
99%    13jul2020      20jul2020       Kurtosis       2.149934

. 
. /* CREATE VARIABLES===========================================================*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(11,423,400 missing values generated)

. replace male = 0 if sex == "F"
(11,423,036 real changes made)

. 
. * Ethnicity 
. replace ethnicity = .u if ethnicity == .
(6,390,433 real changes made, 6,390,433 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                                       ///
>                                                 3 "Asian or Asian British"      ///
>                                                 4 "Black"                                       ///
>                                                 5 "Other"                                       ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(22,852,861 missing values generated)

. replace stp = sum(stp)
(22,852,892 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(22,852,893 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(145,696 real changes made, 145,696 to missing)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 18119650 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age 18/29.9999 = 1 /// 
>                    30/39.9999 = 2 /// 
>            40/49.9999 = 3 ///
>                    50/59.9999 = 4 ///
>                60/69.9999 = 5 ///
>                    70/79.9999 = 6 ///
>                    80/max = 7, gen(agegroup) 
(18260867 differences between age and agegroup)

. 
. label define agegroup   1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Create binary age (for age stratification)
. recode age min/65.999999999 = 0 ///
>            66/max = 1, gen(age66)
(22712051 differences between age and age66)

. 
. * Check there are no missing ages
. assert age < .

. assert agegroup < .

. assert age66 < .

. 
. 
. 
. 
. 
. 
. 
. /* APPLY HH level INCLUSION/EXCLUIONS==================================================*/ 
. *tab care_home_type household_size
. drop if care_home_type!="U"
(245,032 observations deleted)

. 
. count
  22,607,861

. noi di "DROP if HH ID==0"
DROP if HH ID==0

. count if household_id==0
  3,396,740

. drop if household_id==0
(3,396,740 observations deleted)

. count
  19,211,121

. 
. noi di "DROP HH>=10 persons:"
DROP HH>=10 persons:

. sum household_size, d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs          19,211,121
25%            2              1       Sum of Wgt.    19211121

50%            3                      Mean           5.100753
                        Largest       Std. Dev.      48.91661
75%            4           3355
90%            6           3355       Variance       2392.835
95%            7           3355       Skewness       43.06023
99%           12           3355       Kurtosis       2447.788

. drop if household_size>=10
(328,642 observations deleted)

. count
  18,882,479

. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. recode male .=9
(male: 295 changes made)

. recode male .u=9
(male: 0 changes made)

. bysort household_id: egen male_drop=max(male)

. drop if male_drop==9
(817 observations deleted)

. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. recode age .=9
(age: 0 changes made)

. recode age .u=9
(age: 0 changes made)

. bysort household_id: egen age_drop=max(age)

. drop if age_drop==9
(13,693 observations deleted)

. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. recode imd .=9
(imd: 0 changes made)

. recode imd .u=9
(imd: 129380 changes made)

. bysort household_id: egen imd_drop=max(imd)

. drop if imd_drop==9
(165,638 observations deleted)

. 
. **************************** HOUSEHOLD VARS*******************************************
. 
. *No kids/kids under 12/up to 18
. *Identify kids under 12, or kids under 18
. gen nokids=1 if age<12
(16,042,202 missing values generated)

. recode nokids .=2 if age<18 
(nokids: 1247784 changes made)

. bysort household_id: egen min_kids=min(nokids) 
(10591994 missing values generated)

. gen kids_cat3=min_kids
(10,591,994 missing values generated)

. recode kids_cat3 .=0 
(kids_cat3: 10591994 changes made)

. lab define kids_cat3  0 "No kids" 1 "Kids under 12" 2 "Kids under 18"

. lab val kids_cat3 kids_cat3

. drop min_kids

. 
. *Dose-response exposure
. recode nokids 2=.
(nokids: 1247784 changes made)

. bysort household_id: egen number_kids=count(nokids)

. gen gp_number_kids=number_kids

. recode gp_number_kids 3/max=3
(gp_number_kids: 206894 changes made)

. recode gp_number_kids 1=2 2=3 3=4
(gp_number_kids: 6247571 changes made)

. replace gp_number_kids=0 if kids_cat3==0 
(0 real changes made)

. replace gp_number_kids=1 if kids_cat3==2 
(1,862,766 real changes made)

. 
. lab var gp_number_kids "Number kids under 12 years in hh"

. drop nokids

. lab define   gp_number_kids 0 none  1 "only >12 years" ///
> 2 "1 child <12" ///
> 3 "2 children <12" ///
> 4 "3+ children <12"

. lab val gp_number_kids gp_number_kids

. 
. tab kids_cat3 gp_number_kids, miss

              |            Number kids under 12 years in hh
    kids_cat3 |      none  only >12   1 child <  2 childre  3+ childr |     Total
--------------+-------------------------------------------------------+----------
      No kids |10,591,994          0          0          0          0 |10,591,994 
Kids under 12 |         0          0  2,996,258  2,353,856    897,457 | 6,247,571 
Kids under 18 |         0  1,862,766          0          0          0 | 1,862,766 
--------------+-------------------------------------------------------+----------
        Total |10,591,994  1,862,766  2,996,258  2,353,856    897,457 |18,702,331 

.  
. /* DROP ALL KIDS, AS HH COMPOSITION VARS ARE NOW MADE */
. drop if age<18
(3,907,913 observations deleted)

. 
. *Total number adults in household (to check hh size)
. bysort household_id: gen tot_adults_hh=_N

. recode tot_adults_hh 3/max=3
(tot_adults_hh: 1779574 changes made)

. 
. 
. /* SET FU DATES===============================================================*/ 
. * Censoring dates for each outcome (largely, last date outcome data available)
. *****NEEDS UPDATING WHEN INFO AVAILABLE*******************
. global tpp_infec_censor                 = "01/02/2020" 

. 
. *Start dates
. global indexdate                            = "01/02/2019"

. 
. 
. 
. 
. 
. 
. 
. 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. rename dereg_date_date                                          dereg_date

. 
. /* CREATE BINARY VARIABLES====================================================*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes_date  ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 dialysis                                        ///
>                                                 kidney_transplant                       ///
>                                                 other_transplant                        ///                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         
. }

. 
. 
. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(2,803,818 real changes made, 2,803,818 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(112,287 real changes made, 112,287 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(2,752,632 missing values generated)

. gen bmi_age = age - bmi_time
(2,752,632 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(32,452 real changes made, 32,452 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(195,925 real changes made, 195,925 to missing)

. replace bmi_measured = . if bmi == . 
(2,948,557 real changes made, 2,948,557 to missing)

. 
. gen     bmicat = .
(14,794,418 missing values generated)

. recode  bmicat . = 1 if bmi < 18.5
(bmicat: 259313 changes made)

. recode  bmicat . = 2 if bmi < 25
(bmicat: 4160827 changes made)

. recode  bmicat . = 3 if bmi < 30
(bmicat: 4104190 changes made)

. recode  bmicat . = 4 if bmi < 35
(bmicat: 2094123 changes made)

. recode  bmicat . = 5 if bmi < 40
(bmicat: 815021 changes made)

. recode  bmicat . = 6 if bmi < .
(bmicat: 412387 changes made)

. replace bmicat = .u if bmi >= .
(2,948,557 real changes made, 2,948,557 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Create less  granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(14535105 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(7,988,345 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(4,834,036 real changes made)

. replace smoke = 3  if smoking_status == "S"
(2,630,177 real changes made)

. replace smoke = .u if smoking_status == "M"
(524,132 real changes made, 524,132 to missing)

. replace smoke = .u if smoking_status == "" 
(0 real changes made)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(524132 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(cancer_haem_date, d(1/1/1900), d(1/2/2015))
(14,739,177 missing values generated)

. replace cancer_haem_cat = 3 if inrange(cancer_haem_date, d(1/2/2015), d(1/2/2019))
(24,378 real changes made)

. replace cancer_haem_cat = 2 if inrange(cancer_haem_date, d(1/2/2019), d(1/2/2020))
(7,705 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 14707094 changes made)

. label values cancer_haem_cat cancer

. 
. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(cancer_nonhaem_date,  d(1/1/1900), d(1/2/2015)) 
(14,322,591 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(cancer_nonhaem_date,  d(1/2/2015), d(1/2/2019))
(203,466 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(cancer_nonhaem_date,  d(1/2/2019), d(1/2/2020)) 
(68,442 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 14050683 changes made)

. label values cancer_exhaem_cat cancer

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(14,756,219 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), date("$indexdate", "DMY"))

. 
. egen other_immuno = rowmax(temp1 temp2)

. drop temp1 temp2 

. order other_immuno, after(temp_immunodef)

. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(10,034,893 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(2,572,133 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(6,804,834 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(3,217,073 real changes made)

. replace bpcat = .u if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(1,451,696 real changes made, 1,451,696 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" .u "Unknown"

. label values bpcat bpcat

. 
. recode bpcat .u=1, gen(bpcat_nomiss)
(1451696 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 1848777 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(3,922,234 real changes made, 3,922,234 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(3,922,234 missing values generated)

. 
. gen min=.
(14,794,418 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(5,946,295 real changes made)

. replace min = SCr_adj/0.9 if male==1
(4,925,889 real changes made)

. replace min = min^-0.329  if male==0
(5,946,295 real changes made)

. replace min = min^-0.411  if male==1
(4,925,889 real changes made)

. replace min = 1 if min<1
(7,196,696 real changes made)

. 
. gen max=.
(14,794,418 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(5,946,295 real changes made)

. replace max=SCr_adj/0.9 if male==1
(4,925,889 real changes made)

. replace max=max^-1.209
(10,872,184 real changes made)

. replace max=1 if max>1
(7,597,722 real changes made)

. 
. gen egfr=min*max*141
(3,922,234 missing values generated)

. replace egfr=egfr*(0.993^age)
(10,872,184 real changes made)

. replace egfr=egfr*1.018 if male==0
(5,946,295 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(3922234 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(10872184 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. *label var ckd "CKD stage calc without eth"
. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
.         
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(10260617 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(3,922,234 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. lab var  reduced "Reduced kidney function"

. 
. 
. 
. /*ESDR: dialysis or kidney transplant*/
. gen esrd=1 if dialysis==1 | kidney_transplant==1
(14,772,032 missing values generated)

. recode esrd .=0
(esrd: 14772032 changes made)

. 
. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(12,725,981 real changes made, 12,725,981 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(6,743,235 real changes made, 6,743,235 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |  2,068,437    15.99381    13305.51        .01   1.91e+07
hba1c_mmol~l |  8,051,183    42.25895     3080.35         .4    8688000

. gen     hba1c_pct = hba1c_percentage 
(12,725,981 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(8,051,181 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(601 real changes made, 601 to missing)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(8,051,255 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(14,716,583 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(1,082,544 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(335,541 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(13,298,498 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |13,298,498          0          0          0 |13,298,498 
         1 |         0     77,835          0          0 |    77,835 
         2 |         0          0  1,082,544          0 | 1,082,544 
         3 |         0          0          0    335,541 |   335,541 
-----------+--------------------------------------------+----------
     Total |13,298,498     77,835  1,082,544    335,541 |14,794,418 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(14,726,408 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(1,080,879 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(13,645,529 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(7,664,574 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(520,234 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(137,612 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(150,335 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(172,176 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |  7,129,844       87.91       87.91
  >=6.5-7.4 |    520,234        6.41       94.33
  >=7.5-7.9 |    137,612        1.70       96.02
    >=8-8.9 |    150,335        1.85       97.88
        >=9 |    172,176        2.12      100.00
------------+-----------------------------------
      Total |  8,110,201      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(7,144,340 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(460,123 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,650,078       51.71       51.71
          1 |    460,123        3.11       54.82
          . |  6,684,217       45.18      100.00
------------+-----------------------------------
      Total | 14,794,418      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(1,495,920 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(20,199 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(56,496 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(679,384 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(397,362 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(6,938 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"            ///
>                                                 3 "T1DM, uncontrolled"          ///
>                                                 4 "T2DM, controlled"            ///
>                                                 5 "T2DM, uncontrolled"          ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 13,298,498       89.89       89.89
  T1DM, controlled |     20,199        0.14       90.03
T1DM, uncontrolled |     56,496        0.38       90.41
  T2DM, controlled |    679,384        4.59       95.00
T2DM, uncontrolled |    397,362        2.69       97.69
Diabetes, no HbA1c |      6,938        0.05       97.73
                 . |    335,541        2.27      100.00
-------------------+-----------------------------------
             Total | 14,794,418      100.00

. 
. 
. 
. /*  Asthma  */
. 
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3
(asthmacat: 14794418 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. /*  Probable shielding  */
. gen shield=1 if esrd==1 | other_transplant==1 | asthmacat==2 | asthmacat==3 | ///
> chronic_respiratory_disease==1 | cancer_haem==1 | cancer_nonhaem==1 | ///
> asplenia==1 | other_immuno==1
(11,227,155 missing values generated)

. recode shield .=0
(shield: 11227155 changes made)

. 
. 
. /* OUTCOME AND SURVIVAL TIME==================================================*/
. 
. /*  Cohort entry and censor dates  */
. * Date of cohort entry, 1 Feb 2019
. gen enter_date = date("$indexdate", "DMY")

. 
. * Date of study end (typically: last date of outcome data available)
. **** NOTE!! NEEDS UPDATING!!!!
. gen tpp_infec_censor_date           = date("$tpp_infec_censor",         "DMY")

.         
. * Format the dates
. format  enter_date                                      ///
>                 tpp_infec_censor_date   %td

.                         
.                 
.                         /****   Outcome definitions   ****/
. 
. 
. * Binary indicator for outcomes
. gen worms = (worms_date < .)

. 
.                                         /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: end study, death, or that outcome)
. gen stime_worms = min(tpp_infec_censor_date, died_date_ons, worms_date, dereg_date)

. 
. * If outcome was after censoring occurred, set to zero
. replace worms   = 0 if (worms_date      > tpp_infec_censor_date) 
(619 real changes made)

. 
. * Format date variables
. format  stime* %td 

. 
. 
. /* LABEL VARIABLES============================================================*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var kids_cat3 "Presence of children or young people in the household"

. label var  number_kids "Number of children aged 1-<12 years in household"

. label var  household_size "Number people in household"

. label var  household_id "Household ID"

. 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age66                                         "66 years and older"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI, kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date measured"

. label var obese4cat                                     "Evidence of obesity (4 categories)"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set to non)"

. label var imd                                           "Index of Multiple Deprivation (IMD)"

. label var ethnicity                                     "Ethnicity"

. label var stp                                           "Sustainability and Transformation Partnership"

. lab var tot_adults_hh                           "Total number adults in hh"

. 
. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma category"

. label var egfr_cat                                              "Calculated eGFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                               "Haematological cancer"

. label var cancer_exhaem_cat                             "Non-haematological cancer"

. label var kidney_transplant                             "Kidney transplant"     

. label var other_transplant                              "Other solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (combination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease"                  

. label var stroke_dementia                           "Stroke or dementia"                                                        

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosuppression"

. lab var temp_immunodef                                  "Temporary immunosuppression"

. lab var esrd                                                    "End-stage renal disease"

. 
. label var hypertension_date                                     "Diagnosed hypertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases Date"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Date"

. label var cancer_haem_date                                      "Haem cancer Date"

. label var cancer_nonhaem_date                           "Non-haem cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological disease  Date"

. label var stroke_dementia_date                      "Stroke or dementia date"                                                   

. label var ra_sle_psoriasis_date                         "Autoimmune disease  Date"

. lab var perm_immunodef_date                             "Permanent immunosuppression date"

. lab var temp_immunodef_date                             "Temporary immunosuppression date"

. label var kidney_transplant_date                                                "Kidney transplant"     

. label var other_transplant_date                                         "Other solid organ transplant"

. label var asplenia_date                                                 "Asplenia date"

. lab var  bphigh "non-missing indicator of known high blood pressure"

. lab var bpcat "Blood pressure four levels, non-missing"

. lab var htdiag_or_highbp "High blood pressure or hypertension diagnosis"

. lab var shield "Probable shielding"

. 
. *Key DATES
. label var   died_date_ons                               "Date death ONS"

. label var enter_date                                    "Date of study entry"

. lab var  dereg_date                                             "Date deregistration from practice"

. 
. 
. *Control outcome
. label var   worms                               "Failure/censoring indicator for outcome: worms"

. label var   worms_date                  "Date of worms"

. label var  stime_worms                  "Survival time (date); outcome worms"

. 
. 
. 
. /* TIDY DATA==================================================================*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
ethnicity_~e  bp_sys_dat~d  crea~te_date  diabetes_e~s  hba1c_per~te  dialysis_d~e  age_drop      min           hba1ccat
care_home_~e  bp_dias       crea~ne_date  diabetes_e~r  cancer_haem   dialysis      imd_drop      max           hba1c75
bmi_measured  bp_dias_da~e  smoki~e_date  hba1c_mmol~l  cancer_non~m  asthmacat     bmi_time      hba1c_pct     tpp_infec_~e
bp_sys        bp_dias_da~d  smoki~s_date  hba1c_mmol~e  esrf_date     diabetes      bmi_age       dm_type
bp_sys_dat~e  creatinine    diabetes_t~e  hba1c_per~ge  esrf          male_drop     SCr_adj       dm_type_ex~s

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS==================================================*/ 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(8 observations deleted)

. 
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if died_date_ons <= date("$indexdate", "DMY")
(0 observations deleted)

.         
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if died_date_ons <= date("$indexdate", "DMY")
(0 observations deleted)

.         
. ***************
. *  Save data  *
. ***************
. sort patient_id

. save $tempdir\analysis_dataset_worms, replace
(note: file tempdata\analysis_dataset_worms.dta not found)
file tempdata\analysis_dataset_worms.dta saved

. 
. 
. 
. use  $tempdir\analysis_dataset_worms, clear

. keep if age66==0
(3,035,846 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir\analysis_dataset_worms_ageband_0, replace
(note: file tempdata\analysis_dataset_worms_ageband_0.dta not found)
file tempdata\analysis_dataset_worms_ageband_0.dta saved

. 
. 
. use  $tempdir\analysis_dataset_worms, clear

. keep if age66==1
(11,758,564 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir\analysis_dataset_worms_ageband_1, replace
(note: file tempdata\analysis_dataset_worms_ageband_1.dta not found)
file tempdata\analysis_dataset_worms_ageband_1.dta saved

. 
. 
. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_worms_ageband_`x', clear
  3. * Save a version set on NON ONS covid death outcome
. stset stime_worms, fail(worms)                          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  4. *WEIGHTING - TO REDUCE TIME 
. set seed 30459820
  5. keep if _d==1|uniform()<.03
  6. gen pw = 1
  7. replace pw = (1/0.03) if _d==0
  8. stset stime_worms [pweight = pw],  fail(worms)                          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  9. save "$tempdir\cr_create_analysis_dataset_STSET_worms_ageband_`x'.dta", replace
 10.         
. }

                id:  patient_id
     failure event:  worms != 0 & worms < .
obs. time interval:  (stime_worms[_n-1], stime_worms]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   11758564  total observations
    199,550  observations end on or before enter()
------------------------------------------------------------------------------
   11559014  observations remaining, representing
   11559014  subjects
      1,436  failures in single-failure-per-subject data
 4.2188e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       365
(11,404,306 observations deleted)
(346,865 real changes made)

                id:  patient_id
     failure event:  worms != 0 & worms < .
obs. time interval:  (stime_worms[_n-1], stime_worms]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
    354,258  total observations
      5,957  observations end on or before enter()
------------------------------------------------------------------------------
    348,301  observations remaining, representing
    348,301  subjects
      1,436  failures in single-failure-per-subject data
  126858154  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       365
(note: file tempdata\cr_create_analysis_dataset_STSET_worms_ageband_0.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_worms_ageband_0.dta saved

                id:  patient_id
     failure event:  worms != 0 & worms < .
obs. time interval:  (stime_worms[_n-1], stime_worms]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
  3,035,846  total observations
      9,535  observations end on or before enter()
------------------------------------------------------------------------------
  3,026,311  observations remaining, representing
  3,026,311  subjects
        106  failures in single-failure-per-subject data
 1.1046e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       365
(2,944,624 observations deleted)
(90,831 real changes made)

                id:  patient_id
     failure event:  worms != 0 & worms < .
obs. time interval:  (stime_worms[_n-1], stime_worms]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
     91,222  total observations
        285  observations end on or before enter()
------------------------------------------------------------------------------
     90,937  observations remaining, representing
     90,937  subjects
        106  failures in single-failure-per-subject data
   33174283  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       365
(note: file tempdata\cr_create_analysis_dataset_STSET_worms_ageband_1.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_worms_ageband_1.dta saved

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\WORMS_01_cr_analysis_dataset.log
  log type:  text
 closed on:  23 Aug 2020, 17:06:40
----------------------------------------------------------------------------------------------------------------------------------
