----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\WORMS_04a_an_descriptive_safetables.log
  log type:  text
 opened on:  23 Aug 2020, 17:21:00

. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_worms_ageband_`x', clear
  3. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. ta shield
 16. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 17.                                                 
. safetab `var'
 18. }
 19. 
. safetab imd 
 20. safetab imd, m
 21. safetab ethnicity
 22. safetab ethnicity, m
 23. safetab stp
 24. 
. 
. * Outcomes
. safetab worms
 25. 
. 
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist worms {
 26. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                        `outvar', col
 27.         safetab male                                                            `outvar', col
 28.         safetab bmicat                                                          `outvar', col m 
 29.         safetab smoke                                                           `outvar', col m
 30.         safetab obese4cat                                                       `outvar', col m 
 31.         safetab shield                                                          `outvar', col m 
 32. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 33.         safetab `var'           `outvar', col
 34. }
 35.         
.         safetab imd                                                             `outvar', col m
 36.         safetab ethnicity                                                       `outvar', col m
 37.         *safetab urban                                                          `outvar', col
.         safetab stp                                                             `outvar', col
 38. }
 39. 
. 
. ********************************************
. *  Cumulative incidence of WORMS
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_worms_ageband_`x'.dta", clear
 40. 
. sts list , at(0 80) by(agegroup male) fail
 41. 
. 
. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 11,758,564    42.00939    13.62003         18         66
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  2,690,079       22.88       22.88
     30-<40 |  2,626,088       22.33       45.21
     40-<50 |  2,426,420       20.64       65.85
     50-<60 |  2,549,194       21.68       87.53
     60-<70 |  1,466,783       12.47      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,758,564      100.00      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  5,861,808       49.85       49.85
          1 |  5,896,756       50.15      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    206,831        2.28        2.28
  Normal (18.5-24.9) |  3,288,594       36.24       38.51
Overweight (25-29.9) |  3,018,083       33.26       71.77
   Obese I (30-34.9) |  1,567,828       17.28       89.05
  Obese II (35-39.9) |    645,654        7.11       96.16
     Obese III (40+) |    348,572        3.84      100.00
---------------------+-----------------------------------
               Total |  9,075,562      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    206,831        1.76        1.76
  Normal (18.5-24.9) |  3,288,594       27.97       29.73
Overweight (25-29.9) |  3,018,083       25.67       55.39
   Obese I (30-34.9) |  1,567,828       13.33       68.73
  Obese II (35-39.9) |    645,654        5.49       74.22
     Obese III (40+) |    348,572        2.96       77.18
        Unknown (.u) |  2,683,002       22.82      100.00
---------------------+-----------------------------------
               Total | 11,758,564      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  9,196,510       78.21       78.21
   Obese I (30-34.9) |  1,567,828       13.33       91.54
  Obese II (35-39.9) |    645,654        5.49       97.04
     Obese III (40+) |    348,572        2.96      100.00
---------------------+-----------------------------------
               Total | 11,758,564      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,589,012       49.67       49.67
      Former |  3,276,141       29.12       78.78
     Current |  2,387,188       21.22      100.00
-------------+-----------------------------------
       Total | 11,252,341      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,589,012       47.53       47.53
      Former |  3,276,141       27.86       75.39
     Current |  2,387,188       20.30       95.69
Unknown (.u) |    506,223        4.31      100.00
-------------+-----------------------------------
       Total | 11,758,564      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  2,987,260       28.91       28.91
      Elevated |  1,675,279       16.22       45.13
 High, stage I |  3,603,933       34.88       80.01
High, stage II |  2,064,987       19.99      100.00
---------------+-----------------------------------
         Total | 10,331,459      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  2,987,260       25.40       25.40
      Elevated |  1,675,279       14.25       39.65
 High, stage I |  3,603,933       30.65       70.30
High, stage II |  2,064,987       17.56       87.86
       Unknown |  1,427,105       12.14      100.00
---------------+-----------------------------------
         Total | 11,758,564      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,858,166       75.33       75.33
          1 |  2,900,398       24.67      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,258,858       78.74       78.74
          1 |  2,499,706       21.26      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,499,851       97.80       97.80
          1 |    258,713        2.20      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,759,118       83.00       83.00
          1 |  1,999,446       17.00      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,384,896       96.82       96.82
          1 |    373,668        3.18      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 10,957,500       94.74       94.74
  T1DM, controlled |     16,337        0.14       94.88
T1DM, uncontrolled |     48,598        0.42       95.30
  T2DM, controlled |    304,980        2.64       97.94
T2DM, uncontrolled |    233,310        2.02       99.96
Diabetes, no HbA1c |      4,912        0.04      100.00
-------------------+-----------------------------------
             Total | 11,565,637      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,468,891       97.54       97.54
    Last year |     31,561        0.27       97.80
2-5 years ago |     92,146        0.78       98.59
     5+ years |    165,966        1.41      100.00
--------------+-----------------------------------
        Total | 11,758,564      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,717,994       99.65       99.65
    Last year |      3,271        0.03       99.68
2-5 years ago |     10,356        0.09       99.77
     5+ years |     26,943        0.23      100.00
--------------+-----------------------------------
        Total | 11,758,564      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,721,818       99.69       99.69
          1 |     36,746        0.31      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,755,584       99.97       99.97
          1 |      2,980        0.03      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,744,104       99.88       99.88
          1 |     14,460        0.12      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,692,967       99.44       99.44
          1 |     65,597        0.56      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,672,598       99.27       99.27
          1 |     85,966        0.73      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,656,017       99.13       99.13
          1 |    102,547        0.87      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,686        0.06        0.06
         15 |      6,763        0.08        0.14
         30 |     17,448        0.22        0.36
         45 |    115,396        1.44        1.80
         60 |  7,864,309       98.20      100.00
------------+-----------------------------------
      Total |  8,008,602      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 11,614,271       98.77       98.77
Stage 3a/3b egfr 30-60       |    132,844        1.13       99.90
           Stage 4/5 egfr<30 |     11,449        0.10      100.00
-----------------------------+-----------------------------------
                       Total | 11,758,564      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,282,504       87.45       87.45
          1 |  1,476,060       12.55      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,216,794       95.39       95.39
          1 |    541,770        4.61      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,273,938       19.34       19.34
               2 |  2,321,363       19.74       39.08
               3 |  2,407,990       20.48       59.56
               4 |  2,464,172       20.96       80.52
 5 most deprived |  2,291,101       19.48      100.00
-----------------+-----------------------------------
           Total | 11,758,564      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,273,938       19.34       19.34
               2 |  2,321,363       19.74       39.08
               3 |  2,407,990       20.48       59.56
               4 |  2,464,172       20.96       80.52
 5 most deprived |  2,291,101       19.48      100.00
-----------------+-----------------------------------
           Total | 11,758,564      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,465,211       83.64       83.64
                 Mixed |    143,599        1.61       85.25
Asian or Asian British |    778,697        8.72       93.97
                 Black |    281,512        3.15       97.13
                 Other |    256,572        2.87      100.00
-----------------------+-----------------------------------
                 Total |  8,925,591      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,465,211       63.49       63.49
                 Mixed |    143,599        1.22       64.71
Asian or Asian British |    778,697        6.62       71.33
                 Black |    281,512        2.39       73.73
                 Other |    256,572        2.18       75.91
               Unknown |  2,832,973       24.09      100.00
-----------------------+-----------------------------------
                 Total | 11,758,564      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,293        0.02        0.02
          2 |  1,137,341        9.67        9.69
          3 |    518,722        4.41       14.10
          4 |    117,233        1.00       15.10
          5 |     82,713        0.70       15.80
          6 |    559,379        4.76       20.56
          7 |     31,210        0.27       20.83
          8 |    440,961        3.75       24.58
          9 |    338,934        2.88       27.46
         10 |    477,392        4.06       31.52
         11 |    526,052        4.47       35.99
         12 |    177,162        1.51       37.50
         13 |    257,716        2.19       39.69
         14 |    327,511        2.79       42.48
         15 |    420,548        3.58       46.05
         16 |    423,430        3.60       49.65
         17 |    362,131        3.08       52.73
         18 |    522,945        4.45       57.18
         19 |    404,636        3.44       60.62
         20 |    590,784        5.02       65.65
         21 |    870,020        7.40       73.05
         22 |     57,633        0.49       73.54
         23 |    443,325        3.77       77.31
         24 |     21,628        0.18       77.49
         25 |    105,199        0.89       78.38
         26 |    366,182        3.11       81.50
         27 |    451,714        3.84       85.34
         28 |    366,781        3.12       88.46
         29 |    301,378        2.56       91.02
         30 |    218,066        1.85       92.88
         31 |     13,793        0.12       92.99
         32 |    823,752        7.01      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      worms |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,557,578       98.29       98.29
          1 |    200,986        1.71      100.00
------------+-----------------------------------
      Total | 11,758,564      100.00
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped |    outcome: worms
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,599,386     90,693 | 2,690,079 
           |     22.49      45.12 |     22.88 
-----------+----------------------+----------
    30-<40 | 2,578,753     47,335 | 2,626,088 
           |     22.31      23.55 |     22.33 
-----------+----------------------+----------
    40-<50 | 2,397,554     28,866 | 2,426,420 
           |     20.74      14.36 |     20.64 
-----------+----------------------+----------
    50-<60 | 2,524,602     24,592 | 2,549,194 
           |     21.84      12.24 |     21.68 
-----------+----------------------+----------
    60-<70 | 1,457,283      9,500 | 1,466,783 
           |     12.61       4.73 |     12.47 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
11

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: worms
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,738,582    123,226 | 5,861,808 
           |     49.65      61.31 |     49.85 
-----------+----------------------+----------
         1 | 5,818,996     77,760 | 5,896,756 
           |     50.35      38.69 |     50.15 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: worms
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   202,154      4,677 |   206,831 
                     |      1.75       2.33 |      1.76 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,230,396     58,198 | 3,288,594 
                     |     27.95      28.96 |     27.97 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,973,449     44,634 | 3,018,083 
                     |     25.73      22.21 |     25.67 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,542,860     24,968 | 1,567,828 
                     |     13.35      12.42 |     13.33 
---------------------+----------------------+----------
  Obese II (35-39.9) |   633,799     11,855 |   645,654 
                     |      5.48       5.90 |      5.49 
---------------------+----------------------+----------
     Obese III (40+) |   341,481      7,091 |   348,572 
                     |      2.95       3.53 |      2.96 
---------------------+----------------------+----------
        Unknown (.u) | 2,633,439     49,563 | 2,683,002 
                     |     22.79      24.66 |     22.82 
---------------------+----------------------+----------
               Total |11,557,578    200,986 |11,758,564 
                     |    100.00     100.00 |    100.00 
12

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking |    outcome: worms
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,495,499     93,513 | 5,589,012 
             |     47.55      46.53 |     47.53 
-------------+----------------------+----------
      Former | 3,224,711     51,430 | 3,276,141 
             |     27.90      25.59 |     27.86 
-------------+----------------------+----------
     Current | 2,341,916     45,272 | 2,387,188 
             |     20.26      22.52 |     20.30 
-------------+----------------------+----------
Unknown (.u) |   495,452     10,771 |   506,223 
             |      4.29       5.36 |      4.31 
-------------+----------------------+----------
       Total |11,557,578    200,986 |11,758,564 
             |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity |    outcome: worms
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,039,438    157,072 | 9,196,510 
                     |     78.21      78.15 |     78.21 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,542,860     24,968 | 1,567,828 
                     |     13.35      12.42 |     13.33 
---------------------+----------------------+----------
  Obese II (35-39.9) |   633,799     11,855 |   645,654 
                     |      5.48       5.90 |      5.49 
---------------------+----------------------+----------
     Obese III (40+) |   341,481      7,091 |   348,572 
                     |      2.95       3.53 |      2.96 
---------------------+----------------------+----------
               Total |11,557,578    200,986 |11,758,564 
                     |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable |    outcome: worms
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,113,932    144,926 | 9,258,858 
           |     78.86      72.11 |     78.74 
-----------+----------------------+----------
         1 | 2,443,646     56,060 | 2,499,706 
           |     21.14      27.89 |     21.26 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator |    outcome: worms
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,302,143    197,708 |11,499,851 
           |     97.79      98.37 |     97.80 
-----------+----------------------+----------
         1 |   255,435      3,278 |   258,713 
           |      2.21       1.63 |      2.20 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma |    outcome: worms
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,608,614    150,504 | 9,759,118 
           |     83.14      74.88 |     83.00 
-----------+----------------------+----------
         1 | 1,948,964     50,482 | 1,999,446 
           |     16.86      25.12 |     17.00 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac |    outcome: worms
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,187,980    196,916 |11,384,896 
           |     96.80      97.97 |     96.82 
-----------+----------------------+----------
         1 |   369,598      4,070 |   373,668 
           |      3.20       2.03 |      3.18 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |    outcome: worms
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |10,765,614    191,886 |10,957,500 
                   |     94.71      96.62 |     94.74 
-------------------+----------------------+----------
  T1DM, controlled |    16,056        281 |    16,337 
                   |      0.14       0.14 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    47,477      1,121 |    48,598 
                   |      0.42       0.56 |      0.42 
-------------------+----------------------+----------
  T2DM, controlled |   302,078      2,902 |   304,980 
                   |      2.66       1.46 |      2.64 
-------------------+----------------------+----------
T2DM, uncontrolled |   230,958      2,352 |   233,310 
                   |      2.03       1.18 |      2.02 
-------------------+----------------------+----------
Diabetes, no HbA1c |     4,858         54 |     4,912 
                   |      0.04       0.03 |      0.04 
-------------------+----------------------+----------
             Total |11,367,041    198,596 |11,565,637 
                   |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo |    outcome: worms
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,271,178    197,713 |11,468,891 
              |     97.52      98.37 |     97.54 
--------------+----------------------+----------
    Last year |    31,223        338 |    31,561 
              |      0.27       0.17 |      0.27 
--------------+----------------------+----------
2-5 years ago |    91,195        951 |    92,146 
              |      0.79       0.47 |      0.78 
--------------+----------------------+----------
     5+ years |   163,982      1,984 |   165,966 
              |      1.42       0.99 |      1.41 
--------------+----------------------+----------
        Total |11,557,578    200,986 |11,758,564 
              |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica |    outcome: worms
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,517,523    200,471 |11,717,994 
              |     99.65      99.74 |     99.65 
--------------+----------------------+----------
    Last year |     3,234         37 |     3,271 
              |      0.03       0.02 |      0.03 
--------------+----------------------+----------
2-5 years ago |    10,240        116 |    10,356 
              |      0.09       0.06 |      0.09 
--------------+----------------------+----------
     5+ years |    26,581        362 |    26,943 
              |      0.23       0.18 |      0.23 
--------------+----------------------+----------
        Total |11,557,578    200,986 |11,758,564 
              |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on |    outcome: worms
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |11,521,359    200,459 |11,721,818 
           |     99.69      99.74 |     99.69 
-----------+----------------------+----------
         1 |    36,219        527 |    36,746 
           |      0.31       0.26 |      0.31 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |   Failure/censoring
     solid |     indicator for
     organ |    outcome: worms
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |11,554,632    200,952 |11,755,584 
           |     99.97      99.98 |     99.97 
-----------+----------------------+----------
         1 |     2,946         34 |     2,980 
           |      0.03       0.02 |      0.03 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: worms
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,543,315    200,789 |11,744,104 
           |     99.88      99.90 |     99.88 
-----------+----------------------+----------
         1 |    14,263        197 |    14,460 
           |      0.12       0.10 |      0.12 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver |    outcome: worms
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,492,664    200,303 |11,692,967 
           |     99.44      99.66 |     99.44 
-----------+----------------------+----------
         1 |    64,914        683 |    65,597 
           |      0.56       0.34 |      0.56 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic |    outcome: worms
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,472,886    199,712 |11,672,598 
           |     99.27      99.37 |     99.27 
-----------+----------------------+----------
         1 |    84,692      1,274 |    85,966 
           |      0.73       0.63 |      0.73 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or |    outcome: worms
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,456,162    199,855 |11,656,017 
           |     99.12      99.44 |     99.13 
-----------+----------------------+----------
         1 |   101,416      1,131 |   102,547 
           |      0.88       0.56 |      0.87 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Calculated |    outcome: worms
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,649         37 |     4,686 
           |      0.06       0.03 |      0.06 
-----------+----------------------+----------
        15 |     6,693         70 |     6,763 
           |      0.09       0.05 |      0.08 
-----------+----------------------+----------
        30 |    17,297        151 |    17,448 
           |      0.22       0.11 |      0.22 
-----------+----------------------+----------
        45 |   114,384      1,012 |   115,396 
           |      1.45       0.71 |      1.44 
-----------+----------------------+----------
        60 | 7,722,875    141,434 | 7,864,309 
           |     98.18      99.11 |     98.20 
-----------+----------------------+----------
     Total | 7,865,898    142,704 | 8,008,602 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney |    outcome: worms
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,414,555    199,716 |11,614,271 
                      |     98.76      99.37 |     98.77 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   131,681      1,163 |   132,844 
                      |      1.14       0.58 |      1.13 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,342        107 |    11,449 
                      |      0.10       0.05 |      0.10 
----------------------+----------------------+----------
                Total |11,557,578    200,986 |11,758,564 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi |    outcome: worms
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,095,080    187,424 |10,282,504 
           |     87.35      93.25 |     87.45 
-----------+----------------------+----------
         1 | 1,462,498     13,562 | 1,476,060 
           |     12.65       6.75 |     12.55 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune |    outcome: worms
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,026,440    190,354 |11,216,794 
           |     95.40      94.71 |     95.39 
-----------+----------------------+----------
         1 |   531,138     10,632 |   541,770 
           |      4.60       5.29 |      4.61 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 
10

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation |    outcome: worms
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,238,922     35,016 | 2,273,938 
                 |     19.37      17.42 |     19.34 
-----------------+----------------------+----------
               2 | 2,284,363     37,000 | 2,321,363 
                 |     19.77      18.41 |     19.74 
-----------------+----------------------+----------
               3 | 2,368,013     39,977 | 2,407,990 
                 |     20.49      19.89 |     20.48 
-----------------+----------------------+----------
               4 | 2,420,423     43,749 | 2,464,172 
                 |     20.94      21.77 |     20.96 
-----------------+----------------------+----------
 5 most deprived | 2,245,857     45,244 | 2,291,101 
                 |     19.43      22.51 |     19.48 
-----------------+----------------------+----------
           Total |11,557,578    200,986 |11,758,564 
                 |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: worms
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,338,656    126,555 | 7,465,211 
                      |     63.50      62.97 |     63.49 
----------------------+----------------------+----------
                Mixed |   141,743      1,856 |   143,599 
                      |      1.23       0.92 |      1.22 
----------------------+----------------------+----------
Asian or Asian Britis |   772,525      6,172 |   778,697 
                      |      6.68       3.07 |      6.62 
----------------------+----------------------+----------
                Black |   278,795      2,717 |   281,512 
                      |      2.41       1.35 |      2.39 
----------------------+----------------------+----------
                Other |   254,924      1,648 |   256,572 
                      |      2.21       0.82 |      2.18 
----------------------+----------------------+----------
              Unknown | 2,770,935     62,038 | 2,832,973 
                      |     23.98      30.87 |     24.09 
----------------------+----------------------+----------
                Total |11,557,578    200,986 |11,758,564 
                      |    100.00     100.00 |    100.00 
10

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi |    outcome: worms
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     2,257         36 |     2,293 
           |      0.02       0.02 |      0.02 
-----------+----------------------+----------
         2 | 1,119,251     18,090 | 1,137,341 
           |      9.68       9.00 |      9.67 
-----------+----------------------+----------
         3 |   508,952      9,770 |   518,722 
           |      4.40       4.86 |      4.41 
-----------+----------------------+----------
         4 |   115,368      1,865 |   117,233 
           |      1.00       0.93 |      1.00 
-----------+----------------------+----------
         5 |    81,145      1,568 |    82,713 
           |      0.70       0.78 |      0.70 
-----------+----------------------+----------
         6 |   549,367     10,012 |   559,379 
           |      4.75       4.98 |      4.76 
-----------+----------------------+----------
         7 |    30,863        347 |    31,210 
           |      0.27       0.17 |      0.27 
-----------+----------------------+----------
         8 |   431,605      9,356 |   440,961 
           |      3.73       4.66 |      3.75 
-----------+----------------------+----------
         9 |   332,209      6,725 |   338,934 
           |      2.87       3.35 |      2.88 
-----------+----------------------+----------
        10 |   469,325      8,067 |   477,392 
           |      4.06       4.01 |      4.06 
-----------+----------------------+----------
        11 |   517,617      8,435 |   526,052 
           |      4.48       4.20 |      4.47 
-----------+----------------------+----------
        12 |   175,092      2,070 |   177,162 
           |      1.51       1.03 |      1.51 
-----------+----------------------+----------
        13 |   252,982      4,734 |   257,716 
           |      2.19       2.36 |      2.19 
-----------+----------------------+----------
        14 |   321,697      5,814 |   327,511 
           |      2.78       2.89 |      2.79 
-----------+----------------------+----------
        15 |   412,015      8,533 |   420,548 
           |      3.56       4.25 |      3.58 
-----------+----------------------+----------
        16 |   414,095      9,335 |   423,430 
           |      3.58       4.64 |      3.60 
-----------+----------------------+----------
        17 |   354,761      7,370 |   362,131 
           |      3.07       3.67 |      3.08 
-----------+----------------------+----------
        18 |   513,471      9,474 |   522,945 
           |      4.44       4.71 |      4.45 
-----------+----------------------+----------
        19 |   398,915      5,721 |   404,636 
           |      3.45       2.85 |      3.44 
-----------+----------------------+----------
        20 |   582,991      7,793 |   590,784 
           |      5.04       3.88 |      5.02 
-----------+----------------------+----------
        21 |   862,444      7,576 |   870,020 
           |      7.46       3.77 |      7.40 
-----------+----------------------+----------
        22 |    57,071        562 |    57,633 
           |      0.49       0.28 |      0.49 
-----------+----------------------+----------
        23 |   436,345      6,980 |   443,325 
           |      3.78       3.47 |      3.77 
-----------+----------------------+----------
        24 |    21,258        370 |    21,628 
           |      0.18       0.18 |      0.18 
-----------+----------------------+----------
        25 |   103,800      1,399 |   105,199 
           |      0.90       0.70 |      0.89 
-----------+----------------------+----------
        26 |   359,068      7,114 |   366,182 
           |      3.11       3.54 |      3.11 
-----------+----------------------+----------
        27 |   444,413      7,301 |   451,714 
           |      3.85       3.63 |      3.84 
-----------+----------------------+----------
        28 |   361,244      5,537 |   366,781 
           |      3.13       2.75 |      3.12 
-----------+----------------------+----------
        29 |   295,868      5,510 |   301,378 
           |      2.56       2.74 |      2.56 
-----------+----------------------+----------
        30 |   213,948      4,118 |   218,066 
           |      1.85       2.05 |      1.85 
-----------+----------------------+----------
        31 |    13,647        146 |    13,793 
           |      0.12       0.07 |      0.12 
-----------+----------------------+----------
        32 |   804,494     19,258 |   823,752 
           |      6.96       9.58 |      7.01 
-----------+----------------------+----------
     Total |11,557,578    200,986 |11,758,564 
           |    100.00     100.00 |    100.00 

         failure _d:  worms
   analysis time _t:  (stime_worms-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000 
      80   1.3e+06       75              0.0001 
18-<30 male=1 
       0         0        0              0.0000 
      80   1.3e+06       31              0.0000 
30-<40 male=0 
       0         0        0              0.0000 
      80   1.3e+06       96              0.0001 
30-<40 male=1 
       0         0        0              0.0000 
      80   1.3e+06       32              0.0000 
40-<50 male=0 
       0         0        0              0.0000 
      80   1.2e+06       40              0.0000 
40-<50 male=1 
       0         0        0              0.0000 
      80   1.2e+06       32              0.0000 
50-<60 male=0 
       0         0        0              0.0000 
      80   1.2e+06       27              0.0000 
50-<60 male=1 
       0         0        0              0.0000 
      80   1.3e+06       25              0.0000 
60-<70 male=0 
       0         0        0              0.0000 
      80    747769       14              0.0000 
60-<70 male=1 
       0         0        0              0.0000 
      80    716692       11              0.0000 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  3,035,846    75.69269     6.65558         67        110
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |    585,936       19.30       19.30
     70-<80 |  1,623,159       53.47       72.77
        80+ |    826,751       27.23      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  3,035,846      100.00      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,636,648       53.91       53.91
          1 |  1,399,198       46.09      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     52,482        1.89        1.89
  Normal (18.5-24.9) |    872,232       31.49       33.38
Overweight (25-29.9) |  1,086,105       39.21       72.58
   Obese I (30-34.9) |    526,295       19.00       91.58
  Obese II (35-39.9) |    169,367        6.11       97.70
     Obese III (40+) |     63,815        2.30      100.00
---------------------+-----------------------------------
               Total |  2,770,296      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     52,482        1.73        1.73
  Normal (18.5-24.9) |    872,232       28.73       30.46
Overweight (25-29.9) |  1,086,105       35.78       66.24
   Obese I (30-34.9) |    526,295       17.34       83.57
  Obese II (35-39.9) |    169,367        5.58       89.15
     Obese III (40+) |     63,815        2.10       91.25
        Unknown (.u) |    265,550        8.75      100.00
---------------------+-----------------------------------
               Total |  3,035,846      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  2,276,369       74.98       74.98
   Obese I (30-34.9) |    526,295       17.34       92.32
  Obese II (35-39.9) |    169,367        5.58       97.90
     Obese III (40+) |     63,815        2.10      100.00
---------------------+-----------------------------------
               Total |  3,035,846      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,217,058       40.33       40.33
      Former |  1,557,894       51.62       91.95
     Current |    242,988        8.05      100.00
-------------+-----------------------------------
       Total |  3,017,940      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,217,058       40.09       40.09
      Former |  1,557,894       51.32       91.41
     Current |    242,988        8.00       99.41
Unknown (.u) |     17,906        0.59      100.00
-------------+-----------------------------------
       Total |  3,035,846      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    322,324       10.70       10.70
      Elevated |    455,992       15.14       25.85
 High, stage I |  1,081,357       35.91       61.76
High, stage II |  1,151,585       38.24      100.00
---------------+-----------------------------------
         Total |  3,011,258      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    322,324       10.62       10.62
      Elevated |    455,992       15.02       25.64
 High, stage I |  1,081,357       35.62       61.26
High, stage II |  1,151,585       37.93       99.19
       Unknown |     24,588        0.81      100.00
---------------+-----------------------------------
         Total |  3,035,846      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    870,896       28.69       28.69
          1 |  2,164,950       71.31      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,968,291       64.84       64.84
          1 |  1,067,555       35.16      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,664,091       87.75       87.75
          1 |    371,755       12.25      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,654,281       87.43       87.43
          1 |    381,565       12.57      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,369,707       78.06       78.06
          1 |    666,139       21.94      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |  2,340,991       80.91       80.91
  T1DM, controlled |      3,862        0.13       81.05
T1DM, uncontrolled |      7,898        0.27       81.32
  T2DM, controlled |    374,404       12.94       94.26
T2DM, uncontrolled |    164,052        5.67       99.93
Diabetes, no HbA1c |      2,025        0.07      100.00
-------------------+-----------------------------------
             Total |  2,893,232      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  2,581,784       85.04       85.04
    Last year |     36,881        1.21       86.26
2-5 years ago |    111,320        3.67       89.93
     5+ years |    305,861       10.07      100.00
--------------+-----------------------------------
        Total |  3,035,846      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  2,989,092       98.46       98.46
    Last year |      4,434        0.15       98.61
2-5 years ago |     14,022        0.46       99.07
     5+ years |     28,298        0.93      100.00
--------------+-----------------------------------
        Total |  3,035,846      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,030,553       99.83       99.83
          1 |      5,293        0.17      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,034,948       99.97       99.97
          1 |        898        0.03      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,028,341       99.75       99.75
          1 |      7,505        0.25      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,009,009       99.12       99.12
          1 |     26,837        0.88      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,975,208       98.00       98.00
          1 |     60,638        2.00      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,799,745       92.22       92.22
          1 |    236,101        7.78      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,689        0.20        0.20
         15 |     36,880        1.29        1.49
         30 |    174,993        6.11        7.60
         45 |    496,168       17.33       24.92
         60 |  2,149,849       75.08      100.00
------------+-----------------------------------
      Total |  2,863,579      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |  2,322,116       76.49       76.49
Stage 3a/3b egfr 30-60       |    671,161       22.11       98.60
           Stage 4/5 egfr<30 |     42,569        1.40      100.00
-----------------------------+-----------------------------------
                       Total |  3,035,846      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,289,227       42.47       42.47
          1 |  1,746,619       57.53      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,803,226       92.34       92.34
          1 |    232,620        7.66      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    768,138       25.30       25.30
               2 |    709,685       23.38       48.68
               3 |    653,905       21.54       70.22
               4 |    525,790       17.32       87.54
 5 most deprived |    378,328       12.46      100.00
-----------------+-----------------------------------
           Total |  3,035,846      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    768,138       25.30       25.30
               2 |    709,685       23.38       48.68
               3 |    653,905       21.54       70.22
               4 |    525,790       17.32       87.54
 5 most deprived |    378,328       12.46      100.00
-----------------+-----------------------------------
           Total |  3,035,846      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,097,159       94.54       94.54
                 Mixed |      7,963        0.36       94.90
Asian or Asian British |     73,276        3.30       98.21
                 Black |     22,659        1.02       99.23
                 Other |     17,137        0.77      100.00
-----------------------+-----------------------------------
                 Total |  2,218,194      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,097,159       69.08       69.08
                 Mixed |      7,963        0.26       69.34
Asian or Asian British |     73,276        2.41       71.76
                 Black |     22,659        0.75       72.50
                 Other |     17,137        0.56       73.07
               Unknown |    817,652       26.93      100.00
-----------------------+-----------------------------------
                 Total |  3,035,846      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        159        0.01        0.01
          2 |    251,340        8.28        8.28
          3 |    136,158        4.49       12.77
          4 |     29,633        0.98       13.75
          5 |     20,662        0.68       14.43
          6 |    141,914        4.67       19.10
          7 |      7,896        0.26       19.36
          8 |    120,206        3.96       23.32
          9 |    112,846        3.72       27.04
         10 |    124,360        4.10       31.13
         11 |    124,222        4.09       35.23
         12 |     33,784        1.11       36.34
         13 |     58,886        1.94       38.28
         14 |     73,870        2.43       40.71
         15 |     97,621        3.22       43.93
         16 |    145,880        4.81       48.73
         17 |    108,496        3.57       52.31
         18 |    108,496        3.57       55.88
         19 |     96,528        3.18       59.06
         20 |    159,093        5.24       64.30
         21 |    114,829        3.78       68.08
         22 |      8,029        0.26       68.35
         23 |    131,469        4.33       72.68
         24 |      7,115        0.23       72.91
         25 |     37,408        1.23       74.14
         26 |    133,213        4.39       78.53
         27 |    128,769        4.24       82.77
         28 |    132,502        4.36       87.14
         29 |     85,663        2.82       89.96
         30 |     67,054        2.21       92.17
         31 |      4,332        0.14       92.31
         32 |    233,413        7.69      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      worms |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,026,205       99.68       99.68
          1 |      9,641        0.32      100.00
------------+-----------------------------------
      Total |  3,035,846      100.00
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped |    outcome: worms
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   583,221      2,715 |   585,936 
           |     19.27      28.16 |     19.30 
-----------+----------------------+----------
    70-<80 | 1,617,953      5,206 | 1,623,159 
           |     53.46      54.00 |     53.47 
-----------+----------------------+----------
       80+ |   825,031      1,720 |   826,751 
           |     27.26      17.84 |     27.23 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
11

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: worms
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,630,753      5,895 | 1,636,648 
           |     53.89      61.15 |     53.91 
-----------+----------------------+----------
         1 | 1,395,452      3,746 | 1,399,198 
           |     46.11      38.85 |     46.09 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: worms
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    52,323        159 |    52,482 
                     |      1.73       1.65 |      1.73 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   869,345      2,887 |   872,232 
                     |     28.73      29.95 |     28.73 
---------------------+----------------------+----------
Overweight (25-29.9) | 1,082,601      3,504 | 1,086,105 
                     |     35.77      36.34 |     35.78 
---------------------+----------------------+----------
   Obese I (30-34.9) |   524,677      1,618 |   526,295 
                     |     17.34      16.78 |     17.34 
---------------------+----------------------+----------
  Obese II (35-39.9) |   168,810        557 |   169,367 
                     |      5.58       5.78 |      5.58 
---------------------+----------------------+----------
     Obese III (40+) |    63,572        243 |    63,815 
                     |      2.10       2.52 |      2.10 
---------------------+----------------------+----------
        Unknown (.u) |   264,877        673 |   265,550 
                     |      8.75       6.98 |      8.75 
---------------------+----------------------+----------
               Total | 3,026,205      9,641 | 3,035,846 
                     |    100.00     100.00 |    100.00 
12

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking |    outcome: worms
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,212,927      4,131 | 1,217,058 
             |     40.08      42.85 |     40.09 
-------------+----------------------+----------
      Former | 1,553,045      4,849 | 1,557,894 
             |     51.32      50.30 |     51.32 
-------------+----------------------+----------
     Current |   242,337        651 |   242,988 
             |      8.01       6.75 |      8.00 
-------------+----------------------+----------
Unknown (.u) |    17,896         10 |    17,906 
             |      0.59       0.10 |      0.59 
-------------+----------------------+----------
       Total | 3,026,205      9,641 | 3,035,846 
             |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity |    outcome: worms
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 2,269,146      7,223 | 2,276,369 
                     |     74.98      74.92 |     74.98 
---------------------+----------------------+----------
   Obese I (30-34.9) |   524,677      1,618 |   526,295 
                     |     17.34      16.78 |     17.34 
---------------------+----------------------+----------
  Obese II (35-39.9) |   168,810        557 |   169,367 
                     |      5.58       5.78 |      5.58 
---------------------+----------------------+----------
     Obese III (40+) |    63,572        243 |    63,815 
                     |      2.10       2.52 |      2.10 
---------------------+----------------------+----------
               Total | 3,026,205      9,641 | 3,035,846 
                     |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable |    outcome: worms
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,962,330      5,961 | 1,968,291 
           |     64.84      61.83 |     64.84 
-----------+----------------------+----------
         1 | 1,063,875      3,680 | 1,067,555 
           |     35.16      38.17 |     35.16 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator |    outcome: worms
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,655,727      8,364 | 2,664,091 
           |     87.76      86.75 |     87.75 
-----------+----------------------+----------
         1 |   370,478      1,277 |   371,755 
           |     12.24      13.25 |     12.25 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma |    outcome: worms
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,646,227      8,054 | 2,654,281 
           |     87.44      83.54 |     87.43 
-----------+----------------------+----------
         1 |   379,978      1,587 |   381,565 
           |     12.56      16.46 |     12.57 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac |    outcome: worms
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,362,102      7,605 | 2,369,707 
           |     78.05      78.88 |     78.06 
-----------+----------------------+----------
         1 |   664,103      2,036 |   666,139 
           |     21.95      21.12 |     21.94 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |    outcome: worms
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,333,519      7,472 | 2,340,991 
                   |     80.91      81.59 |     80.91 
-------------------+----------------------+----------
  T1DM, controlled |     3,849         13 |     3,862 
                   |      0.13       0.14 |      0.13 
-------------------+----------------------+----------
T1DM, uncontrolled |     7,863         35 |     7,898 
                   |      0.27       0.38 |      0.27 
-------------------+----------------------+----------
  T2DM, controlled |   373,353      1,051 |   374,404 
                   |     12.95      11.48 |     12.94 
-------------------+----------------------+----------
T2DM, uncontrolled |   163,472        580 |   164,052 
                   |      5.67       6.33 |      5.67 
-------------------+----------------------+----------
Diabetes, no HbA1c |     2,018          7 |     2,025 
                   |      0.07       0.08 |      0.07 
-------------------+----------------------+----------
             Total | 2,884,074      9,158 | 2,893,232 
                   |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo |    outcome: worms
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,573,507      8,277 | 2,581,784 
              |     85.04      85.85 |     85.04 
--------------+----------------------+----------
    Last year |    36,774        107 |    36,881 
              |      1.22       1.11 |      1.21 
--------------+----------------------+----------
2-5 years ago |   111,030        290 |   111,320 
              |      3.67       3.01 |      3.67 
--------------+----------------------+----------
     5+ years |   304,894        967 |   305,861 
              |     10.08      10.03 |     10.07 
--------------+----------------------+----------
        Total | 3,026,205      9,641 | 3,035,846 
              |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica |    outcome: worms
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,979,613      9,479 | 2,989,092 
              |     98.46      98.32 |     98.46 
--------------+----------------------+----------
    Last year |     4,417         17 |     4,434 
              |      0.15       0.18 |      0.15 
--------------+----------------------+----------
2-5 years ago |    13,963         59 |    14,022 
              |      0.46       0.61 |      0.46 
--------------+----------------------+----------
     5+ years |    28,212         86 |    28,298 
              |      0.93       0.89 |      0.93 
--------------+----------------------+----------
        Total | 3,026,205      9,641 | 3,035,846 
              |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on |    outcome: worms
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,020,938      9,615 | 3,030,553 
           |     99.83      99.73 |     99.83 
-----------+----------------------+----------
         1 |     5,267         26 |     5,293 
           |      0.17       0.27 |      0.17 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
23

**TABLE OF other_transplant worms REDACTED DUE TO SMALL N**

15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: worms
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,018,721      9,620 | 3,028,341 
           |     99.75      99.78 |     99.75 
-----------+----------------------+----------
         1 |     7,484         21 |     7,505 
           |      0.25       0.22 |      0.25 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver |    outcome: worms
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,999,461      9,548 | 3,009,009 
           |     99.12      99.04 |     99.12 
-----------+----------------------+----------
         1 |    26,744         93 |    26,837 
           |      0.88       0.96 |      0.88 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic |    outcome: worms
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,965,806      9,402 | 2,975,208 
           |     98.00      97.52 |     98.00 
-----------+----------------------+----------
         1 |    60,399        239 |    60,638 
           |      2.00       2.48 |      2.00 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or |    outcome: worms
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,790,812      8,933 | 2,799,745 
           |     92.22      92.66 |     92.22 
-----------+----------------------+----------
         1 |   235,393        708 |   236,101 
           |      7.78       7.34 |      7.78 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Calculated |    outcome: worms
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,672         17 |     5,689 
           |      0.20       0.18 |      0.20 
-----------+----------------------+----------
        15 |    36,802         78 |    36,880 
           |      1.29       0.84 |      1.29 
-----------+----------------------+----------
        30 |   174,584        409 |   174,993 
           |      6.12       4.42 |      6.11 
-----------+----------------------+----------
        45 |   494,802      1,366 |   496,168 
           |     17.34      14.75 |     17.33 
-----------+----------------------+----------
        60 | 2,142,457      7,392 | 2,149,849 
           |     75.06      79.81 |     75.08 
-----------+----------------------+----------
     Total | 2,854,317      9,262 | 2,863,579 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney |    outcome: worms
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,314,345      7,771 | 2,322,116 
                      |     76.48      80.60 |     76.49 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   669,386      1,775 |   671,161 
                      |     22.12      18.41 |     22.11 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    42,474         95 |    42,569 
                      |      1.40       0.99 |      1.40 
----------------------+----------------------+----------
                Total | 3,026,205      9,641 | 3,035,846 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi |    outcome: worms
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,284,750      4,477 | 1,289,227 
           |     42.45      46.44 |     42.47 
-----------+----------------------+----------
         1 | 1,741,455      5,164 | 1,746,619 
           |     57.55      53.56 |     57.53 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune |    outcome: worms
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,794,444      8,782 | 2,803,226 
           |     92.34      91.09 |     92.34 
-----------+----------------------+----------
         1 |   231,761        859 |   232,620 
           |      7.66       8.91 |      7.66 
-----------+----------------------+----------
     Total | 3,026,205      9,641 | 3,035,846 
           |    100.00     100.00 |    100.00 
10

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation |    outcome: worms
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   765,660      2,478 |   768,138 
                 |     25.30      25.70 |     25.30 
-----------------+----------------------+----------
               2 |   707,525      2,160 |   709,685 
                 |     23.38      22.40 |     23.38 
-----------------+----------------------+----------
               3 |   651,995      1,910 |   653,905 
                 |     21.54      19.81 |     21.54 
-----------------+----------------------+----------
               4 |   524,094      1,696 |   525,790 
                 |     17.32      17.59 |     17.32 
-----------------+----------------------+----------
 5 most deprived |   376,931      1,397 |   378,328 
                 |     12.46      14.49 |     12.46 
-----------------+----------------------+----------
           Total | 3,026,205      9,641 | 3,035,846 
                 |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: worms
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,090,555      6,604 | 2,097,159 
                      |     69.08      68.50 |     69.08 
----------------------+----------------------+----------
                Mixed |     7,941         22 |     7,963 
                      |      0.26       0.23 |      0.26 
----------------------+----------------------+----------
Asian or Asian Britis |    72,916        360 |    73,276 
                      |      2.41       3.73 |      2.41 
----------------------+----------------------+----------
                Black |    22,596         63 |    22,659 
                      |      0.75       0.65 |      0.75 
----------------------+----------------------+----------
                Other |    17,066         71 |    17,137 
                      |      0.56       0.74 |      0.56 
----------------------+----------------------+----------
              Unknown |   815,131      2,521 |   817,652 
                      |     26.94      26.15 |     26.93 
----------------------+----------------------+----------
                Total | 3,026,205      9,641 | 3,035,846 
                      |    100.00     100.00 |    100.00 
10

**TABLE OF stp worms REDACTED DUE TO SMALL N**


         failure _d:  worms
   analysis time _t:  (stime_worms-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000 
      80    299912        1              0.0000 
60-<70 male=1 
       0         0        0              0.0000 
      80    285975        2              0.0000 
70-<80 male=0 
       0         0        0              0.0000 
      80    844341        7              0.0000 
70-<80 male=1 
       0         0        0              0.0000 
      80    767953        5              0.0000 
80+ male=0 
       0         0        0              0.0000 
      80    487878        1              0.0000 
80+ male=1 
       0         0        0              0.0000 
      80    341737        2              0.0000 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

. * Close the log file
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\WORMS_04a_an_descriptive_safetables.log
  log type:  text
 closed on:  23 Aug 2020, 17:28:12
----------------------------------------------------------------------------------------------------------------------------------
