------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07a_an_multivariable_cox_models_covid_death_icu.log
  log type:  text
 opened on:  26 Aug 2020, 18:36:45

. 
. 
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure'                                      ///
>                         $demogadjlist                                   ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  4. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
. }
  9. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 10. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 11. if _rc==0{
 12. estimates
 13. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_ageband_`x', replace
 14. *estat concordance /*c-statistic*/
.  }
 15.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 16. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.bmicat) smoking(i.smoke)
 17. if _rc==0{
 18. estimates
 19. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_bmi_smok_ageband_`x', replace
 20. *estat concordance /*c-statistic*/
.  }
 21.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 22.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.bmicat) smoking(i.smoke)
 23. if _rc==0{
 24. estimates
 25. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCnoeth_bmi_smok_ageband_`x', replace
 26. *estat concordance /*c-statistic*/
.  }
 27.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 28.  
. }
 29. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 30. foreach exposure_type in kids_cat3   {
 31. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 32. if _rc==0{
 33. estimates
 34. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo_ageband_`x', replace
 35. *estat concordance /*c-statistic*/
. }
 36. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
 37. 
. 
. }       
 38. 
. }       
   1:   2003.81 /        1 =    2003.8140

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =        2,718
Time at risk         =   2216762290
                                                Wald chi2(12)    =     2350.09
Log pseudolikelihood =   -34018.705             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   1.002725   .0609633     0.04   0.964     .8900834    1.129621
  Kids under 18  |   1.079084   .0763476     1.08   0.282     .9393569    1.239594
                 |
            age1 |   1.142865   .0241353     6.32   0.000     1.096526    1.191162
            age2 |   .9536546   .0462021    -0.98   0.327     .8672665    1.048648
            age3 |   1.053338   .1241258     0.44   0.659     .8361072    1.327009
          1.male |   1.873027   .0757238    15.52   0.000     1.730339    2.027482
                 |
             imd |
              2  |   1.192413   .0859181     2.44   0.015     1.035367     1.37328
              3  |   1.446314    .101221     5.27   0.000      1.26093    1.658954
              4  |   2.031608   .1344246    10.71   0.000     1.784509    2.312923
5 most deprived  |   2.368444   .1611201    12.67   0.000     2.072802    2.706254
                 |
   tot_adults_hh |
              2  |   .8319161   .0431359    -3.55   0.000     .7515253    .9209063
              3  |   1.105837   .0553395     2.01   0.044     1.002524    1.219798
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_noeth_ageband_0.ster saved
   1:   1676.21 /        1 =    1676.2070

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =        2,718
Time at risk         =   2216762290
                                                Wald chi2(12)    =     2350.09
Log pseudolikelihood =   -34018.705             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   1.002725   .0609633     0.04   0.964     .8900834    1.129621
  Kids under 18  |   1.079084   .0763476     1.08   0.282     .9393569    1.239594
                 |
            age1 |   1.142865   .0241353     6.32   0.000     1.096526    1.191162
            age2 |   .9536546   .0462021    -0.98   0.327     .8672665    1.048648
            age3 |   1.053338   .1241258     0.44   0.659     .8361072    1.327009
          1.male |   1.873027   .0757238    15.52   0.000     1.730339    2.027482
                 |
             imd |
              2  |   1.192413   .0859181     2.44   0.015     1.035367     1.37328
              3  |   1.446314    .101221     5.27   0.000      1.26093    1.658954
              4  |   2.031608   .1344246    10.71   0.000     1.784509    2.312923
5 most deprived  |   2.368444   .1611201    12.67   0.000     2.072802    2.706254
                 |
   tot_adults_hh |
              2  |   .8319161   .0431359    -3.55   0.000     .7515253    .9209063
              3  |   1.105837   .0553395     2.01   0.044     1.002524    1.219798
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCeth_ageband_0.ster saved
   1:   1715.16 /        1 =    1715.1560

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =        2,718
Time at risk         =   2216762290
                                                Wald chi2(12)    =     2350.09
Log pseudolikelihood =   -34018.705             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   1.002725   .0609633     0.04   0.964     .8900834    1.129621
  Kids under 18  |   1.079084   .0763476     1.08   0.282     .9393569    1.239594
                 |
            age1 |   1.142865   .0241353     6.32   0.000     1.096526    1.191162
            age2 |   .9536546   .0462021    -0.98   0.327     .8672665    1.048648
            age3 |   1.053338   .1241258     0.44   0.659     .8361072    1.327009
          1.male |   1.873027   .0757238    15.52   0.000     1.730339    2.027482
                 |
             imd |
              2  |   1.192413   .0859181     2.44   0.015     1.035367     1.37328
              3  |   1.446314    .101221     5.27   0.000      1.26093    1.658954
              4  |   2.031608   .1344246    10.71   0.000     1.784509    2.312923
5 most deprived  |   2.368444   .1611201    12.67   0.000     2.072802    2.706254
                 |
   tot_adults_hh |
              2  |   .8319161   .0431359    -3.55   0.000     .7515253    .9209063
              3  |   1.105837   .0553395     2.01   0.044     1.002524    1.219798
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster saved
   1:   1671.88 /        1 =    1671.8850

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =        2,718
Time at risk         =   2216762290
                                                Wald chi2(12)    =     2350.09
Log pseudolikelihood =   -34018.705             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   1.002725   .0609633     0.04   0.964     .8900834    1.129621
  Kids under 18  |   1.079084   .0763476     1.08   0.282     .9393569    1.239594
                 |
            age1 |   1.142865   .0241353     6.32   0.000     1.096526    1.191162
            age2 |   .9536546   .0462021    -0.98   0.327     .8672665    1.048648
            age3 |   1.053338   .1241258     0.44   0.659     .8361072    1.327009
          1.male |   1.873027   .0757238    15.52   0.000     1.730339    2.027482
                 |
             imd |
              2  |   1.192413   .0859181     2.44   0.015     1.035367     1.37328
              3  |   1.446314    .101221     5.27   0.000      1.26093    1.658954
              4  |   2.031608   .1344246    10.71   0.000     1.784509    2.312923
5 most deprived  |   2.368444   .1611201    12.67   0.000     2.072802    2.706254
                 |
   tot_adults_hh |
              2  |   .8319161   .0431359    -3.55   0.000     .7515253    .9209063
              3  |   1.105837   .0553395     2.01   0.044     1.002524    1.219798
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster saved
   1:   1748.43 /        1 =    1748.4300

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =        2,718
Time at risk         =   2216762290
                                                Wald chi2(14)    =     2349.47
Log pseudolikelihood =   -34018.007             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   1.078993   .0763426     1.07   0.283     .9392758    1.239493
    1 child <12  |   1.041282   .0741517     0.57   0.570     .9056335    1.197247
 2 children <12  |   .9143454   .0929973    -0.88   0.379     .7490922    1.116054
3+ children <12  |   1.036275   .1688102     0.22   0.827     .7530317    1.426056
                 |
            age1 |    1.14396   .0241966     6.36   0.000     1.097505    1.192381
            age2 |   .9509982   .0461469    -1.04   0.300     .8647197    1.045885
            age3 |   1.060832   .1251883     0.50   0.617     .8417762    1.336893
          1.male |   1.873448   .0757391    15.53   0.000     1.730731    2.027933
                 |
             imd |
              2  |   1.192053   .0858892     2.44   0.015     1.035059    1.372859
              3  |    1.44556   .1011687     5.27   0.000     1.260272     1.65809
              4  |   2.030348   .1343257    10.70   0.000     1.783429    2.311453
5 most deprived  |   2.366576   .1610092    12.66   0.000     2.071139    2.704156
                 |
   tot_adults_hh |
              2  |   .8328879   .0431903    -3.53   0.000     .7523961    .9219908
              3  |   1.105908   .0553515     2.01   0.044     1.002572    1.219894
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_noeth_ageband_0.ster saved
   1:   1742.23 /        1 =    1742.2310

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =        2,718
Time at risk         =   2216762290
                                                Wald chi2(14)    =     2349.47
Log pseudolikelihood =   -34018.007             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   1.078993   .0763426     1.07   0.283     .9392758    1.239493
    1 child <12  |   1.041282   .0741517     0.57   0.570     .9056335    1.197247
 2 children <12  |   .9143454   .0929973    -0.88   0.379     .7490922    1.116054
3+ children <12  |   1.036275   .1688102     0.22   0.827     .7530317    1.426056
                 |
            age1 |    1.14396   .0241966     6.36   0.000     1.097505    1.192381
            age2 |   .9509982   .0461469    -1.04   0.300     .8647197    1.045885
            age3 |   1.060832   .1251883     0.50   0.617     .8417762    1.336893
          1.male |   1.873448   .0757391    15.53   0.000     1.730731    2.027933
                 |
             imd |
              2  |   1.192053   .0858892     2.44   0.015     1.035059    1.372859
              3  |    1.44556   .1011687     5.27   0.000     1.260272     1.65809
              4  |   2.030348   .1343257    10.70   0.000     1.783429    2.311453
5 most deprived  |   2.366576   .1610092    12.66   0.000     2.071139    2.704156
                 |
   tot_adults_hh |
              2  |   .8328879   .0431903    -3.53   0.000     .7523961    .9219908
              3  |   1.105908   .0553515     2.01   0.044     1.002572    1.219894
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCeth_ageband_0.ster saved
   1:   1674.47 /        1 =    1674.4660

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =        2,718
Time at risk         =   2216762290
                                                Wald chi2(14)    =     2349.47
Log pseudolikelihood =   -34018.007             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   1.078993   .0763426     1.07   0.283     .9392758    1.239493
    1 child <12  |   1.041282   .0741517     0.57   0.570     .9056335    1.197247
 2 children <12  |   .9143454   .0929973    -0.88   0.379     .7490922    1.116054
3+ children <12  |   1.036275   .1688102     0.22   0.827     .7530317    1.426056
                 |
            age1 |    1.14396   .0241966     6.36   0.000     1.097505    1.192381
            age2 |   .9509982   .0461469    -1.04   0.300     .8647197    1.045885
            age3 |   1.060832   .1251883     0.50   0.617     .8417762    1.336893
          1.male |   1.873448   .0757391    15.53   0.000     1.730731    2.027933
                 |
             imd |
              2  |   1.192053   .0858892     2.44   0.015     1.035059    1.372859
              3  |    1.44556   .1011687     5.27   0.000     1.260272     1.65809
              4  |   2.030348   .1343257    10.70   0.000     1.783429    2.311453
5 most deprived  |   2.366576   .1610092    12.66   0.000     2.071139    2.704156
                 |
   tot_adults_hh |
              2  |   .8328879   .0431903    -3.53   0.000     .7523961    .9219908
              3  |   1.105908   .0553515     2.01   0.044     1.002572    1.219894
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster saved
   1:   1678.10 /        1 =    1678.0980

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =        2,718
Time at risk         =   2216762290
                                                Wald chi2(14)    =     2349.47
Log pseudolikelihood =   -34018.007             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   1.078993   .0763426     1.07   0.283     .9392758    1.239493
    1 child <12  |   1.041282   .0741517     0.57   0.570     .9056335    1.197247
 2 children <12  |   .9143454   .0929973    -0.88   0.379     .7490922    1.116054
3+ children <12  |   1.036275   .1688102     0.22   0.827     .7530317    1.426056
                 |
            age1 |    1.14396   .0241966     6.36   0.000     1.097505    1.192381
            age2 |   .9509982   .0461469    -1.04   0.300     .8647197    1.045885
            age3 |   1.060832   .1251883     0.50   0.617     .8417762    1.336893
          1.male |   1.873448   .0757391    15.53   0.000     1.730731    2.027933
                 |
             imd |
              2  |   1.192053   .0858892     2.44   0.015     1.035059    1.372859
              3  |    1.44556   .1011687     5.27   0.000     1.260272     1.65809
              4  |   2.030348   .1343257    10.70   0.000     1.783429    2.311453
5 most deprived  |   2.366576   .1610092    12.66   0.000     2.071139    2.704156
                 |
   tot_adults_hh |
              2  |   .8328879   .0431903    -3.53   0.000     .7523961    .9219908
              3  |   1.105908   .0553515     2.01   0.044     1.002572    1.219894
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster saved
(843,137 observations deleted)
   1:   1428.89 /        1 =    1428.8930

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,211,653             Number of obs    =  11,211,653
No. of failures      =        2,572
Time at risk         =   2061693627
                                                Wald chi2(12)    =     2182.00
Log pseudolikelihood =   -32046.958             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,406,502 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   1.029186   .0642011     0.46   0.645     .9107425    1.163034
  Kids under 18  |   1.093537   .0787749     1.24   0.215     .9495448    1.259364
                 |
            age1 |   1.136206   .0255198     5.69   0.000     1.087274    1.187342
            age2 |   .9689441   .0497672    -0.61   0.539     .8761511    1.071565
            age3 |   1.012661   .1262242     0.10   0.920     .7931678    1.292894
          1.male |   1.880565   .0781551    15.20   0.000     1.733457    2.040158
                 |
             imd |
              2  |   1.207376   .0893059     2.55   0.011     1.044436    1.395736
              3  |   1.450802   .1044896     5.17   0.000     1.259804    1.670758
              4  |   2.071438   .1409221    10.70   0.000     1.812859    2.366901
5 most deprived  |   2.406647   .1686397    12.53   0.000     2.097813    2.760948
                 |
   tot_adults_hh |
              2  |   .8411193   .0452244    -3.22   0.001     .7569917    .9345964
              3  |   1.133772   .0586416     2.43   0.015      1.02447    1.254735
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_noeth_12mo_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_noeth_12mo_ageband_0.ster saved
   1:    583.24 /        1 =     583.2350

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =        8,930
Time at risk         =    635992694
                                                Wald chi2(12)    =     8125.79
Log pseudolikelihood =   -101652.97             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |     .92569   .0757588    -0.94   0.345     .7885023    1.086746
  Kids under 18  |   .9122588   .1017675    -0.82   0.410     .7330976    1.135205
                 |
            age1 |   1.038007   .0140486     2.76   0.006     1.010834     1.06591
            age2 |   1.357605   .0717113     5.79   0.000     1.224084     1.50569
            age3 |    .452484   .0603415    -5.95   0.000     .3484097    .5876466
          1.male |    2.04599    .045131    32.45   0.000      1.95942    2.136385
                 |
             imd |
              2  |   1.153124   .0398408     4.12   0.000     1.077623    1.233915
              3  |    1.31702   .0453652     7.99   0.000      1.23104    1.409004
              4  |   1.589436   .0552082    13.34   0.000     1.484831    1.701411
5 most deprived  |    1.97188   .0716951    18.67   0.000      1.83625    2.117528
                 |
   tot_adults_hh |
              2  |   .7896719   .0196928    -9.47   0.000     .7520028    .8292279
              3  |   1.026314   .0374921     0.71   0.477     .9553999    1.102492
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_noeth_ageband_1.ster saved
   1:    580.61 /        1 =     580.6080

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =        8,930
Time at risk         =    635992694
                                                Wald chi2(12)    =     8125.79
Log pseudolikelihood =   -101652.97             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |     .92569   .0757588    -0.94   0.345     .7885023    1.086746
  Kids under 18  |   .9122588   .1017675    -0.82   0.410     .7330976    1.135205
                 |
            age1 |   1.038007   .0140486     2.76   0.006     1.010834     1.06591
            age2 |   1.357605   .0717113     5.79   0.000     1.224084     1.50569
            age3 |    .452484   .0603415    -5.95   0.000     .3484097    .5876466
          1.male |    2.04599    .045131    32.45   0.000      1.95942    2.136385
                 |
             imd |
              2  |   1.153124   .0398408     4.12   0.000     1.077623    1.233915
              3  |    1.31702   .0453652     7.99   0.000      1.23104    1.409004
              4  |   1.589436   .0552082    13.34   0.000     1.484831    1.701411
5 most deprived  |    1.97188   .0716951    18.67   0.000      1.83625    2.117528
                 |
   tot_adults_hh |
              2  |   .7896719   .0196928    -9.47   0.000     .7520028    .8292279
              3  |   1.026314   .0374921     0.71   0.477     .9553999    1.102492
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCeth_ageband_1.ster saved
   1:    582.25 /        1 =     582.2550

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =        8,930
Time at risk         =    635992694
                                                Wald chi2(12)    =     8125.79
Log pseudolikelihood =   -101652.97             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |     .92569   .0757588    -0.94   0.345     .7885023    1.086746
  Kids under 18  |   .9122588   .1017675    -0.82   0.410     .7330976    1.135205
                 |
            age1 |   1.038007   .0140486     2.76   0.006     1.010834     1.06591
            age2 |   1.357605   .0717113     5.79   0.000     1.224084     1.50569
            age3 |    .452484   .0603415    -5.95   0.000     .3484097    .5876466
          1.male |    2.04599    .045131    32.45   0.000      1.95942    2.136385
                 |
             imd |
              2  |   1.153124   .0398408     4.12   0.000     1.077623    1.233915
              3  |    1.31702   .0453652     7.99   0.000      1.23104    1.409004
              4  |   1.589436   .0552082    13.34   0.000     1.484831    1.701411
5 most deprived  |    1.97188   .0716951    18.67   0.000      1.83625    2.117528
                 |
   tot_adults_hh |
              2  |   .7896719   .0196928    -9.47   0.000     .7520028    .8292279
              3  |   1.026314   .0374921     0.71   0.477     .9553999    1.102492
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster saved
   1:    610.71 /        1 =     610.7090

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =        8,930
Time at risk         =    635992694
                                                Wald chi2(12)    =     8125.79
Log pseudolikelihood =   -101652.97             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |     .92569   .0757588    -0.94   0.345     .7885023    1.086746
  Kids under 18  |   .9122588   .1017675    -0.82   0.410     .7330976    1.135205
                 |
            age1 |   1.038007   .0140486     2.76   0.006     1.010834     1.06591
            age2 |   1.357605   .0717113     5.79   0.000     1.224084     1.50569
            age3 |    .452484   .0603415    -5.95   0.000     .3484097    .5876466
          1.male |    2.04599    .045131    32.45   0.000      1.95942    2.136385
                 |
             imd |
              2  |   1.153124   .0398408     4.12   0.000     1.077623    1.233915
              3  |    1.31702   .0453652     7.99   0.000      1.23104    1.409004
              4  |   1.589436   .0552082    13.34   0.000     1.484831    1.701411
5 most deprived  |    1.97188   .0716951    18.67   0.000      1.83625    2.117528
                 |
   tot_adults_hh |
              2  |   .7896719   .0196928    -9.47   0.000     .7520028    .8292279
              3  |   1.026314   .0374921     0.71   0.477     .9553999    1.102492
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster saved
   1:    637.80 /        1 =     637.8030

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =        8,930
Time at risk         =    635992694
                                                Wald chi2(14)    =     8126.54
Log pseudolikelihood =   -101652.12             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .9124323   .1017882    -0.82   0.411     .7332349    1.135424
    1 child <12  |   .9123143   .0937218    -0.89   0.372     .7459346    1.115805
 2 children <12  |   .8604448   .1293551    -1.00   0.317     .6408516    1.155283
3+ children <12  |   1.216651   .2675193     0.89   0.372     .7906832    1.872103
                 |
            age1 |   1.038014   .0140484     2.76   0.006     1.010842    1.065917
            age2 |   1.357493   .0717044     5.79   0.000     1.223985    1.505563
            age3 |    .452585   .0603541    -5.94   0.000     .3484887    .5877755
          1.male |   2.046026   .0451318    32.45   0.000     1.959454    2.136423
                 |
             imd |
              2  |   1.153121   .0398405     4.12   0.000      1.07762    1.233912
              3  |   1.316939   .0453628     7.99   0.000     1.230964    1.408918
              4  |   1.589136   .0551994    13.33   0.000     1.484548    1.701093
5 most deprived  |   1.970971   .0716757    18.66   0.000     1.835379     2.11658
                 |
   tot_adults_hh |
              2  |   .7896338   .0196919    -9.47   0.000     .7519663    .8291881
              3  |   1.026034   .0374936     0.70   0.482     .9551178    1.102216
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_noeth_ageband_1.ster saved
   1:    636.43 /        1 =     636.4350

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =        8,930
Time at risk         =    635992694
                                                Wald chi2(14)    =     8126.54
Log pseudolikelihood =   -101652.12             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .9124323   .1017882    -0.82   0.411     .7332349    1.135424
    1 child <12  |   .9123143   .0937218    -0.89   0.372     .7459346    1.115805
 2 children <12  |   .8604448   .1293551    -1.00   0.317     .6408516    1.155283
3+ children <12  |   1.216651   .2675193     0.89   0.372     .7906832    1.872103
                 |
            age1 |   1.038014   .0140484     2.76   0.006     1.010842    1.065917
            age2 |   1.357493   .0717044     5.79   0.000     1.223985    1.505563
            age3 |    .452585   .0603541    -5.94   0.000     .3484887    .5877755
          1.male |   2.046026   .0451318    32.45   0.000     1.959454    2.136423
                 |
             imd |
              2  |   1.153121   .0398405     4.12   0.000      1.07762    1.233912
              3  |   1.316939   .0453628     7.99   0.000     1.230964    1.408918
              4  |   1.589136   .0551994    13.33   0.000     1.484548    1.701093
5 most deprived  |   1.970971   .0716757    18.66   0.000     1.835379     2.11658
                 |
   tot_adults_hh |
              2  |   .7896338   .0196919    -9.47   0.000     .7519663    .8291881
              3  |   1.026034   .0374936     0.70   0.482     .9551178    1.102216
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCeth_ageband_1.ster saved
   1:    620.02 /        1 =     620.0220

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =        8,930
Time at risk         =    635992694
                                                Wald chi2(14)    =     8126.54
Log pseudolikelihood =   -101652.12             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .9124323   .1017882    -0.82   0.411     .7332349    1.135424
    1 child <12  |   .9123143   .0937218    -0.89   0.372     .7459346    1.115805
 2 children <12  |   .8604448   .1293551    -1.00   0.317     .6408516    1.155283
3+ children <12  |   1.216651   .2675193     0.89   0.372     .7906832    1.872103
                 |
            age1 |   1.038014   .0140484     2.76   0.006     1.010842    1.065917
            age2 |   1.357493   .0717044     5.79   0.000     1.223985    1.505563
            age3 |    .452585   .0603541    -5.94   0.000     .3484887    .5877755
          1.male |   2.046026   .0451318    32.45   0.000     1.959454    2.136423
                 |
             imd |
              2  |   1.153121   .0398405     4.12   0.000      1.07762    1.233912
              3  |   1.316939   .0453628     7.99   0.000     1.230964    1.408918
              4  |   1.589136   .0551994    13.33   0.000     1.484548    1.701093
5 most deprived  |   1.970971   .0716757    18.66   0.000     1.835379     2.11658
                 |
   tot_adults_hh |
              2  |   .7896338   .0196919    -9.47   0.000     .7519663    .8291881
              3  |   1.026034   .0374936     0.70   0.482     .9551178    1.102216
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster saved
   1:    618.09 /        1 =     618.0870

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =        8,930
Time at risk         =    635992694
                                                Wald chi2(14)    =     8126.54
Log pseudolikelihood =   -101652.12             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .9124323   .1017882    -0.82   0.411     .7332349    1.135424
    1 child <12  |   .9123143   .0937218    -0.89   0.372     .7459346    1.115805
 2 children <12  |   .8604448   .1293551    -1.00   0.317     .6408516    1.155283
3+ children <12  |   1.216651   .2675193     0.89   0.372     .7906832    1.872103
                 |
            age1 |   1.038014   .0140484     2.76   0.006     1.010842    1.065917
            age2 |   1.357493   .0717044     5.79   0.000     1.223985    1.505563
            age3 |    .452585   .0603541    -5.94   0.000     .3484887    .5877755
          1.male |   2.046026   .0451318    32.45   0.000     1.959454    2.136423
                 |
             imd |
              2  |   1.153121   .0398405     4.12   0.000      1.07762    1.233912
              3  |   1.316939   .0453628     7.99   0.000     1.230964    1.408918
              4  |   1.589136   .0551994    13.33   0.000     1.484548    1.701093
5 most deprived  |   1.970971   .0716757    18.66   0.000     1.835379     2.11658
                 |
   tot_adults_hh |
              2  |   .7896338   .0196919    -9.47   0.000     .7519663    .8291881
              3  |   1.026034   .0374936     0.70   0.482     .9551178    1.102216
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster saved
(80,442 observations deleted)
   1:    563.38 /        1 =     563.3850

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,409,387             Number of obs    =   3,409,387
No. of failures      =        8,585
Time at risk         =    621374542
                                                Wald chi2(12)    =     7772.19
Log pseudolikelihood =   -97564.176             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,553,148 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .9582641   .0802809    -0.51   0.611     .8131558    1.129267
  Kids under 18  |   .9012019   .1048972    -0.89   0.371     .7173726    1.132138
                 |
            age1 |   1.036194    .014297     2.58   0.010     1.008548    1.064598
            age2 |   1.360068    .073241     5.71   0.000     1.223834    1.511466
            age3 |    .452355   .0615014    -5.83   0.000     .3465386    .5904828
          1.male |   2.051955    .046101    31.99   0.000     1.963559     2.14433
                 |
             imd |
              2  |   1.156014   .0406174     4.13   0.000     1.079085    1.238428
              3  |   1.303351   .0457875     7.54   0.000     1.216629    1.396254
              4  |    1.59204   .0562392    13.16   0.000     1.485543    1.706172
5 most deprived  |   1.958707   .0724723    18.17   0.000     1.821692    2.106027
                 |
   tot_adults_hh |
              2  |   .7996911   .0202668    -8.82   0.000     .7609393    .8404164
              3  |    1.00788   .0375799     0.21   0.833     .9368517    1.084293
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_noeth_12mo_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_DEMOGADJ_noeth_12mo_ageband_1.ster saved

.         
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07a_an_multivariable_cox_models_covid_death_icu.log
  log type:  text
 closed on:  27 Aug 2020, 00:25:16
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
