------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_non_covid_death.log
  log type:  text
 opened on:  26 Aug 2020, 18:36:47

. 
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in        kids_cat3  {
  4. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.         /*  Proportional Hazards test  */
.         * Based on Schoenfeld residuals
.         timer clear 
  9.         timer on 1
 10.         if e(N_fail)>0 estat phtest, d
 11.         timer off 1
 12.         timer list
 13. }
 14. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 15. 
. }
 16. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 17. foreach exposure_type in kids_cat3   {
 18. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 19. if _rc==0{
 20. estimates
 21. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth_12mo_ageband_`x', replace
 22. *estat concordance /*c-statistic*/
. }
 23. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
 24. 
. 
. }       
 25. 
.  
.  
.  foreach exposure_type in       gp_number_kids {
 26. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 27. if _rc==0{
 28. estimates
 29. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth_ageband_`x', replace
 30. }
 31. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 32. }
 33. 
. }
   1:  10060.95 /        1 =   10060.9520

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  11,870,825
No. of failures      =       10,012
Time at risk         =   2183091954
                                                Wald chi2(37)    =    54804.48
Log pseudolikelihood =   -113813.67             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .6683028   .0274415    -9.81   0.000     .6166257    .7243106
               Kids under 18  |   .7207151   .0328223    -7.19   0.000      .659172    .7880042
                              |
                         age1 |   1.095989   .0133709     7.51   0.000     1.070093    1.122511
                         age2 |   1.014743   .0286633     0.52   0.604     .9600907    1.072506
                         age3 |   .8658255   .0592638    -2.10   0.035     .7571249    .9901323
                       1.male |   1.369091   .0288983    14.88   0.000     1.313607    1.426919
                              |
                          imd |
                           2  |   1.130491   .0415234     3.34   0.001     1.051967    1.214876
                           3  |   1.291175   .0466827     7.07   0.000     1.202846    1.385991
                           4  |   1.474522   .0524503    10.92   0.000     1.375224    1.580991
             5 most deprived  |    1.86556   .0661837    17.58   0.000     1.740249    1.999894
                              |
                tot_adults_hh |
                           2  |   .7305248   .0182402   -12.58   0.000     .6956354    .7671641
                           3  |   .7050427   .0188434   -13.08   0.000     .6690608    .7429596
                              |
           1.htdiag_or_highbp |   1.144618   .0260559     5.93   0.000     1.094672    1.196843
1.chronic_respiratory_disease |   2.755246   .0878024    31.80   0.000      2.58842    2.932823
                     1.asthma |   .9889844   .0274314    -0.40   0.690     .9366552    1.044237
    1.chronic_cardiac_disease |   1.874187   .0586695    20.07   0.000     1.762653    1.992778
                              |
                      diabcat |
            T1DM, controlled  |   2.305258   .3227584     5.97   0.000     1.752036    3.033164
          T1DM, uncontrolled  |    2.52325   .2371818     9.85   0.000     2.098692    3.033696
            T2DM, controlled  |   1.325964   .0509168     7.35   0.000     1.229831     1.42961
          T2DM, uncontrolled  |   1.661058   .0648635    13.00   0.000     1.538671     1.79318
          Diabetes, no HbA1c  |   3.123075   .6274408     5.67   0.000     2.106551    4.630127
                              |
            cancer_exhaem_cat |
                   Last year  |   37.03696    1.30052   102.86   0.000     34.57373     39.6757
               2-5 years ago  |   14.35028   .4784864    79.89   0.000     13.44245    15.31942
                    5+ years  |   4.820822    .191303    39.64   0.000     4.460085    5.210735
                              |
              cancer_haem_cat |
                   Last year  |   7.133778   1.018849    13.76   0.000     5.392009    9.438186
               2-5 years ago  |   4.125363   .4411872    13.25   0.000     3.345264    5.087378
                    5+ years  |   1.904721   .1965649     6.24   0.000     1.555924    2.331709
                              |
      1.chronic_liver_disease |   5.867553   .2504088    41.46   0.000     5.396726    6.379456
            1.stroke_dementia |   1.935302   .0931561    13.72   0.000     1.761067    2.126774
                1.other_neuro |   3.077468   .1806354    19.15   0.000     2.743035    3.452676
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.728612    .076012    12.45   0.000     1.585871    1.884201
           Stage 4/5 egfr<30  |   5.092352   .4515354    18.36   0.000     4.279992    6.058901
                              |
                       1.esrd |   1.600005    .171973     4.37   0.000      1.29608    1.975199
           1.other_transplant |   .7625535   .1467689    -1.41   0.159     .5229249    1.111991
                   1.asplenia |   2.048991   .2333922     6.30   0.000     1.639016    2.561515
           1.ra_sle_psoriasis |   1.102937   .0436506     2.48   0.013     1.020617    1.191896
               1.other_immuno |   1.820199   .1780753     6.12   0.000       1.5026    2.204928
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.02095         5.50        1         0.0190
      2.kids_cat3 |      0.00770         0.63        1         0.4289
      age1        |      0.00439         0.27        1         0.6016
      age2        |     -0.00136         0.03        1         0.8738
      age3        |      0.00183         0.04        1         0.8326
      0b.male     |            .            .        1             .
      1.male      |     -0.01089         1.26        1         0.2620
      1b.imd      |            .            .        1             .
      2.imd       |      0.00974         0.97        1         0.3243
      3.imd       |      0.00779         0.64        1         0.4249
      4.imd       |      0.01332         1.89        1         0.1689
      5.imd       |      0.00203         0.04        1         0.8329
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.02305         5.85        1         0.0156
      3.tot_adul~h|      0.01501         2.43        1         0.1190
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.01185         1.72        1         0.1902
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.00557         0.43        1         0.5110
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01184         1.52        1         0.2172
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00271         0.10        1         0.7578
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00502         0.32        1         0.5723
      3.diabcat   |     -0.01113         1.85        1         0.1742
      4.diabcat   |     -0.01414         2.41        1         0.1203
      5.diabcat   |     -0.01141         1.50        1         0.2206
      6.diabcat   |      0.00996         1.09        1         0.2973
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.02377         9.02        1         0.0027
      3.cancer_e~t|     -0.00118         0.02        1         0.8833
      4.cancer_e~t|     -0.00445         0.24        1         0.6235
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.00611         0.66        1         0.4169
      3.cancer_h~t|     -0.00835         0.95        1         0.3301
      4.cancer_h~t|     -0.00434         0.22        1         0.6363
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.00839         1.20        1         0.2725
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01163         2.09        1         0.1479
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.00381         0.22        1         0.6410
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.00916         1.00        1         0.3178
      3.reduced_~t|      0.00718         0.84        1         0.3594
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00414         0.28        1         0.5993
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00342         0.14        1         0.7084
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.01722         3.55        1         0.0595
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00872         0.85        1         0.3575
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.01237         2.04        1         0.1531
      ------------+---------------------------------------------------
      global test |                     59.89       37         0.0100
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:  17036.90 /        1 =   17036.8960
(843,137 observations deleted)
   1:   8224.75 /        1 =    8224.7480

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,037,363             Number of obs    =  11,037,363
No. of failures      =        9,512
Time at risk         =   2029793167
                                                Wald chi2(37)    =    51898.01
Log pseudolikelihood =    -107653.3             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,353,709 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .6621267   .0281944    -9.68   0.000     .6091099    .7197581
               Kids under 18  |   .7202194   .0335286    -7.05   0.000     .6574135    .7890255
                              |
                         age1 |   1.093922   .0142147     6.91   0.000     1.066413     1.12214
                         age2 |   1.017822   .0303685     0.59   0.554     .9600079    1.079118
                         age3 |   .8613201    .062049    -2.07   0.038     .7479016    .9919383
                       1.male |   1.356707   .0293233    14.11   0.000     1.300434    1.415414
                              |
                          imd |
                           2  |   1.124924   .0423083     3.13   0.002     1.044984    1.210979
                           3  |   1.294081   .0478718     6.97   0.000     1.203575    1.391393
                           4  |   1.478164   .0537631    10.74   0.000     1.376458    1.587384
             5 most deprived  |   1.851117   .0673687    16.92   0.000     1.723676     1.98798
                              |
                tot_adults_hh |
                           2  |   .7349575   .0188339   -12.02   0.000     .6989555    .7728139
                           3  |   .6969525   .0191365   -13.15   0.000      .660437    .7354868
                              |
           1.htdiag_or_highbp |   1.146286   .0267527     5.85   0.000     1.095033    1.199938
1.chronic_respiratory_disease |   2.764885   .0900465    31.23   0.000     2.593912    2.947127
                     1.asthma |   .9850895   .0280343    -0.53   0.598     .9316476    1.041597
    1.chronic_cardiac_disease |   1.881147   .0600823    19.78   0.000     1.766998     2.00267
                              |
                      diabcat |
            T1DM, controlled  |   2.298462   .3288576     5.82   0.000       1.7364     3.04246
          T1DM, uncontrolled  |   2.584438   .2473982     9.92   0.000     2.142318    3.117801
            T2DM, controlled  |   1.348105   .0526231     7.65   0.000     1.248813    1.455293
          T2DM, uncontrolled  |   1.687985   .0671544    13.16   0.000     1.561365    1.824873
          Diabetes, no HbA1c  |   2.852035   .6339304     4.72   0.000     1.844827    4.409141
                              |
            cancer_exhaem_cat |
                   Last year  |   36.48054   1.322072    99.25   0.000     33.97921    39.16599
               2-5 years ago  |   14.19965   .4832798    77.96   0.000     13.28334    15.17917
                    5+ years  |   4.782719    .193552    38.67   0.000     4.418019    5.177525
                              |
              cancer_haem_cat |
                   Last year  |   7.166141   1.048583    13.46   0.000     5.379396    9.546345
               2-5 years ago  |    4.12079   .4490991    12.99   0.000      3.32823    5.102084
                    5+ years  |   1.955201    .203219     6.45   0.000     1.594849    2.396974
                              |
      1.chronic_liver_disease |   5.734076   .2529866    39.58   0.000     5.259065    6.251991
            1.stroke_dementia |   1.956467   .0959477    13.69   0.000     1.777168    2.153856
                1.other_neuro |   3.091628   .1845373    18.91   0.000     2.750297    3.475321
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.733816    .077552    12.30   0.000     1.588289    1.892677
           Stage 4/5 egfr<30  |   5.099995   .4611721    18.02   0.000     4.271682    6.088923
                              |
                       1.esrd |   1.592178   .1737924     4.26   0.000     1.285522    1.971985
           1.other_transplant |   .7712773   .1510116    -1.33   0.185     .5254728    1.132064
                   1.asplenia |   2.047847   .2383957     6.16   0.000     1.630072    2.572695
           1.ra_sle_psoriasis |   1.098925   .0444596     2.33   0.020     1.015151    1.189612
               1.other_immuno |   1.786002   .1814666     5.71   0.000      1.46351    2.179557
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_0.ster saved
   1:   8424.80 /        1 =    8424.8030

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,037,363             Number of obs    =  11,037,363
No. of failures      =        9,512
Time at risk         =   2029793167
                                                Wald chi2(39)    =    51864.78
Log pseudolikelihood =   -107652.03             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,353,709 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |   .7200501   .0335207    -7.06   0.000     .6572589    .7888401
                 1 child <12  |   .6912634     .03451    -7.40   0.000     .6268289    .7623215
              2 children <12  |   .6128782   .0437469    -6.86   0.000     .5328634     .704908
             3+ children <12  |   .6233141   .0798745    -3.69   0.000     .4848751    .8012794
                              |
                         age1 |   1.094871   .0142484     6.96   0.000     1.067297    1.123156
                         age2 |   1.015094   .0303528     0.50   0.616     .9573134    1.076362
                         age3 |   .8672942   .0626301    -1.97   0.049     .7528325    .9991587
                       1.male |   1.356977   .0293302    14.12   0.000     1.300692    1.415698
                              |
                          imd |
                           2  |   1.124723    .042298     3.13   0.002     1.044802    1.210757
                           3  |   1.293719   .0478643     6.96   0.000     1.203227    1.391017
                           4  |   1.477721   .0537497    10.74   0.000     1.376041    1.586915
             5 most deprived  |   1.850858   .0673686    16.91   0.000     1.723417    1.987722
                              |
                tot_adults_hh |
                           2  |    .735559   .0188501   -11.98   0.000     .6995259    .7734481
                           3  |    .697088   .0191391   -13.14   0.000     .6605675    .7356277
                              |
           1.htdiag_or_highbp |   1.146274   .0267516     5.85   0.000     1.095023    1.199924
1.chronic_respiratory_disease |   2.764913   .0900455    31.23   0.000     2.593942    2.947153
                     1.asthma |   .9851167   .0280319    -0.53   0.598     .9316792    1.041619
    1.chronic_cardiac_disease |   1.881212   .0600841    19.79   0.000     1.767059    2.002739
                              |
                      diabcat |
            T1DM, controlled  |   2.298175   .3287983     5.82   0.000      1.73621    3.042033
          T1DM, uncontrolled  |    2.58396   .2473153     9.92   0.000     2.141982    3.117136
            T2DM, controlled  |   1.348127   .0526274     7.65   0.000     1.248826    1.455323
          T2DM, uncontrolled  |   1.688349   .0671603    13.17   0.000     1.561718    1.825249
          Diabetes, no HbA1c  |    2.85129   .6337301     4.71   0.000     1.844389    4.407884
                              |
            cancer_exhaem_cat |
                   Last year  |   36.47863   1.322005    99.25   0.000     33.97743    39.16396
               2-5 years ago  |   14.19698   .4832157    77.95   0.000      13.2808    15.17637
                    5+ years  |   4.782548   .1935009    38.68   0.000     4.417941    5.177246
                              |
              cancer_haem_cat |
                   Last year  |   7.161987   1.047862    13.46   0.000     5.376445    9.540515
               2-5 years ago  |   4.121184   .4491009    13.00   0.000     3.328614    5.102472
                    5+ years  |   1.956757   .2031173     6.47   0.000      1.59654    2.398249
                              |
      1.chronic_liver_disease |   5.734213   .2530147    39.58   0.000     5.259151    6.252187
            1.stroke_dementia |   1.956021   .0959546    13.68   0.000     1.776711    2.153426
                1.other_neuro |   3.091536   .1845376    18.91   0.000     2.750205     3.47523
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.733737   .0775456    12.30   0.000     1.588222    1.892585
           Stage 4/5 egfr<30  |   5.104405   .4613361    18.04   0.000     4.275762    6.093639
                              |
                       1.esrd |   1.592426   .1737402     4.26   0.000     1.285848    1.972099
           1.other_transplant |   .7711193   .1509689    -1.33   0.184     .5253809    1.131798
                   1.asplenia |   2.047319   .2383366     6.16   0.000     1.629648    2.572037
           1.ra_sle_psoriasis |   1.098705   .0444522     2.33   0.020     1.014945    1.189377
               1.other_immuno |   1.786921    .181564     5.71   0.000     1.464257    2.180688
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_0.ster saved
   1:   2653.77 /        1 =    2653.7720

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   3,329,528
No. of failures      =       50,756
Time at risk         =    606823725
                                                Wald chi2(37)    =   106863.33
Log pseudolikelihood =   -562196.04             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8864925   .0350879    -3.04   0.002     .8203214    .9580014
               Kids under 18  |    .950511   .0483734    -1.00   0.319      .860276    1.050211
                              |
                         age1 |   1.081002   .0064103    13.13   0.000     1.068511    1.093639
                         age2 |   .9725044   .0221277    -1.23   0.220     .9300877    1.016855
                         age3 |   1.169221    .066963     2.73   0.006     1.045074    1.308115
                       1.male |   1.163857   .0110326    16.01   0.000     1.142433    1.185683
                              |
                          imd |
                           2  |   1.092294   .0150784     6.40   0.000     1.063138    1.122251
                           3  |   1.166954   .0162974    11.06   0.000     1.135445    1.199338
                           4  |   1.257632   .0182903    15.76   0.000      1.22229    1.293996
             5 most deprived  |   1.422937   .0223225    22.48   0.000     1.379852    1.467368
                              |
                tot_adults_hh |
                           2  |    .885457   .0092395   -11.66   0.000     .8675319    .9037526
                           3  |   1.036098   .0164367     2.24   0.025     1.004378    1.068819
                              |
           1.htdiag_or_highbp |   .9286737   .0101137    -6.79   0.000     .9090613    .9487092
1.chronic_respiratory_disease |   2.013248   .0220621    63.85   0.000     1.970468    2.056956
                     1.asthma |   .8902781   .0122665    -8.44   0.000     .8665579    .9146477
    1.chronic_cardiac_disease |   1.522221   .0149809    42.69   0.000      1.49314    1.551868
                              |
                      diabcat |
            T1DM, controlled  |   1.844341   .1746701     6.46   0.000     1.531889    2.220522
          T1DM, uncontrolled  |   2.055819   .1252827    11.83   0.000     1.824367    2.316635
            T2DM, controlled  |   1.242418   .0149551    18.03   0.000      1.21345    1.272078
          T2DM, uncontrolled  |   1.378268   .0229149    19.30   0.000      1.33408    1.423921
          Diabetes, no HbA1c  |   1.810166   .2109331     5.09   0.000     1.440557    2.274607
                              |
            cancer_exhaem_cat |
                   Last year  |    7.86902    .141886   114.41   0.000     7.595785    8.152083
               2-5 years ago  |   2.980955   .0481573    67.61   0.000     2.888047    3.076852
                    5+ years  |   1.565963   .0202713    34.65   0.000     1.526732    1.606203
                              |
              cancer_haem_cat |
                   Last year  |   4.217752   .2454009    24.74   0.000     3.763186    4.727226
               2-5 years ago  |   2.480209   .1006776    22.38   0.000     2.290529    2.685595
                    5+ years  |   1.731207    .057697    16.47   0.000     1.621737    1.848066
                              |
      1.chronic_liver_disease |    2.57387   .0786922    30.92   0.000     2.424166    2.732818
            1.stroke_dementia |   1.700215   .0206021    43.80   0.000     1.660312    1.741078
                1.other_neuro |   2.114897   .0465315    34.04   0.000     2.025636    2.208092
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.136212    .012018    12.07   0.000     1.112899    1.160012
           Stage 4/5 egfr<30  |   2.294315   .0437517    43.55   0.000     2.210146    2.381689
                              |
                       1.esrd |   2.267155   .1061921    17.48   0.000     2.068291    2.485141
           1.other_transplant |   1.020075   .1806114     0.11   0.911     .7209763    1.443256
                   1.asplenia |   1.404488   .0959386     4.97   0.000     1.228496    1.605693
           1.ra_sle_psoriasis |   1.141213   .0180761     8.34   0.000     1.106329    1.177197
               1.other_immuno |   2.067388   .1405405    10.68   0.000     1.809496    2.362036
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.00119         0.07        1         0.7855
      2.kids_cat3 |     -0.00309         0.51        1         0.4736
      age1        |     -0.00421         0.93        1         0.3338
      age2        |      0.00589         1.80        1         0.1793
      age3        |     -0.00652         2.21        1         0.1375
      0b.male     |            .            .        1             .
      1.male      |     -0.00548         1.64        1         0.1999
      1b.imd      |            .            .        1             .
      2.imd       |      0.00117         0.07        1         0.7893
      3.imd       |     -0.00230         0.28        1         0.5993
      4.imd       |     -0.00345         0.62        1         0.4300
      5.imd       |     -0.00311         0.51        1         0.4752
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.00156         0.14        1         0.7088
      3.tot_adul~h|     -0.00739         3.20        1         0.0735
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.01672        14.77        1         0.0001
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01009         5.84        1         0.0157
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.00008         0.00        1         0.9855
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00223         0.28        1         0.5984
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.00446         1.20        1         0.2731
      3.diabcat   |     -0.00291         0.46        1         0.4970
      4.diabcat   |      0.00549         1.58        1         0.2087
      5.diabcat   |      0.00365         0.71        1         0.3985
      6.diabcat   |     -0.00537         1.61        1         0.2048
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.03340        70.08        1         0.0000
      3.cancer_e~t|     -0.00469         1.24        1         0.2646
      4.cancer_e~t|      0.00449         1.10        1         0.2938
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.00767         4.05        1         0.0441
      3.cancer_h~t|      0.00252         0.34        1         0.5573
      4.cancer_h~t|      0.00090         0.04        1         0.8349
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.00642         2.31        1         0.1284
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01379        11.26        1         0.0008
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00549         1.74        1         0.1868
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.00258         0.38        1         0.5397
      3.reduced_~t|     -0.01901        21.98        1         0.0000
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00332         0.64        1         0.4241
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00507         1.46        1         0.2265
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00143         0.11        1         0.7384
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.00182         0.17        1         0.6760
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00336         0.62        1         0.4304
      ------------+---------------------------------------------------
      global test |                    170.58       37         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   5389.34 /        1 =    5389.3390
(80,442 observations deleted)
   1:   2855.99 /        1 =    2855.9890

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,252,860             Number of obs    =   3,252,860
No. of failures      =       49,347
Time at risk         =    592890853
                                                Wald chi2(37)    =   103706.26
Log pseudolikelihood =   -545579.15             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,464,680 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8901024   .0363764    -2.85   0.004     .8215866     .964332
               Kids under 18  |   .9444993   .0496028    -1.09   0.277     .8521158    1.046899
                              |
                         age1 |   1.079802   .0064888    12.78   0.000     1.067159    1.092595
                         age2 |   .9733444   .0224431    -1.17   0.241     .9303358    1.018341
                         age3 |   1.168918   .0678459     2.69   0.007     1.043228    1.309753
                       1.male |   1.162871   .0111776    15.70   0.000     1.141168    1.184986
                              |
                          imd |
                           2  |   1.091531   .0152618     6.26   0.000     1.062025    1.121857
                           3  |   1.164867   .0164824    10.79   0.000     1.133006    1.197624
                           4  |   1.254876   .0184955    15.40   0.000     1.219145    1.291656
             5 most deprived  |   1.421114   .0226005    22.10   0.000     1.377501    1.466108
                              |
                tot_adults_hh |
                           2  |   .8907904   .0094157   -10.94   0.000     .8725258    .9094372
                           3  |   1.024773   .0165666     1.51   0.130     .9928125    1.057763
                              |
           1.htdiag_or_highbp |   .9334362   .0103258    -6.23   0.000     .9134159    .9538954
1.chronic_respiratory_disease |   2.017919   .0224159    63.20   0.000      1.97446    2.062335
                     1.asthma |   .8899053   .0124354    -8.35   0.000      .865863    .9146151
    1.chronic_cardiac_disease |   1.523535   .0152031    42.19   0.000     1.494027    1.553625
                              |
                      diabcat |
            T1DM, controlled  |   1.848439    .176556     6.43   0.000     1.532857    2.228993
          T1DM, uncontrolled  |   2.050277   .1268648    11.60   0.000     1.816113    2.314633
            T2DM, controlled  |   1.242745   .0151623    17.81   0.000      1.21338    1.272821
          T2DM, uncontrolled  |   1.376315   .0232141    18.94   0.000      1.33156    1.422574
          Diabetes, no HbA1c  |    1.81695   .2226674     4.87   0.000     1.428987    2.310244
                              |
            cancer_exhaem_cat |
                   Last year  |   7.891696   .1444662   112.85   0.000     7.613567    8.179986
               2-5 years ago  |   2.980829   .0487988    66.72   0.000     2.886703    3.078024
                    5+ years  |   1.569066    .020566    34.37   0.000     1.529271    1.609897
                              |
              cancer_haem_cat |
                   Last year  |   4.211047   .2498561    24.23   0.000      3.74874    4.730367
               2-5 years ago  |   2.495164   .1021192    22.34   0.000     2.302832    2.703561
                    5+ years  |   1.727775   .0583639    16.19   0.000     1.617088    1.846038
                              |
      1.chronic_liver_disease |   2.562344   .0797111    30.25   0.000      2.41078    2.723436
            1.stroke_dementia |    1.70264   .0209347    43.28   0.000     1.662099     1.74417
                1.other_neuro |   2.111634   .0472389    33.41   0.000     2.021047     2.20628
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.137955   .0122043    12.05   0.000     1.114284    1.162128
           Stage 4/5 egfr<30  |   2.292065   .0443452    42.87   0.000     2.206777    2.380649
                              |
                       1.esrd |   2.279027   .1081424    17.36   0.000     2.076629    2.501151
           1.other_transplant |   1.027484   .1824795     0.15   0.879     .7254424    1.455282
                   1.asplenia |   1.406232   .0974334     4.92   0.000     1.227665    1.610772
           1.ra_sle_psoriasis |   1.140933   .0183208     8.21   0.000     1.105584    1.177412
               1.other_immuno |   2.066908   .1426966    10.52   0.000     1.805325    2.366394
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_1.ster saved
   1:   2728.16 /        1 =    2728.1610

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,252,860             Number of obs    =   3,252,860
No. of failures      =       49,347
Time at risk         =    592890853
                                                Wald chi2(39)    =   103706.09
Log pseudolikelihood =   -545579.12             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,464,680 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |   .9444991   .0496031    -1.09   0.277     .8521151    1.046899
                 1 child <12  |   .8884125    .045058    -2.33   0.020     .8043479    .9812629
              2 children <12  |   .9005445   .0661647    -1.43   0.154     .7797687    1.040027
             3+ children <12  |   .8684579   .1162242    -1.05   0.292     .6680885    1.128921
                              |
                         age1 |   1.079801    .006489    12.78   0.000     1.067157    1.092594
                         age2 |   .9733495   .0224436    -1.17   0.241       .93034    1.018347
                         age3 |   1.168905    .067846     2.69   0.007     1.043214    1.309739
                       1.male |   1.162871   .0111776    15.70   0.000     1.141168    1.184986
                              |
                          imd |
                           2  |   1.091533   .0152618     6.26   0.000     1.062027     1.12186
                           3  |   1.164876   .0164822    10.79   0.000     1.133016    1.197633
                           4  |   1.254889   .0184961    15.40   0.000     1.219156    1.291669
             5 most deprived  |   1.421148   .0226011    22.10   0.000     1.377534    1.466143
                              |
                tot_adults_hh |
                           2  |   .8907954   .0094157   -10.94   0.000     .8725307    .9094424
                           3  |   1.024771   .0165681     1.51   0.130      .992807    1.057764
                              |
           1.htdiag_or_highbp |   .9334367   .0103258    -6.23   0.000     .9134162     .953896
1.chronic_respiratory_disease |   2.017917    .022416    63.20   0.000     1.974458    2.062334
                     1.asthma |   .8899104   .0124355    -8.35   0.000     .8658681    .9146203
    1.chronic_cardiac_disease |   1.523537   .0152031    42.19   0.000     1.494029    1.553628
                              |
                      diabcat |
            T1DM, controlled  |   1.848489   .1765627     6.43   0.000     1.532895    2.229057
          T1DM, uncontrolled  |   2.050281   .1268652    11.60   0.000     1.816116    2.314638
            T2DM, controlled  |   1.242748   .0151625    17.81   0.000     1.213382    1.272824
          T2DM, uncontrolled  |   1.376333   .0232142    18.94   0.000     1.331578    1.422592
          Diabetes, no HbA1c  |   1.816869   .2226583     4.87   0.000     1.428922    2.310143
                              |
            cancer_exhaem_cat |
                   Last year  |   7.891733   .1444667   112.85   0.000     7.613602    8.180023
               2-5 years ago  |   2.980823   .0487984    66.72   0.000     2.886698    3.078017
                    5+ years  |   1.569056   .0205655    34.37   0.000     1.529262    1.609886
                              |
              cancer_haem_cat |
                   Last year  |   4.211003   .2498528    24.23   0.000     3.748703    4.730316
               2-5 years ago  |   2.495138   .1021215    22.34   0.000     2.302802     2.70354
                    5+ years  |   1.727793   .0583648    16.19   0.000     1.617105    1.846058
                              |
      1.chronic_liver_disease |   2.562429   .0797181    30.25   0.000     2.410853    2.723536
            1.stroke_dementia |   1.702645   .0209348    43.28   0.000     1.662104    1.744175
                1.other_neuro |   2.111648   .0472396    33.41   0.000     2.021061    2.206296
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.137951   .0122045    12.05   0.000     1.114281    1.162125
           Stage 4/5 egfr<30  |   2.292058   .0443454    42.87   0.000     2.206769    2.380642
                              |
                       1.esrd |   2.279124   .1081445    17.36   0.000     2.076722    2.501252
           1.other_transplant |   1.027276   .1824392     0.15   0.880     .7253001    1.454978
                   1.asplenia |     1.4062   .0974317     4.92   0.000     1.227636    1.610736
           1.ra_sle_psoriasis |   1.140937   .0183206     8.21   0.000     1.105588    1.177416
               1.other_immuno |   2.066815    .142701    10.52   0.000     1.805225    2.366311
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_non_covid_death.log
  log type:  text
 closed on:  27 Aug 2020, 10:34:00
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
