------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_time_covid_icu.log
  log type:  text
 opened on:   2 Sep 2020, 14:14:47

. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6. stcox   `exposure'                                                              ///
>                         $demogadjlist                                                   ///
>                         $comordidadjlist                                                ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. *Split data by time of study period: days to April 3rd (31 d March, 3d April)
. stsplit cat_time, at(0,34, 200)
  4. recode cat_time 34=1 200=2 
  5. recode `outcome' .=0 
  6. tab cat_time
  7. tab cat_time `outcome'
  8.  
. /*Overlapping time periods
> gen cat_time0=1 if cat==0
> gen cat_time1=1 if cat==0 | cat==0.25
> */
.         
. 
. 
. foreach int_type in cat_time  {
  9. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
 10. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 11. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
 12. if _rc==0{
 13. testparm 1.`int_type'#i.`exposure_type'
 14. di _n "`exposure_type' <66" _n "****************"
 15. lincom 2.`exposure_type', eform
 16. di "`exposure_type' 66+" _n "****************"
 17. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 18. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 19. }
 20. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 21. 
. }
 22. 
. }
 23. 
. }
(12,052,717 observations (episodes) created)
(cat_time: 12052717 changes made)
(covid_icu: 12052717 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,054,790       50.00       50.00
          1 | 12,052,717       50.00      100.00
------------+-----------------------------------
      Total | 24,107,507      100.00

           |   Failure/censoring
           |     indicator for
Observatio |  outcome: covid icu
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |12,054,788          2 |12,054,790 
         1 |12,050,902      1,815 |12,052,717 
-----------+----------------------+----------
     Total |24,105,690      1,817 |24,107,507 

         failure _d:  covid_icu
   analysis time _t:  (stime_covid_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood =   -22607.6
Iteration 1:   log pseudolikelihood = -21974.569
Iteration 2:   log pseudolikelihood = -21412.128
Iteration 3:   log pseudolikelihood = -21156.605
Iteration 4:   log pseudolikelihood = -21149.464
Iteration 5:   log pseudolikelihood = -21149.407
Iteration 6:   log pseudolikelihood = -21149.407
Refining estimates:
Iteration 0:   log pseudolikelihood = -21149.407

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  23,739,627
No. of failures      =        1,724
Time at risk         =   2182954615
                                                Wald chi2(37)    =     4088.84
Log pseudolikelihood =   -21149.407             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.164054   .0827357     2.14   0.033     1.012683    1.338052
               Kids under 18  |   1.208936   .1005208     2.28   0.022     1.027135    1.422916
                              |
                         age1 |   1.122182   .0258604     5.00   0.000     1.072624     1.17403
                         age2 |   .9572931   .0523859    -0.80   0.425     .8599331    1.065676
                         age3 |   .9842464   .1330893    -0.12   0.907     .7551005     1.28293
                       1.male |   1.887741   .0981744    12.22   0.000     1.704804    2.090307
                              |
                          imd |
                           2  |    1.09866   .0959129     1.08   0.281     .9258777    1.303687
                           3  |   1.249622   .1064418     2.62   0.009     1.057484     1.47667
                           4  |   1.469231   .1212527     4.66   0.000     1.249804    1.727182
             5 most deprived  |   1.658324   .1400409     5.99   0.000      1.40536     1.95682
                              |
                tot_adults_hh |
                           2  |   .9765716   .0659493    -0.35   0.726     .8555023    1.114774
                           3  |   1.330248   .0874741     4.34   0.000     1.169391    1.513233
                              |
           1.htdiag_or_highbp |   1.713828   .0956265     9.66   0.000     1.536288    1.911885
1.chronic_respiratory_disease |   1.964829   .1837908     7.22   0.000     1.635698    2.360187
                     1.asthma |   1.381705   .0838139     5.33   0.000     1.226822    1.556141
    1.chronic_cardiac_disease |   1.201641   .1024519     2.15   0.031      1.01672    1.420195
                              |
                      diabcat |
            T1DM, controlled  |    2.09461   .8023791     1.93   0.054      .988632     4.43784
          T1DM, uncontrolled  |   2.776299   .5769856     4.91   0.000     1.847417    4.172224
            T2DM, controlled  |   2.580781    .205812    11.89   0.000     2.207342    3.017399
          T2DM, uncontrolled  |   3.998076   .3033235    18.27   0.000     3.445661    4.639054
          Diabetes, no HbA1c  |   3.829229   1.719791     2.99   0.003     1.587881    9.234314
                              |
            cancer_exhaem_cat |
                   Last year  |   1.009509   .3587392     0.03   0.979     .5030684    2.025784
               2-5 years ago  |   .8894917   .2011899    -0.52   0.605     .5709691    1.385706
                    5+ years  |   .5900884   .1307246    -2.38   0.017     .3822496    .9109344
                              |
              cancer_haem_cat |
                   Last year  |   4.206136   2.124503     2.84   0.004     1.562949    11.31936
               2-5 years ago  |   4.529882   1.277391     5.36   0.000     2.606483    7.872614
                    5+ years  |   2.279784   .6045275     3.11   0.002     1.355756     3.83359
                              |
      1.chronic_liver_disease |   1.009691   .2109392     0.05   0.963     .6704401    1.520607
            1.stroke_dementia |   1.548228   .2034049     3.33   0.001     1.196753    2.002926
                1.other_neuro |   1.346267   .2769658     1.45   0.148     .8995276    2.014874
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.752745   .2054997     4.79   0.000       1.3929    2.205553
           Stage 4/5 egfr<30  |   1.668534   .4123001     2.07   0.038     1.028017    2.708131
                              |
                       1.esrd |   5.610105   1.183449     8.18   0.000     3.710312    8.482649
           1.other_transplant |   .4059364   .2987194    -1.23   0.221     .0959573    1.717268
                   1.asplenia |   2.697069   .8318444     3.22   0.001     1.473533    4.936557
           1.ra_sle_psoriasis |   1.220279   .1139425     2.13   0.033       1.0162    1.465344
               1.other_immuno |   2.310997   .5264295     3.68   0.000     1.478772     3.61158
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   7185.22 /        1 =    7185.2210

         failure _d:  covid_icu
   analysis time _t:  (stime_covid_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood =   -22607.6
Iteration 1:   log pseudolikelihood =  -21974.14
Iteration 2:   log pseudolikelihood = -21411.212
Iteration 3:   log pseudolikelihood = -21155.449
Iteration 4:   log pseudolikelihood = -21148.286
Iteration 5:   log pseudolikelihood = -21148.224
Iteration 6:   log pseudolikelihood = -21148.222
Iteration 7:   log pseudolikelihood = -21148.221
Iteration 8:   log pseudolikelihood = -21148.221
Iteration 9:   log pseudolikelihood = -21148.221
Iteration 10:  log pseudolikelihood =  -21148.22
Iteration 11:  log pseudolikelihood =  -21148.22
Iteration 12:  log pseudolikelihood =  -21148.22
Iteration 13:  log pseudolikelihood =  -21148.22
Iteration 14:  log pseudolikelihood =  -21148.22
Iteration 15:  log pseudolikelihood =  -21148.22
Refining estimates:
Iteration 0:   log pseudolikelihood =  -21148.22

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  23,739,627
No. of failures      =        1,724
Time at risk         =   2182954615
                                                Wald chi2(38)    =    64369.53
Log pseudolikelihood =    -21148.22             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   5.85e-07   4.16e-08  -201.90   0.000     5.09e-07    6.72e-07
               Kids under 18  |   7.461078   10.72118     1.40   0.162     .4463434    124.7194
                              |
                         age1 |   1.122202   .0258624     5.00   0.000      1.07264    1.174054
                         age2 |   .9572558   .0523861    -0.80   0.425     .8598957    1.065639
                         age3 |   .9843278    .133105    -0.12   0.907     .7551561    1.283048
                       1.male |   1.887739   .0981743    12.22   0.000     1.704802    2.090305
                              |
                          imd |
                           2  |   1.098649   .0959121     1.08   0.281     .9258681    1.303674
                           3  |   1.249625   .1064442     2.62   0.009     1.057483    1.476678
                           4  |   1.469185   .1212468     4.66   0.000     1.249769    1.727122
             5 most deprived  |   1.658229   .1400346     5.99   0.000     1.405277    1.956712
                              |
                tot_adults_hh |
                           2  |   .9765265    .065948    -0.35   0.725     .8554598    1.114727
                           3  |   1.330231   .0874734     4.34   0.000     1.169374    1.513214
                              |
           1.htdiag_or_highbp |   1.713818   .0956254     9.66   0.000      1.53628    1.911872
1.chronic_respiratory_disease |    1.96484   .1837923     7.22   0.000     1.635706    2.360201
                     1.asthma |   1.381703   .0838139     5.33   0.000      1.22682    1.556139
    1.chronic_cardiac_disease |   1.201646   .1024525     2.15   0.031     1.016724    1.420202
                              |
                      diabcat |
            T1DM, controlled  |   2.094519   .8023479     1.93   0.054     .9885859    4.437663
          T1DM, uncontrolled  |   2.776193   .5769685     4.91   0.000      1.84734    4.172079
            T2DM, controlled  |   2.580788   .2058111    11.89   0.000      2.20735    3.017404
          T2DM, uncontrolled  |   3.998016   .3033178    18.27   0.000     3.445611    4.638982
          Diabetes, no HbA1c  |   3.829198   1.719769     2.99   0.003     1.587875    9.234201
                              |
            cancer_exhaem_cat |
                   Last year  |   1.009467   .3587236     0.03   0.979     .5030485    2.025698
               2-5 years ago  |    .889513   .2011949    -0.52   0.605     .5709826     1.38574
                    5+ years  |   .5900883   .1307247    -2.38   0.017     .3822494    .9109346
                              |
              cancer_haem_cat |
                   Last year  |   4.206758   2.124809     2.84   0.004     1.563186    11.32099
               2-5 years ago  |    4.52977   1.277364     5.36   0.000     2.606413    7.872436
                    5+ years  |   2.279788   .6045264     3.11   0.002     1.355761    3.833591
                              |
      1.chronic_liver_disease |   1.009685   .2109365     0.05   0.963     .6704382    1.520594
            1.stroke_dementia |   1.548261   .2034051     3.33   0.001     1.196785    2.002959
                1.other_neuro |   1.346223   .2769571     1.45   0.148     .8994975    2.014808
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.752758   .2054984     4.79   0.000     1.392915    2.205562
           Stage 4/5 egfr<30  |   1.668666   .4123059     2.07   0.038     1.028131     2.70826
                              |
                       1.esrd |   5.610184   1.183397     8.18   0.000     3.710453    8.482566
           1.other_transplant |   .4059172   .2987052    -1.23   0.220     .0959528    1.717185
                   1.asplenia |   2.697028   .8318262     3.22   0.001     1.473517    4.936462
           1.ra_sle_psoriasis |     1.2203   .1139444     2.13   0.033     1.016217    1.465369
               1.other_immuno |   2.311102   .5264528     3.68   0.000     1.478841    3.611743
                              |
           cat_time#kids_cat3 |
             1#Kids under 12  |    1993195          .        .       .            .           .
             1#Kids under 18  |   .1612951    .232171    -1.27   0.205     .0096026     2.70929
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   9449.67 /        1 =    9449.6680

 ( 1)  1.cat_time#1.kids_cat3 = 0
 ( 2)  1.cat_time#2.kids_cat3 = 0
       Constraint 1 dropped

           chi2(  1) =    1.61
         Prob > chi2 =    0.2050

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   7.461078   10.72118     1.40   0.162     .4463434    124.7194
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.cat_time#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.203436   .1003141     2.22   0.026     1.022044     1.41702
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_icu_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster not found)
file ./output/an_interaction_cox_models_covid_icu_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster saved
(3,479,128 observations (episodes) created)
(cat_time: 3479128 changes made)
(covid_icu: 3479128 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,489,829       50.08       50.08
          1 |  3,479,128       49.92      100.00
------------+-----------------------------------
      Total |  6,968,957      100.00

           |   Failure/censoring
           |     indicator for
Observatio |  outcome: covid icu
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,489,828          1 | 3,489,829 
         1 | 3,478,258        870 | 3,479,128 
-----------+----------------------+----------
     Total | 6,968,086        871 | 6,968,957 

         failure _d:  covid_icu
   analysis time _t:  (stime_covid_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -9681.7552
Iteration 1:   log pseudolikelihood = -9506.1058
Iteration 2:   log pseudolikelihood = -9413.4268
Iteration 3:   log pseudolikelihood = -9403.0466
Iteration 4:   log pseudolikelihood = -9402.1196
Iteration 5:   log pseudolikelihood = -9402.0794
Iteration 6:   log pseudolikelihood = -9402.0737
Iteration 7:   log pseudolikelihood = -9402.0716
Iteration 8:   log pseudolikelihood = -9402.0709
Iteration 9:   log pseudolikelihood = -9402.0706
Iteration 10:  log pseudolikelihood = -9402.0705
Iteration 11:  log pseudolikelihood = -9402.0705
Iteration 12:  log pseudolikelihood = -9402.0705
Iteration 13:  log pseudolikelihood = -9402.0705
Iteration 14:  log pseudolikelihood = -9402.0705
Iteration 15:  log pseudolikelihood = -9402.0705
Iteration 16:  log pseudolikelihood = -9402.0705
Iteration 17:  log pseudolikelihood = -9402.0705
Iteration 18:  log pseudolikelihood = -9402.0705
Iteration 19:  log pseudolikelihood = -9402.0705
Iteration 20:  log pseudolikelihood = -9402.0705
Iteration 21:  log pseudolikelihood = -9402.0705
Iteration 22:  log pseudolikelihood = -9402.0705
Iteration 23:  log pseudolikelihood = -9402.0705
Iteration 24:  log pseudolikelihood = -9402.0705
Iteration 25:  log pseudolikelihood = -9402.0705
Iteration 26:  log pseudolikelihood = -9402.0705
Iteration 27:  log pseudolikelihood = -9402.0705
Iteration 28:  log pseudolikelihood = -9402.0705
Iteration 29:  log pseudolikelihood = -9402.0705
Iteration 30:  log pseudolikelihood = -9402.0705
Iteration 31:  log pseudolikelihood = -9402.0705
Iteration 32:  log pseudolikelihood = -9402.0705
Iteration 33:  log pseudolikelihood = -9402.0705
Iteration 34:  log pseudolikelihood = -9402.0705
Iteration 35:  log pseudolikelihood = -9402.0705
Iteration 36:  log pseudolikelihood = -9402.0705
Iteration 37:  log pseudolikelihood = -9402.0705
Iteration 38:  log pseudolikelihood = -9402.0705
Iteration 39:  log pseudolikelihood = -9402.0705
Iteration 40:  log pseudolikelihood = -9402.0705
Iteration 41:  log pseudolikelihood = -9402.0705
Iteration 42:  log pseudolikelihood = -9402.0705
Iteration 43:  log pseudolikelihood = -9402.0705
Iteration 44:  log pseudolikelihood = -9402.0705
Iteration 45:  log pseudolikelihood = -9402.0705
Refining estimates:
Iteration 0:   log pseudolikelihood = -9402.0705

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   6,648,828
No. of failures      =          820
Time at risk         =    606783707
                                                Wald chi2(36)    =      562.13
Log pseudolikelihood =   -9402.0705             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.132742   .2288255     0.62   0.537     .7623945    1.682994
               Kids under 18  |   1.340001   .3595817     1.09   0.275      .791936    2.267359
                              |
                         age1 |   .9337251   .0263596    -2.43   0.015     .8834646     .986845
                         age2 |   1.269883   .1843063     1.65   0.100     .9554834    1.687734
                         age3 |   .3493562   .1525986    -2.41   0.016     .1484102    .8223807
                       1.male |   2.722518   .2152953    12.67   0.000     2.331623    3.178948
                              |
                          imd |
                           2  |   1.032015   .1130273     0.29   0.774     .8326479    1.279117
                           3  |   1.199982   .1306647     1.67   0.094     .9693675    1.485461
                           4  |   1.318491   .1502994     2.43   0.015     1.054497    1.648574
             5 most deprived  |   1.364203   .1690316     2.51   0.012     1.070067    1.739191
                              |
                tot_adults_hh |
                           2  |   1.180024   .1012129     1.93   0.054     .9974279    1.396047
                           3  |    1.15711   .1294693     1.30   0.192     .9292516     1.44084
                              |
           1.htdiag_or_highbp |   1.185851   .0957787     2.11   0.035     1.012233    1.389249
1.chronic_respiratory_disease |   1.312059   .1291735     2.76   0.006     1.081811     1.59131
                     1.asthma |   1.269902    .122719     2.47   0.013     1.050783    1.534714
    1.chronic_cardiac_disease |   .9691832   .0852683    -0.36   0.722     .8156758     1.15158
                              |
                      diabcat |
            T1DM, controlled  |   .6900848   .6930144    -0.37   0.712     .0964023    4.939893
          T1DM, uncontrolled  |   2.342448   .9654424     2.07   0.039     1.044351    5.254042
            T2DM, controlled  |   1.346803   .1329917     3.02   0.003     1.109816    1.634395
          T2DM, uncontrolled  |   2.048038   .2261808     6.49   0.000     1.649427    2.542979
          Diabetes, no HbA1c  |   5.23e-20          .        .       .            .           .
                              |
            cancer_exhaem_cat |
                   Last year  |   .8355021   .2815387    -0.53   0.594      .431637    1.617247
               2-5 years ago  |   .7453716    .155857    -1.41   0.160     .4947512    1.122946
                    5+ years  |    1.04385   .1319349     0.34   0.734     .8148027    1.337284
                              |
              cancer_haem_cat |
                   Last year  |   5.227994   2.154846     4.01   0.000     2.330728    11.72678
               2-5 years ago  |    3.57926   1.004363     4.54   0.000     2.065098    6.203627
                    5+ years  |   1.785633   .5056533     2.05   0.041     1.025062     3.11053
                              |
      1.chronic_liver_disease |   .5532389    .224167    -1.46   0.144     .2500427    1.224084
            1.stroke_dementia |   1.183511   .1570581     1.27   0.204     .9124593    1.535081
                1.other_neuro |   .8467354   .2285698    -0.62   0.538     .4988527     1.43722
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.297037   .1214522     2.78   0.005     1.079561    1.558322
           Stage 4/5 egfr<30  |   1.485862   .3706191     1.59   0.112     .9113033    2.422669
                              |
                       1.esrd |   3.884081    1.17388     4.49   0.000     2.147983    7.023373
           1.other_transplant |   2.841918   2.081309     1.43   0.154      .676433    11.93983
                   1.asplenia |   1.626306   .8236383     0.96   0.337     .6027174    4.388246
           1.ra_sle_psoriasis |   1.316293   .1537295     2.35   0.019     1.046987    1.654871
               1.other_immuno |   .8679518   .6219729    -0.20   0.843     .2130718    3.535617
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   3956.80 /        1 =    3956.7950

         failure _d:  covid_icu
   analysis time _t:  (stime_covid_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -9681.7552
Iteration 1:   log pseudolikelihood = -9506.0789
Iteration 2:   log pseudolikelihood = -9413.3839
Iteration 3:   log pseudolikelihood = -9402.9992
Iteration 4:   log pseudolikelihood = -9402.0707
Iteration 5:   log pseudolikelihood = -9402.0299
Iteration 6:   log pseudolikelihood =  -9402.024
Iteration 7:   log pseudolikelihood = -9402.0219
Iteration 8:   log pseudolikelihood = -9402.0211
Iteration 9:   log pseudolikelihood = -9402.0208
Iteration 10:  log pseudolikelihood = -9402.0207
Iteration 11:  log pseudolikelihood = -9402.0206
Iteration 12:  log pseudolikelihood = -9402.0206
Iteration 13:  log pseudolikelihood = -9402.0206
Iteration 14:  log pseudolikelihood = -9402.0206
Iteration 15:  log pseudolikelihood = -9402.0206
Iteration 16:  log pseudolikelihood = -9402.0206
Iteration 17:  log pseudolikelihood = -9402.0206
Iteration 18:  log pseudolikelihood = -9402.0206
Iteration 19:  log pseudolikelihood = -9402.0206
Iteration 20:  log pseudolikelihood = -9402.0206
Iteration 21:  log pseudolikelihood = -9402.0206
Iteration 22:  log pseudolikelihood = -9402.0206
Iteration 23:  log pseudolikelihood = -9402.0206
Iteration 24:  log pseudolikelihood = -9402.0206
Iteration 25:  log pseudolikelihood = -9402.0206
Iteration 26:  log pseudolikelihood = -9402.0206
Iteration 27:  log pseudolikelihood = -9402.0206
Iteration 28:  log pseudolikelihood = -9402.0206
Iteration 29:  log pseudolikelihood = -9402.0206
Refining estimates:
Iteration 0:   log pseudolikelihood = -9402.0206
Iteration 1:   log pseudolikelihood = -9402.0206
Iteration 2:   log pseudolikelihood = -9402.0206
Iteration 3:   log pseudolikelihood = -9402.0206
Iteration 4:   log pseudolikelihood = -9402.0206

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   6,648,828
No. of failures      =          820
Time at risk         =    606783707
                                                Wald chi2(37)    =   373223.02
Log pseudolikelihood =   -9402.0206             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   3.57e-07   7.22e-08   -73.48   0.000     2.40e-07    5.31e-07
               Kids under 18  |   1.02e-06   2.72e-07   -51.43   0.000     6.00e-07    1.72e-06
                              |
                         age1 |   .9337274   .0263598    -2.43   0.015     .8834666    .9868477
                         age2 |   1.269866   .1843045     1.65   0.100     .9554698    1.687713
                         age3 |   .3493678   .1526042    -2.41   0.016     .1484148    .8224102
                       1.male |   2.722525   .2152958    12.67   0.000     2.331628    3.178955
                              |
                          imd |
                           2  |   1.032018   .1130279     0.29   0.774     .8326504    1.279122
                           3  |   1.199981   .1306646     1.67   0.094     .9693662    1.485459
                           4  |   1.318493   .1503003     2.43   0.015     1.054499    1.648579
             5 most deprived  |   1.364177   .1690291     2.51   0.012     1.070045    1.739159
                              |
                tot_adults_hh |
                           2  |   1.180008   .1012113     1.93   0.054     .9974153    1.396028
                           3  |   1.157111   .1294687     1.30   0.192      .929254     1.44084
                              |
           1.htdiag_or_highbp |   1.185854   .0957787     2.11   0.035     1.012235    1.389251
1.chronic_respiratory_disease |   1.312064   .1291738     2.76   0.006     1.081816    1.591316
                     1.asthma |   1.269893   .1227173     2.47   0.013     1.050776    1.534701
    1.chronic_cardiac_disease |   .9691828   .0852682    -0.36   0.722     .8156755     1.15158
                              |
                      diabcat |
            T1DM, controlled  |   .6900713   .6930013    -0.37   0.712     .0964003    4.939802
          T1DM, uncontrolled  |    2.34242   .9654318     2.07   0.039     1.044338    5.253984
            T2DM, controlled  |   1.346784   .1329903     3.01   0.003       1.1098    1.634373
          T2DM, uncontrolled  |   2.047983   .2261765     6.49   0.000      1.64938    2.542915
          Diabetes, no HbA1c  |   8.51e-15   5.75e-16  -479.99   0.000     7.46e-15    9.72e-15
                              |
            cancer_exhaem_cat |
                   Last year  |   .8354951   .2815364    -0.53   0.594     .4316333    1.617234
               2-5 years ago  |   .7453731   .1558572    -1.41   0.160     .4947523    1.122948
                    5+ years  |   1.043856   .1319357     0.34   0.734     .8148076    1.337292
                              |
              cancer_haem_cat |
                   Last year  |   5.227931    2.15482     4.01   0.000       2.3307    11.72664
               2-5 years ago  |   3.579229   1.004355     4.54   0.000      2.06508    6.203576
                    5+ years  |   1.785653   .5056589     2.05   0.041     1.025073    3.110564
                              |
      1.chronic_liver_disease |   .5532384   .2241669    -1.46   0.144     .2500423    1.224084
            1.stroke_dementia |    1.18351   .1570578     1.27   0.204     .9124586    1.535079
                1.other_neuro |    .846739   .2285707    -0.62   0.538     .4988549    1.437225
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |    1.29704   .1214523     2.78   0.005     1.079564    1.558326
           Stage 4/5 egfr<30  |   1.485869   .3706213     1.59   0.112     .9113068    2.422681
                              |
                       1.esrd |   3.883862    1.17382     4.49   0.000     2.147856    7.022999
           1.other_transplant |   2.841804   2.081231     1.43   0.154     .6764037    11.93939
                   1.asplenia |   1.626339   .8236549     0.96   0.337     .6027294    4.388335
           1.ra_sle_psoriasis |   1.316297   .1537299     2.35   0.019      1.04699    1.654876
               1.other_immuno |    .867974   .6219881    -0.20   0.843     .2130776    3.535702
                              |
           cat_time#kids_cat3 |
             1#Kids under 12  |    3174122          .        .       .            .           .
             1#Kids under 18  |    1321381          .        .       .            .           .
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   3841.51 /        1 =    3841.5100

 ( 1)  1.cat_time#1.kids_cat3 = 0
 ( 2)  1.cat_time#2.kids_cat3 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.02e-06   2.72e-07   -51.43   0.000     6.00e-07    1.72e-06
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.cat_time#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.341696   .3600457     1.10   0.273     .7929268    2.270257
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_icu_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster not found)
file ./output/an_interaction_cox_models_covid_icu_kids_cat3_cat_time_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_time_covid_icu.log
  log type:  text
 closed on:   2 Sep 2020, 21:09:11
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
