------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\WORMS_04a_an_descriptive_safetables.log
  log type:  text
 opened on:  26 Aug 2020, 20:12:57

. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_worms_ageband_`x', clear
  3. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. ta shield
 16. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 17.                                                 
. safetab `var'
 18. }
 19. 
. safetab imd 
 20. safetab imd, m
 21. safetab ethnicity
 22. safetab ethnicity, m
 23. safetab stp
 24. 
. 
. * Outcomes
. safetab worms
 25. 
. 
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist worms {
 26. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                        `outvar', col
 27.         safetab male                                                            `outvar', col
 28.         safetab bmicat                                                          `outvar', col m 
 29.         safetab smoke                                                           `outvar', col m
 30.         safetab obese4cat                                                       `outvar', col m 
 31.         safetab shield                                                          `outvar', col m 
 32. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 33.         safetab `var'           `outvar', col
 34. }
 35.         
.         safetab imd                                                             `outvar', col m
 36.         safetab ethnicity                                                       `outvar', col m
 37.         *safetab urban                                                          `outvar', col
.         safetab stp                                                             `outvar', col
 38. }
 39. 
. 
. ********************************************
. *  Cumulative incidence of WORMS
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_worms_ageband_`x'.dta", clear
 40. 
. sts list , at(0 80) by(agegroup male) fail
 41. 
. 
. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 11,715,468    42.04181    13.61814         18         66
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  2,670,619       22.80       22.80
     30-<40 |  2,614,399       22.32       45.11
     40-<50 |  2,419,176       20.65       65.76
     50-<60 |  2,544,813       21.72       87.48
     60-<70 |  1,466,461       12.52      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,715,468      100.00      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  5,839,089       49.84       49.84
          1 |  5,876,379       50.16      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    205,962        2.28        2.28
  Normal (18.5-24.9) |  3,273,270       36.18       38.46
Overweight (25-29.9) |  3,008,848       33.26       71.72
   Obese I (30-34.9) |  1,564,950       17.30       89.02
  Obese II (35-39.9) |    644,862        7.13       96.15
     Obese III (40+) |    348,656        3.85      100.00
---------------------+-----------------------------------
               Total |  9,046,548      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    205,962        1.76        1.76
  Normal (18.5-24.9) |  3,273,270       27.94       29.70
Overweight (25-29.9) |  3,008,848       25.68       55.38
   Obese I (30-34.9) |  1,564,950       13.36       68.74
  Obese II (35-39.9) |    644,862        5.50       74.24
     Obese III (40+) |    348,656        2.98       77.22
        Unknown (.u) |  2,668,920       22.78      100.00
---------------------+-----------------------------------
               Total | 11,715,468      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  9,157,000       78.16       78.16
   Obese I (30-34.9) |  1,564,950       13.36       91.52
  Obese II (35-39.9) |    644,862        5.50       97.02
     Obese III (40+) |    348,656        2.98      100.00
---------------------+-----------------------------------
               Total | 11,715,468      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,568,179       49.67       49.67
      Former |  3,264,685       29.12       78.78
     Current |  2,378,565       21.22      100.00
-------------+-----------------------------------
       Total | 11,211,429      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,568,179       47.53       47.53
      Former |  3,264,685       27.87       75.39
     Current |  2,378,565       20.30       95.70
Unknown (.u) |    504,039        4.30      100.00
-------------+-----------------------------------
       Total | 11,715,468      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  2,972,520       28.88       28.88
      Elevated |  1,668,256       16.21       45.09
 High, stage I |  3,592,380       34.90       79.99
High, stage II |  2,060,219       20.01      100.00
---------------+-----------------------------------
         Total | 10,293,375      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  2,972,520       25.37       25.37
      Elevated |  1,668,256       14.24       39.61
 High, stage I |  3,592,380       30.66       70.28
High, stage II |  2,060,219       17.59       87.86
       Unknown |  1,422,093       12.14      100.00
---------------+-----------------------------------
         Total | 11,715,468      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,818,969       75.28       75.28
          1 |  2,896,499       24.72      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,222,854       78.72       78.72
          1 |  2,492,614       21.28      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,456,457       97.79       97.79
          1 |    259,011        2.21      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,724,020       83.00       83.00
          1 |  1,991,448       17.00      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,340,601       96.80       96.80
          1 |    374,867        3.20      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 10,915,144       94.73       94.73
  T1DM, controlled |     16,279        0.14       94.87
T1DM, uncontrolled |     48,436        0.42       95.29
  T2DM, controlled |    304,814        2.65       97.93
T2DM, uncontrolled |    233,094        2.02       99.96
Diabetes, no HbA1c |      4,893        0.04      100.00
-------------------+-----------------------------------
             Total | 11,522,660      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,426,109       97.53       97.53
    Last year |     31,565        0.27       97.80
2-5 years ago |     92,065        0.79       98.59
     5+ years |    165,729        1.41      100.00
--------------+-----------------------------------
        Total | 11,715,468      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,674,976       99.65       99.65
    Last year |      3,264        0.03       99.68
2-5 years ago |     10,345        0.09       99.77
     5+ years |     26,883        0.23      100.00
--------------+-----------------------------------
        Total | 11,715,468      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,678,855       99.69       99.69
          1 |     36,613        0.31      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,712,491       99.97       99.97
          1 |      2,977        0.03      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,701,042       99.88       99.88
          1 |     14,426        0.12      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,649,665       99.44       99.44
          1 |     65,803        0.56      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,629,266       99.26       99.26
          1 |     86,202        0.74      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,612,349       99.12       99.12
          1 |    103,119        0.88      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,684        0.06        0.06
         15 |      6,754        0.08        0.14
         30 |     17,458        0.22        0.36
         45 |    115,414        1.45        1.81
         60 |  7,837,591       98.19      100.00
------------+-----------------------------------
      Total |  7,981,901      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 11,571,158       98.77       98.77
Stage 3a/3b egfr 30-60       |    132,872        1.13       99.90
           Stage 4/5 egfr<30 |     11,438        0.10      100.00
-----------------------------+-----------------------------------
                       Total | 11,715,468      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,238,203       87.39       87.39
          1 |  1,477,265       12.61      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,174,372       95.38       95.38
          1 |    541,096        4.62      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,261,933       19.31       19.31
               2 |  2,312,987       19.74       39.05
               3 |  2,399,724       20.48       59.53
               4 |  2,456,993       20.97       80.51
 5 most deprived |  2,283,831       19.49      100.00
-----------------+-----------------------------------
           Total | 11,715,468      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,261,933       19.31       19.31
               2 |  2,312,987       19.74       39.05
               3 |  2,399,724       20.48       59.53
               4 |  2,456,993       20.97       80.51
 5 most deprived |  2,283,831       19.49      100.00
-----------------+-----------------------------------
           Total | 11,715,468      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,433,871       83.62       83.62
                 Mixed |    143,016        1.61       85.22
Asian or Asian British |    776,851        8.74       93.96
                 Black |    280,930        3.16       97.12
                 Other |    255,918        2.88      100.00
-----------------------+-----------------------------------
                 Total |  8,890,586      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,433,871       63.45       63.45
                 Mixed |    143,016        1.22       64.67
Asian or Asian British |    776,851        6.63       71.31
                 Black |    280,930        2.40       73.70
                 Other |    255,918        2.18       75.89
               Unknown |  2,824,882       24.11      100.00
-----------------------+-----------------------------------
                 Total | 11,715,468      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,280        0.02        0.02
          2 |  1,128,538        9.63        9.65
          3 |    514,675        4.39       14.05
          4 |    116,556        0.99       15.04
          5 |     82,247        0.70       15.74
          6 |    556,010        4.75       20.49
          7 |     30,756        0.26       20.75
          8 |    437,826        3.74       24.49
          9 |    336,992        2.88       27.36
         10 |    473,419        4.04       31.41
         11 |    522,421        4.46       35.86
         12 |    176,318        1.51       37.37
         13 |    259,382        2.21       39.58
         14 |    325,642        2.78       42.36
         15 |    417,462        3.56       45.93
         16 |    419,999        3.58       49.51
         17 |    359,641        3.07       52.58
         18 |    520,109        4.44       57.02
         19 |    406,774        3.47       60.49
         20 |    586,502        5.01       65.50
         21 |    868,780        7.42       72.91
         22 |     57,465        0.49       73.41
         23 |    443,073        3.78       77.19
         24 |     21,498        0.18       77.37
         25 |    112,239        0.96       78.33
         26 |    363,109        3.10       81.43
         27 |    448,492        3.83       85.26
         28 |    363,546        3.10       88.36
         29 |    299,341        2.56       90.91
         30 |    232,096        1.98       92.90
         31 |     13,736        0.12       93.01
         32 |    818,544        6.99      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      worms |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,515,723       98.30       98.30
          1 |    199,745        1.70      100.00
------------+-----------------------------------
      Total | 11,715,468      100.00
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped |    outcome: worms
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,580,740     89,879 | 2,670,619 
           |     22.41      45.00 |     22.80 
-----------+----------------------+----------
    30-<40 | 2,567,346     47,053 | 2,614,399 
           |     22.29      23.56 |     22.32 
-----------+----------------------+----------
    40-<50 | 2,390,417     28,759 | 2,419,176 
           |     20.76      14.40 |     20.65 
-----------+----------------------+----------
    50-<60 | 2,520,265     24,548 | 2,544,813 
           |     21.89      12.29 |     21.72 
-----------+----------------------+----------
    60-<70 | 1,456,955      9,506 | 1,466,461 
           |     12.65       4.76 |     12.52 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
11

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: worms
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,716,635    122,454 | 5,839,089 
           |     49.64      61.31 |     49.84 
-----------+----------------------+----------
         1 | 5,799,088     77,291 | 5,876,379 
           |     50.36      38.69 |     50.16 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: worms
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   201,343      4,619 |   205,962 
                     |      1.75       2.31 |      1.76 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,215,533     57,737 | 3,273,270 
                     |     27.92      28.91 |     27.94 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,964,417     44,431 | 3,008,848 
                     |     25.74      22.24 |     25.68 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,540,130     24,820 | 1,564,950 
                     |     13.37      12.43 |     13.36 
---------------------+----------------------+----------
  Obese II (35-39.9) |   633,032     11,830 |   644,862 
                     |      5.50       5.92 |      5.50 
---------------------+----------------------+----------
     Obese III (40+) |   341,558      7,098 |   348,656 
                     |      2.97       3.55 |      2.98 
---------------------+----------------------+----------
        Unknown (.u) | 2,619,710     49,210 | 2,668,920 
                     |     22.75      24.64 |     22.78 
---------------------+----------------------+----------
               Total |11,515,723    199,745 |11,715,468 
                     |    100.00     100.00 |    100.00 
12

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking |    outcome: worms
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,475,306     92,873 | 5,568,179 
             |     47.55      46.50 |     47.53 
-------------+----------------------+----------
      Former | 3,213,470     51,215 | 3,264,685 
             |     27.91      25.64 |     27.87 
-------------+----------------------+----------
     Current | 2,333,594     44,971 | 2,378,565 
             |     20.26      22.51 |     20.30 
-------------+----------------------+----------
Unknown (.u) |   493,353     10,686 |   504,039 
             |      4.28       5.35 |      4.30 
-------------+----------------------+----------
       Total |11,515,723    199,745 |11,715,468 
             |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity |    outcome: worms
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,001,003    155,997 | 9,157,000 
                     |     78.16      78.10 |     78.16 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,540,130     24,820 | 1,564,950 
                     |     13.37      12.43 |     13.36 
---------------------+----------------------+----------
  Obese II (35-39.9) |   633,032     11,830 |   644,862 
                     |      5.50       5.92 |      5.50 
---------------------+----------------------+----------
     Obese III (40+) |   341,558      7,098 |   348,656 
                     |      2.97       3.55 |      2.98 
---------------------+----------------------+----------
               Total |11,515,723    199,745 |11,715,468 
                     |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable |    outcome: worms
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,078,839    144,015 | 9,222,854 
           |     78.84      72.10 |     78.72 
-----------+----------------------+----------
         1 | 2,436,884     55,730 | 2,492,614 
           |     21.16      27.90 |     21.28 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator |    outcome: worms
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,259,981    196,476 |11,456,457 
           |     97.78      98.36 |     97.79 
-----------+----------------------+----------
         1 |   255,742      3,269 |   259,011 
           |      2.22       1.64 |      2.21 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma |    outcome: worms
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,574,431    149,589 | 9,724,020 
           |     83.14      74.89 |     83.00 
-----------+----------------------+----------
         1 | 1,941,292     50,156 | 1,991,448 
           |     16.86      25.11 |     17.00 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac |    outcome: worms
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,144,941    195,660 |11,340,601 
           |     96.78      97.95 |     96.80 
-----------+----------------------+----------
         1 |   370,782      4,085 |   374,867 
           |      3.22       2.05 |      3.20 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |    outcome: worms
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |10,724,456    190,688 |10,915,144 
                   |     94.69      96.62 |     94.73 
-------------------+----------------------+----------
  T1DM, controlled |    15,999        280 |    16,279 
                   |      0.14       0.14 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    47,330      1,106 |    48,436 
                   |      0.42       0.56 |      0.42 
-------------------+----------------------+----------
  T2DM, controlled |   301,924      2,890 |   304,814 
                   |      2.67       1.46 |      2.65 
-------------------+----------------------+----------
T2DM, uncontrolled |   230,753      2,341 |   233,094 
                   |      2.04       1.19 |      2.02 
-------------------+----------------------+----------
Diabetes, no HbA1c |     4,840         53 |     4,893 
                   |      0.04       0.03 |      0.04 
-------------------+----------------------+----------
             Total |11,325,302    197,358 |11,522,660 
                   |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo |    outcome: worms
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,229,638    196,471 |11,426,109 
              |     97.52      98.36 |     97.53 
--------------+----------------------+----------
    Last year |    31,228        337 |    31,565 
              |      0.27       0.17 |      0.27 
--------------+----------------------+----------
2-5 years ago |    91,110        955 |    92,065 
              |      0.79       0.48 |      0.79 
--------------+----------------------+----------
     5+ years |   163,747      1,982 |   165,729 
              |      1.42       0.99 |      1.41 
--------------+----------------------+----------
        Total |11,515,723    199,745 |11,715,468 
              |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica |    outcome: worms
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,475,741    199,235 |11,674,976 
              |     99.65      99.74 |     99.65 
--------------+----------------------+----------
    Last year |     3,226         38 |     3,264 
              |      0.03       0.02 |      0.03 
--------------+----------------------+----------
2-5 years ago |    10,230        115 |    10,345 
              |      0.09       0.06 |      0.09 
--------------+----------------------+----------
     5+ years |    26,526        357 |    26,883 
              |      0.23       0.18 |      0.23 
--------------+----------------------+----------
        Total |11,515,723    199,745 |11,715,468 
              |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on |    outcome: worms
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |11,479,631    199,224 |11,678,855 
           |     99.69      99.74 |     99.69 
-----------+----------------------+----------
         1 |    36,092        521 |    36,613 
           |      0.31       0.26 |      0.31 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |   Failure/censoring
     solid |     indicator for
     organ |    outcome: worms
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |11,512,779    199,712 |11,712,491 
           |     99.97      99.98 |     99.97 
-----------+----------------------+----------
         1 |     2,944         33 |     2,977 
           |      0.03       0.02 |      0.03 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: worms
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,501,494    199,548 |11,701,042 
           |     99.88      99.90 |     99.88 
-----------+----------------------+----------
         1 |    14,229        197 |    14,426 
           |      0.12       0.10 |      0.12 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver |    outcome: worms
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,450,616    199,049 |11,649,665 
           |     99.43      99.65 |     99.44 
-----------+----------------------+----------
         1 |    65,107        696 |    65,803 
           |      0.57       0.35 |      0.56 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic |    outcome: worms
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,430,787    198,479 |11,629,266 
           |     99.26      99.37 |     99.26 
-----------+----------------------+----------
         1 |    84,936      1,266 |    86,202 
           |      0.74       0.63 |      0.74 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or |    outcome: worms
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,413,735    198,614 |11,612,349 
           |     99.11      99.43 |     99.12 
-----------+----------------------+----------
         1 |   101,988      1,131 |   103,119 
           |      0.89       0.57 |      0.88 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Calculated |    outcome: worms
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,647         37 |     4,684 
           |      0.06       0.03 |      0.06 
-----------+----------------------+----------
        15 |     6,685         69 |     6,754 
           |      0.09       0.05 |      0.08 
-----------+----------------------+----------
        30 |    17,308        150 |    17,458 
           |      0.22       0.11 |      0.22 
-----------+----------------------+----------
        45 |   114,399      1,015 |   115,414 
           |      1.46       0.72 |      1.45 
-----------+----------------------+----------
        60 | 7,696,989    140,602 | 7,837,591 
           |     98.18      99.10 |     98.19 
-----------+----------------------+----------
     Total | 7,840,028    141,873 | 7,981,901 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney |    outcome: worms
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,372,684    198,474 |11,571,158 
                      |     98.76      99.36 |     98.77 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   131,707      1,165 |   132,872 
                      |      1.14       0.58 |      1.13 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,332        106 |    11,438 
                      |      0.10       0.05 |      0.10 
----------------------+----------------------+----------
                Total |11,515,723    199,745 |11,715,468 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi |    outcome: worms
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,052,039    186,164 |10,238,203 
           |     87.29      93.20 |     87.39 
-----------+----------------------+----------
         1 | 1,463,684     13,581 | 1,477,265 
           |     12.71       6.80 |     12.61 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune |    outcome: worms
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |10,985,207    189,165 |11,174,372 
           |     95.39      94.70 |     95.38 
-----------+----------------------+----------
         1 |   530,516     10,580 |   541,096 
           |      4.61       5.30 |      4.62 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 
10

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation |    outcome: worms
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,227,188     34,745 | 2,261,933 
                 |     19.34      17.39 |     19.31 
-----------------+----------------------+----------
               2 | 2,276,241     36,746 | 2,312,987 
                 |     19.77      18.40 |     19.74 
-----------------+----------------------+----------
               3 | 2,359,986     39,738 | 2,399,724 
                 |     20.49      19.89 |     20.48 
-----------------+----------------------+----------
               4 | 2,413,536     43,457 | 2,456,993 
                 |     20.96      21.76 |     20.97 
-----------------+----------------------+----------
 5 most deprived | 2,238,772     45,059 | 2,283,831 
                 |     19.44      22.56 |     19.49 
-----------------+----------------------+----------
           Total |11,515,723    199,745 |11,715,468 
                 |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: worms
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,308,087    125,784 | 7,433,871 
                      |     63.46      62.97 |     63.45 
----------------------+----------------------+----------
                Mixed |   141,177      1,839 |   143,016 
                      |      1.23       0.92 |      1.22 
----------------------+----------------------+----------
Asian or Asian Britis |   770,708      6,143 |   776,851 
                      |      6.69       3.08 |      6.63 
----------------------+----------------------+----------
                Black |   278,214      2,716 |   280,930 
                      |      2.42       1.36 |      2.40 
----------------------+----------------------+----------
                Other |   254,283      1,635 |   255,918 
                      |      2.21       0.82 |      2.18 
----------------------+----------------------+----------
              Unknown | 2,763,254     61,628 | 2,824,882 
                      |     24.00      30.85 |     24.11 
----------------------+----------------------+----------
                Total |11,515,723    199,745 |11,715,468 
                      |    100.00     100.00 |    100.00 
10

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi |    outcome: worms
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     2,244         36 |     2,280 
           |      0.02       0.02 |      0.02 
-----------+----------------------+----------
         2 | 1,110,625     17,913 | 1,128,538 
           |      9.64       8.97 |      9.63 
-----------+----------------------+----------
         3 |   504,983      9,692 |   514,675 
           |      4.39       4.85 |      4.39 
-----------+----------------------+----------
         4 |   114,707      1,849 |   116,556 
           |      1.00       0.93 |      0.99 
-----------+----------------------+----------
         5 |    80,689      1,558 |    82,247 
           |      0.70       0.78 |      0.70 
-----------+----------------------+----------
         6 |   546,077      9,933 |   556,010 
           |      4.74       4.97 |      4.75 
-----------+----------------------+----------
         7 |    30,427        329 |    30,756 
           |      0.26       0.16 |      0.26 
-----------+----------------------+----------
         8 |   428,525      9,301 |   437,826 
           |      3.72       4.66 |      3.74 
-----------+----------------------+----------
         9 |   330,336      6,656 |   336,992 
           |      2.87       3.33 |      2.88 
-----------+----------------------+----------
        10 |   465,437      7,982 |   473,419 
           |      4.04       4.00 |      4.04 
-----------+----------------------+----------
        11 |   514,069      8,352 |   522,421 
           |      4.46       4.18 |      4.46 
-----------+----------------------+----------
        12 |   174,256      2,062 |   176,318 
           |      1.51       1.03 |      1.51 
-----------+----------------------+----------
        13 |   254,628      4,754 |   259,382 
           |      2.21       2.38 |      2.21 
-----------+----------------------+----------
        14 |   319,868      5,774 |   325,642 
           |      2.78       2.89 |      2.78 
-----------+----------------------+----------
        15 |   409,002      8,460 |   417,462 
           |      3.55       4.24 |      3.56 
-----------+----------------------+----------
        16 |   410,755      9,244 |   419,999 
           |      3.57       4.63 |      3.58 
-----------+----------------------+----------
        17 |   352,336      7,305 |   359,641 
           |      3.06       3.66 |      3.07 
-----------+----------------------+----------
        18 |   510,704      9,405 |   520,109 
           |      4.43       4.71 |      4.44 
-----------+----------------------+----------
        19 |   401,031      5,743 |   406,774 
           |      3.48       2.88 |      3.47 
-----------+----------------------+----------
        20 |   578,795      7,707 |   586,502 
           |      5.03       3.86 |      5.01 
-----------+----------------------+----------
        21 |   861,237      7,543 |   868,780 
           |      7.48       3.78 |      7.42 
-----------+----------------------+----------
        22 |    56,907        558 |    57,465 
           |      0.49       0.28 |      0.49 
-----------+----------------------+----------
        23 |   436,119      6,954 |   443,073 
           |      3.79       3.48 |      3.78 
-----------+----------------------+----------
        24 |    21,127        371 |    21,498 
           |      0.18       0.19 |      0.18 
-----------+----------------------+----------
        25 |   110,812      1,427 |   112,239 
           |      0.96       0.71 |      0.96 
-----------+----------------------+----------
        26 |   356,059      7,050 |   363,109 
           |      3.09       3.53 |      3.10 
-----------+----------------------+----------
        27 |   441,259      7,233 |   448,492 
           |      3.83       3.62 |      3.83 
-----------+----------------------+----------
        28 |   358,065      5,481 |   363,546 
           |      3.11       2.74 |      3.10 
-----------+----------------------+----------
        29 |   293,875      5,466 |   299,341 
           |      2.55       2.74 |      2.56 
-----------+----------------------+----------
        30 |   227,719      4,377 |   232,096 
           |      1.98       2.19 |      1.98 
-----------+----------------------+----------
        31 |    13,591        145 |    13,736 
           |      0.12       0.07 |      0.12 
-----------+----------------------+----------
        32 |   799,459     19,085 |   818,544 
           |      6.94       9.55 |      6.99 
-----------+----------------------+----------
     Total |11,515,723    199,745 |11,715,468 
           |    100.00     100.00 |    100.00 

         failure _d:  worms
   analysis time _t:  (stime_worms-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000 
      80   1.3e+06       74              0.0001 
18-<30 male=1 
       0         0        0              0.0000 
      80   1.3e+06       31              0.0000 
30-<40 male=0 
       0         0        0              0.0000 
      80   1.3e+06       98              0.0001 
30-<40 male=1 
       0         0        0              0.0000 
      80   1.3e+06       33              0.0000 
40-<50 male=0 
       0         0        0              0.0000 
      80   1.2e+06       39              0.0000 
40-<50 male=1 
       0         0        0              0.0000 
      80   1.2e+06       32              0.0000 
50-<60 male=0 
       0         0        0              0.0000 
      80   1.3e+06       27              0.0000 
50-<60 male=1 
       0         0        0              0.0000 
      80   1.3e+06       24              0.0000 
60-<70 male=0 
       0         0        0              0.0000 
      80    743169       14              0.0000 
60-<70 male=1 
       0         0        0              0.0000 
      80    717624       11              0.0000 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  3,054,487    75.73593    6.684519         67        110
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |    586,738       19.21       19.21
     70-<80 |  1,628,608       53.32       72.53
        80+ |    839,141       27.47      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  3,054,487      100.00      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,648,003       53.95       53.95
          1 |  1,406,484       46.05      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     54,385        1.95        1.95
  Normal (18.5-24.9) |    881,465       31.61       33.56
Overweight (25-29.9) |  1,090,549       39.11       72.68
   Obese I (30-34.9) |    527,864       18.93       91.61
  Obese II (35-39.9) |    169,872        6.09       97.70
     Obese III (40+) |     64,164        2.30      100.00
---------------------+-----------------------------------
               Total |  2,788,299      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     54,385        1.78        1.78
  Normal (18.5-24.9) |    881,465       28.86       30.64
Overweight (25-29.9) |  1,090,549       35.70       66.34
   Obese I (30-34.9) |    527,864       17.28       83.62
  Obese II (35-39.9) |    169,872        5.56       89.18
     Obese III (40+) |     64,164        2.10       91.29
        Unknown (.u) |    266,188        8.71      100.00
---------------------+-----------------------------------
               Total |  3,054,487      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  2,292,587       75.06       75.06
   Obese I (30-34.9) |    527,864       17.28       92.34
  Obese II (35-39.9) |    169,872        5.56       97.90
     Obese III (40+) |     64,164        2.10      100.00
---------------------+-----------------------------------
               Total |  3,054,487      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,224,828       40.34       40.34
      Former |  1,567,299       51.62       91.95
     Current |    244,382        8.05      100.00
-------------+-----------------------------------
       Total |  3,036,509      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,224,828       40.10       40.10
      Former |  1,567,299       51.31       91.41
     Current |    244,382        8.00       99.41
Unknown (.u) |     17,978        0.59      100.00
-------------+-----------------------------------
       Total |  3,054,487      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    324,989       10.73       10.73
      Elevated |    459,046       15.15       25.88
 High, stage I |  1,087,245       35.88       61.76
High, stage II |  1,158,541       38.24      100.00
---------------+-----------------------------------
         Total |  3,029,821      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    324,989       10.64       10.64
      Elevated |    459,046       15.03       25.67
 High, stage I |  1,087,245       35.60       61.26
High, stage II |  1,158,541       37.93       99.19
       Unknown |     24,666        0.81      100.00
---------------+-----------------------------------
         Total |  3,054,487      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    874,107       28.62       28.62
          1 |  2,180,380       71.38      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,976,711       64.71       64.71
          1 |  1,077,776       35.29      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,679,137       87.71       87.71
          1 |    375,350       12.29      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,670,295       87.42       87.42
          1 |    384,192       12.58      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,380,177       77.92       77.92
          1 |    674,310       22.08      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |  2,354,480       80.89       80.89
  T1DM, controlled |      3,892        0.13       81.02
T1DM, uncontrolled |      7,988        0.27       81.29
  T2DM, controlled |    377,156       12.96       94.25
T2DM, uncontrolled |    165,318        5.68       99.93
Diabetes, no HbA1c |      2,043        0.07      100.00
-------------------+-----------------------------------
             Total |  2,910,877      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  2,596,822       85.02       85.02
    Last year |     37,340        1.22       86.24
2-5 years ago |    112,100        3.67       89.91
     5+ years |    308,225       10.09      100.00
--------------+-----------------------------------
        Total |  3,054,487      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  3,007,368       98.46       98.46
    Last year |      4,493        0.15       98.60
2-5 years ago |     14,112        0.46       99.07
     5+ years |     28,514        0.93      100.00
--------------+-----------------------------------
        Total |  3,054,487      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,049,170       99.83       99.83
          1 |      5,317        0.17      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,053,584       99.97       99.97
          1 |        903        0.03      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,046,930       99.75       99.75
          1 |      7,557        0.25      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,027,302       99.11       99.11
          1 |     27,185        0.89      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,992,498       97.97       97.97
          1 |     61,989        2.03      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,812,644       92.08       92.08
          1 |    241,843        7.92      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,766        0.20        0.20
         15 |     37,570        1.30        1.50
         30 |    177,516        6.16        7.66
         45 |    500,753       17.38       25.04
         60 |  2,160,085       74.96      100.00
------------+-----------------------------------
      Total |  2,881,690      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |  2,332,882       76.38       76.38
Stage 3a/3b egfr 30-60       |    678,269       22.21       98.58
           Stage 4/5 egfr<30 |     43,336        1.42      100.00
-----------------------------+-----------------------------------
                       Total |  3,054,487      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,293,683       42.35       42.35
          1 |  1,760,804       57.65      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,820,148       92.33       92.33
          1 |    234,339        7.67      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    771,792       25.27       25.27
               2 |    713,988       23.38       48.64
               3 |    657,768       21.53       70.18
               4 |    529,849       17.35       87.52
 5 most deprived |    381,090       12.48      100.00
-----------------+-----------------------------------
           Total |  3,054,487      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    771,792       25.27       25.27
               2 |    713,988       23.38       48.64
               3 |    657,768       21.53       70.18
               4 |    529,849       17.35       87.52
 5 most deprived |    381,090       12.48      100.00
-----------------+-----------------------------------
           Total |  3,054,487      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,110,412       94.57       94.57
                 Mixed |      8,013        0.36       94.93
Asian or Asian British |     73,284        3.28       98.21
                 Black |     22,743        1.02       99.23
                 Other |     17,176        0.77      100.00
-----------------------+-----------------------------------
                 Total |  2,231,628      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,110,412       69.09       69.09
                 Mixed |      8,013        0.26       69.35
Asian or Asian British |     73,284        2.40       71.75
                 Black |     22,743        0.74       72.50
                 Other |     17,176        0.56       73.06
               Unknown |    822,859       26.94      100.00
-----------------------+-----------------------------------
                 Total |  3,054,487      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        159        0.01        0.01
          2 |    251,843        8.25        8.25
          3 |    136,367        4.46       12.71
          4 |     29,662        0.97       13.69
          5 |     20,684        0.68       14.36
          6 |    142,323        4.66       19.02
          7 |      7,879        0.26       19.28
          8 |    120,580        3.95       23.23
          9 |    113,371        3.71       26.94
         10 |    124,875        4.09       31.03
         11 |    124,600        4.08       35.11
         12 |     33,831        1.11       36.21
         13 |     59,997        1.96       38.18
         14 |     74,115        2.43       40.61
         15 |     97,909        3.21       43.81
         16 |    146,300        4.79       48.60
         17 |    108,778        3.56       52.16
         18 |    108,926        3.57       55.73
         19 |     98,355        3.22       58.95
         20 |    159,567        5.22       64.17
         21 |    115,031        3.77       67.94
         22 |      8,025        0.26       68.20
         23 |    133,232        4.36       72.56
         24 |      7,129        0.23       72.80
         25 |     39,629        1.30       74.09
         26 |    133,521        4.37       78.46
         27 |    129,116        4.23       82.69
         28 |    132,911        4.35       87.04
         29 |     85,903        2.81       89.86
         30 |     70,940        2.32       92.18
         31 |      4,332        0.14       92.32
         32 |    234,597        7.68      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      worms |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,044,813       99.68       99.68
          1 |      9,674        0.32      100.00
------------+-----------------------------------
      Total |  3,054,487      100.00
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped |    outcome: worms
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   584,008      2,730 |   586,738 
           |     19.18      28.22 |     19.21 
-----------+----------------------+----------
    70-<80 | 1,623,397      5,211 | 1,628,608 
           |     53.32      53.87 |     53.32 
-----------+----------------------+----------
       80+ |   837,408      1,733 |   839,141 
           |     27.50      17.91 |     27.47 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
11

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: worms
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,642,087      5,916 | 1,648,003 
           |     53.93      61.15 |     53.95 
-----------+----------------------+----------
         1 | 1,402,726      3,758 | 1,406,484 
           |     46.07      38.85 |     46.05 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: worms
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    54,219        166 |    54,385 
                     |      1.78       1.72 |      1.78 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   878,566      2,899 |   881,465 
                     |     28.85      29.97 |     28.86 
---------------------+----------------------+----------
Overweight (25-29.9) | 1,087,044      3,505 | 1,090,549 
                     |     35.70      36.23 |     35.70 
---------------------+----------------------+----------
   Obese I (30-34.9) |   526,240      1,624 |   527,864 
                     |     17.28      16.79 |     17.28 
---------------------+----------------------+----------
  Obese II (35-39.9) |   169,310        562 |   169,872 
                     |      5.56       5.81 |      5.56 
---------------------+----------------------+----------
     Obese III (40+) |    63,921        243 |    64,164 
                     |      2.10       2.51 |      2.10 
---------------------+----------------------+----------
        Unknown (.u) |   265,513        675 |   266,188 
                     |      8.72       6.98 |      8.71 
---------------------+----------------------+----------
               Total | 3,044,813      9,674 | 3,054,487 
                     |    100.00     100.00 |    100.00 
12

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking |    outcome: worms
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,220,678      4,150 | 1,224,828 
             |     40.09      42.90 |     40.10 
-------------+----------------------+----------
      Former | 1,562,434      4,865 | 1,567,299 
             |     51.31      50.29 |     51.31 
-------------+----------------------+----------
     Current |   243,733        649 |   244,382 
             |      8.00       6.71 |      8.00 
-------------+----------------------+----------
Unknown (.u) |    17,968         10 |    17,978 
             |      0.59       0.10 |      0.59 
-------------+----------------------+----------
       Total | 3,044,813      9,674 | 3,054,487 
             |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity |    outcome: worms
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 2,285,342      7,245 | 2,292,587 
                     |     75.06      74.89 |     75.06 
---------------------+----------------------+----------
   Obese I (30-34.9) |   526,240      1,624 |   527,864 
                     |     17.28      16.79 |     17.28 
---------------------+----------------------+----------
  Obese II (35-39.9) |   169,310        562 |   169,872 
                     |      5.56       5.81 |      5.56 
---------------------+----------------------+----------
     Obese III (40+) |    63,921        243 |    64,164 
                     |      2.10       2.51 |      2.10 
---------------------+----------------------+----------
               Total | 3,044,813      9,674 | 3,054,487 
                     |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable |    outcome: worms
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,970,734      5,977 | 1,976,711 
           |     64.72      61.78 |     64.71 
-----------+----------------------+----------
         1 | 1,074,079      3,697 | 1,077,776 
           |     35.28      38.22 |     35.29 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator |    outcome: worms
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,670,747      8,390 | 2,679,137 
           |     87.71      86.73 |     87.71 
-----------+----------------------+----------
         1 |   374,066      1,284 |   375,350 
           |     12.29      13.27 |     12.29 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
13

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma |    outcome: worms
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,662,208      8,087 | 2,670,295 
           |     87.43      83.60 |     87.42 
-----------+----------------------+----------
         1 |   382,605      1,587 |   384,192 
           |     12.57      16.40 |     12.58 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac |    outcome: worms
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,372,555      7,622 | 2,380,177 
           |     77.92      78.79 |     77.92 
-----------+----------------------+----------
         1 |   672,258      2,052 |   674,310 
           |     22.08      21.21 |     22.08 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |    outcome: worms
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,346,977      7,503 | 2,354,480 
                   |     80.88      81.61 |     80.89 
-------------------+----------------------+----------
  T1DM, controlled |     3,879         13 |     3,892 
                   |      0.13       0.14 |      0.13 
-------------------+----------------------+----------
T1DM, uncontrolled |     7,953         35 |     7,988 
                   |      0.27       0.38 |      0.27 
-------------------+----------------------+----------
  T2DM, controlled |   376,105      1,051 |   377,156 
                   |     12.96      11.43 |     12.96 
-------------------+----------------------+----------
T2DM, uncontrolled |   164,733        585 |   165,318 
                   |      5.68       6.36 |      5.68 
-------------------+----------------------+----------
Diabetes, no HbA1c |     2,036          7 |     2,043 
                   |      0.07       0.08 |      0.07 
-------------------+----------------------+----------
             Total | 2,901,683      9,194 | 2,910,877 
                   |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo |    outcome: worms
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,588,516      8,306 | 2,596,822 
              |     85.01      85.86 |     85.02 
--------------+----------------------+----------
    Last year |    37,232        108 |    37,340 
              |      1.22       1.12 |      1.22 
--------------+----------------------+----------
2-5 years ago |   111,809        291 |   112,100 
              |      3.67       3.01 |      3.67 
--------------+----------------------+----------
     5+ years |   307,256        969 |   308,225 
              |     10.09      10.02 |     10.09 
--------------+----------------------+----------
        Total | 3,044,813      9,674 | 3,054,487 
              |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica |    outcome: worms
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,997,859      9,509 | 3,007,368 
              |     98.46      98.29 |     98.46 
--------------+----------------------+----------
    Last year |     4,475         18 |     4,493 
              |      0.15       0.19 |      0.15 
--------------+----------------------+----------
2-5 years ago |    14,052         60 |    14,112 
              |      0.46       0.62 |      0.46 
--------------+----------------------+----------
     5+ years |    28,427         87 |    28,514 
              |      0.93       0.90 |      0.93 
--------------+----------------------+----------
        Total | 3,044,813      9,674 | 3,054,487 
              |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on |    outcome: worms
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,039,522      9,648 | 3,049,170 
           |     99.83      99.73 |     99.83 
-----------+----------------------+----------
         1 |     5,291         26 |     5,317 
           |      0.17       0.27 |      0.17 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
23

**TABLE OF other_transplant worms REDACTED DUE TO SMALL N**

15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: worms
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,037,277      9,653 | 3,046,930 
           |     99.75      99.78 |     99.75 
-----------+----------------------+----------
         1 |     7,536         21 |     7,557 
           |      0.25       0.22 |      0.25 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver |    outcome: worms
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,017,723      9,579 | 3,027,302 
           |     99.11      99.02 |     99.11 
-----------+----------------------+----------
         1 |    27,090         95 |    27,185 
           |      0.89       0.98 |      0.89 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic |    outcome: worms
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,983,067      9,431 | 2,992,498 
           |     97.97      97.49 |     97.97 
-----------+----------------------+----------
         1 |    61,746        243 |    61,989 
           |      2.03       2.51 |      2.03 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or |    outcome: worms
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,803,690      8,954 | 2,812,644 
           |     92.08      92.56 |     92.08 
-----------+----------------------+----------
         1 |   241,123        720 |   241,843 
           |      7.92       7.44 |      7.92 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Calculated |    outcome: worms
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,749         17 |     5,766 
           |      0.20       0.18 |      0.20 
-----------+----------------------+----------
        15 |    37,492         78 |    37,570 
           |      1.31       0.84 |      1.30 
-----------+----------------------+----------
        30 |   177,106        410 |   177,516 
           |      6.17       4.41 |      6.16 
-----------+----------------------+----------
        45 |   499,381      1,372 |   500,753 
           |     17.39      14.76 |     17.38 
-----------+----------------------+----------
        60 | 2,152,669      7,416 | 2,160,085 
           |     74.94      79.80 |     74.96 
-----------+----------------------+----------
     Total | 2,872,397      9,293 | 2,881,690 
           |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney |    outcome: worms
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,325,085      7,797 | 2,332,882 
                      |     76.36      80.60 |     76.38 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   676,487      1,782 |   678,269 
                      |     22.22      18.42 |     22.21 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    43,241         95 |    43,336 
                      |      1.42       0.98 |      1.42 
----------------------+----------------------+----------
                Total | 3,044,813      9,674 | 3,054,487 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi |    outcome: worms
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,289,204      4,479 | 1,293,683 
           |     42.34      46.30 |     42.35 
-----------+----------------------+----------
         1 | 1,755,609      5,195 | 1,760,804 
           |     57.66      53.70 |     57.65 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune |    outcome: worms
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,811,342      8,806 | 2,820,148 
           |     92.33      91.03 |     92.33 
-----------+----------------------+----------
         1 |   233,471        868 |   234,339 
           |      7.67       8.97 |      7.67 
-----------+----------------------+----------
     Total | 3,044,813      9,674 | 3,054,487 
           |    100.00     100.00 |    100.00 
10

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation |    outcome: worms
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   769,308      2,484 |   771,792 
                 |     25.27      25.68 |     25.27 
-----------------+----------------------+----------
               2 |   711,823      2,165 |   713,988 
                 |     23.38      22.38 |     23.38 
-----------------+----------------------+----------
               3 |   655,852      1,916 |   657,768 
                 |     21.54      19.81 |     21.53 
-----------------+----------------------+----------
               4 |   528,145      1,704 |   529,849 
                 |     17.35      17.61 |     17.35 
-----------------+----------------------+----------
 5 most deprived |   379,685      1,405 |   381,090 
                 |     12.47      14.52 |     12.48 
-----------------+----------------------+----------
           Total | 3,044,813      9,674 | 3,054,487 
                 |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: worms
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,103,776      6,636 | 2,110,412 
                      |     69.09      68.60 |     69.09 
----------------------+----------------------+----------
                Mixed |     7,991         22 |     8,013 
                      |      0.26       0.23 |      0.26 
----------------------+----------------------+----------
Asian or Asian Britis |    72,924        360 |    73,284 
                      |      2.40       3.72 |      2.40 
----------------------+----------------------+----------
                Black |    22,679         64 |    22,743 
                      |      0.74       0.66 |      0.74 
----------------------+----------------------+----------
                Other |    17,106         70 |    17,176 
                      |      0.56       0.72 |      0.56 
----------------------+----------------------+----------
              Unknown |   820,337      2,522 |   822,859 
                      |     26.94      26.07 |     26.94 
----------------------+----------------------+----------
                Total | 3,044,813      9,674 | 3,054,487 
                      |    100.00     100.00 |    100.00 
10

**TABLE OF stp worms REDACTED DUE TO SMALL N**


         failure _d:  worms
   analysis time _t:  (stime_worms-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
             weight:  [pweight=pw]

              Beg.                      Failure
    Time     Total     Fail             Function 
------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000 
      80    [REDACTED] [REDACTED] 0.0000 
60-<70 male=1 
       0         0        0              0.0000 
      80    [REDACTED] [REDACTED] 0.0000 
70-<80 male=0 
       0         0        0              0.0000 
      80    [REDACTED] [REDACTED] 0.0000 
70-<80 male=1 
       0         0        0              0.0000 
      80    [REDACTED] [REDACTED] 0.0000 
80+ male=0 
       0         0        0              0.0000 
      80    [REDACTED] [REDACTED] 0.0000 
80+ male=1 
       0         0        0              0.0000 
      80    [REDACTED] [REDACTED] 0.0000 
------------------------------------------------
Note: Failure function is calculated over full
      data and evaluated at indicated times; it
      is not calculated from aggregates shown at
      left.

. * Close the log file
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\WORMS_04a_an_descriptive_safetables.log
  log type:  text
 closed on:  26 Aug 2020, 20:20:16
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
