------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\WORMS_07a_an_multivariable_cox_models_demogADJ_worms.log
  log type:  text
 opened on:  26 Aug 2020, 20:21:05

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                                        ///
>                         i.male                                                  ///
>                         `bmi'                                   ///
>                         `smoking'                                       ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         i.tot_adults_hh                         ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. 
. foreach exposure_type in kids_cat3 {
  4. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
. }
  9. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 10. 
. }
 11. }
   1:     27.60 /        1 =      27.6030

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,524,499             Number of obs    =     347,125
No. of failures      =        1,433
Time at risk         =   4206145255
                                                Wald chi2(17)    =      674.20
Log pseudolikelihood =   -18415.669             Prob > chi2      =      0.0000

                            (Std. Err. adjusted for 340,938 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |    2.52084    .161512    14.43   0.000     2.223352    2.858133
     Kids under 18  |   1.235416   .1387808     1.88   0.060     .9912732     1.53969
                    |
               age1 |   .9800063   .0088614    -2.23   0.026     .9627912    .9975291
               age2 |    .965159   .0303787    -1.13   0.260     .9074172    1.026575
               age3 |   1.140387   .1083105     1.38   0.167     .9466896    1.373715
             1.male |   .5893894   .0317842    -9.80   0.000     .5302728    .6550965
                    |
          obese4cat |
 Obese I (30-34.9)  |   .9795812   .0800218    -0.25   0.801     .8346531    1.149675
Obese II (35-39.9)  |   1.126402   .1255459     1.07   0.286      .905359    1.401413
   Obese III (40+)  |   1.057709   .1546131     0.38   0.701     .7942179    1.408616
                    |
       smoke_nomiss |
            Former  |   1.173443   .0759232     2.47   0.013     1.033685    1.332096
           Current  |   .9750052   .0714512    -0.35   0.730     .8445558    1.125604
                    |
                imd |
                 2  |   1.168453    .115074     1.58   0.114     .9633446    1.417233
                 3  |    1.07822   .1084351     0.75   0.454     .8853264    1.313142
                 4  |   1.294508   .1240719     2.69   0.007     1.072807    1.562025
   5 most deprived  |   1.533174   .1482125     4.42   0.000     1.268544    1.853008
                    |
      tot_adults_hh |
                 2  |   .9523159   .0642804    -0.72   0.469     .8343067    1.087017
                 3  |   .7480782   .0584194    -3.72   0.000     .6419105    .8718054
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_worms_kids_cat3_DEMOGADJ_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_worms_kids_cat3_DEMOGADJ_noeth_ageband_0.ster saved
   1:      4.99 /        1 =       4.9890

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,044,539             Number of obs    =      91,439
No. of failures      =          106
Time at risk         =   1111220806
                                                Wald chi2(17)    =       55.54
Log pseudolikelihood =   -1219.2549             Prob > chi2      =      0.0000

                             (Std. Err. adjusted for 90,790 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   2.805644   1.481888     1.95   0.051     .9964236    7.899893
     Kids under 18  |   1.785122   1.328067     0.78   0.436     .4153405    7.672405
                    |
               age1 |   1.145285   .1056914     1.47   0.142     .9557872    1.372352
               age2 |   .4562794   .1994342    -1.80   0.073     .1937229    1.074684
               age3 |   4.733208   4.612311     1.60   0.111     .7009641    31.96064
             1.male |   .6388123   .1325397    -2.16   0.031     .4253705    .9593546
                    |
          obese4cat |
 Obese I (30-34.9)  |   .5690893   .1769298    -1.81   0.070     .3094155    1.046692
Obese II (35-39.9)  |   .6764833   .3143924    -0.84   0.400     .2720604    1.682089
   Obese III (40+)  |   2.275059   .9026732     2.07   0.038     1.045351    4.951345
                    |
       smoke_nomiss |
            Former  |   .7778509   .1565365    -1.25   0.212     .5243226    1.153969
           Current  |   .4039034   .1894656    -1.93   0.053      .161061    1.012896
                    |
                imd |
                 2  |   .9673304   .2976397    -0.11   0.914     .5292575    1.768001
                 3  |   1.038144   .3321593     0.12   0.907     .5545124    1.943586
                 4  |   1.313022   .4415412     0.81   0.418     .6792524    2.538124
   5 most deprived  |   1.300538   .4294317     0.80   0.426     .6808641    2.484196
                    |
      tot_adults_hh |
                 2  |    .770683   .1762051    -1.14   0.255     .4923356    1.206397
                 3  |   .9779858   .3254164    -0.07   0.947     .5094512    1.877425
-------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_worms_kids_cat3_DEMOGADJ_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_worms_kids_cat3_DEMOGADJ_noeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\WORMS_07a_an_multivariable_cox_models_demogADJ_worms.log
  log type:  text
 closed on:  26 Aug 2020, 20:21:39
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
