------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\03a_an_descriptive_tables.log
  log type:  text
 opened on:  26 Aug 2020, 18:36:18

. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_ageband_`x', clear
  3. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. safetab htdiag_or_highbp, m
 16. safetab imd 
 17. safetab imd, m
 18. safetab ethnicity
 19. safetab ethnicity, m
 20. safetab stp
 21. safetab tot_adults_hh
 22. safetab household_size
 23. safetab household_size imd, col chi
 24. 
. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat   ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 25.                                                 
. safetab `var'
 26. }
 27. safetab shield
 28. 
. 
. *Exposure 
. foreach var in kids_cat3 gp_number_kids {
 29. safetab `var'
 30. }
 31. 
. * Outcomes
. foreach var in covid_death_icu non_covid_death  ///
>  covid_tpp_prob {
 32. safetab `var'
 33. }
 34. 
. 
. * Outcomes by exposure
. foreach var in covid_death_icu non_covid_death  ///
>  covid_tpp_prob {
 35. safetab `var'
 36. safetab `var' kids_cat3, col row
 37. safetab `var' gp_number_kids, col row
 38. 
. }
 39. 
. **********************************
. *  Number (%) with each exposure  *
. **********************************
. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                        kids_cat3, col
 40.         safetab male                                                            kids_cat3, col
 41.         safetab bmicat                                                          kids_cat3, col m 
 42.         safetab smoke                                                           kids_cat3, col m
 43.         safetab obese4cat                                                       kids_cat3, col m 
 44.         safetab shield                                                          kids_cat3, col m 
 45.         safetab tot_adults_hh                                           kids_cat3, col m 
 46.         safetab household_size                                          kids_cat3, col m 
 47.         safetab imd                                                             kids_cat3, col m
 48.         safetab ethnicity                                                       kids_cat3, col m
 49.         safetab stp                                                             kids_cat3, col
 50.         
.         
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 51.         safetab `var'           kids_cat3, col
 52. }
 53.         
. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 12,054,790    41.46564     13.3974         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  2,845,170       23.60       23.60
     30-<40 |  2,768,104       22.96       46.56
     40-<50 |  2,495,511       20.70       67.27
     50-<60 |  2,624,926       21.77       89.04
     60-<70 |  1,321,079       10.96      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,054,790      100.00      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  6,009,141       49.85       49.85
          1 |  6,045,649       50.15      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    223,686        2.44        2.44
  Normal (18.5-24.9) |  3,406,279       37.19       39.64
Overweight (25-29.9) |  3,003,382       32.79       72.43
   Obese I (30-34.9) |  1,543,250       16.85       89.28
  Obese II (35-39.9) |    635,788        6.94       96.23
     Obese III (40+) |    345,676        3.77      100.00
---------------------+-----------------------------------
               Total |  9,158,061      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    223,686        1.86        1.86
  Normal (18.5-24.9) |  3,406,279       28.26       30.11
Overweight (25-29.9) |  3,003,382       24.91       55.03
   Obese I (30-34.9) |  1,543,250       12.80       67.83
  Obese II (35-39.9) |    635,788        5.27       73.10
     Obese III (40+) |    345,676        2.87       75.97
        Unknown (.u) |  2,896,729       24.03      100.00
---------------------+-----------------------------------
               Total | 12,054,790      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  9,530,076       79.06       79.06
   Obese I (30-34.9) |  1,543,250       12.80       91.86
  Obese II (35-39.9) |    635,788        5.27       97.13
     Obese III (40+) |    345,676        2.87      100.00
---------------------+-----------------------------------
               Total | 12,054,790      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,728,099       49.98       49.98
      Former |  3,303,232       28.82       78.80
     Current |  2,429,584       21.20      100.00
-------------+-----------------------------------
       Total | 11,460,915      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,728,099       47.52       47.52
      Former |  3,303,232       27.40       74.92
     Current |  2,429,584       20.15       95.07
Unknown (.u) |    593,875        4.93      100.00
-------------+-----------------------------------
       Total | 12,054,790      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,090,816       29.38       29.38
      Elevated |  1,701,064       16.17       45.55
 High, stage I |  3,688,954       35.06       80.61
High, stage II |  2,039,769       19.39      100.00
---------------+-----------------------------------
         Total | 10,520,603      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,090,816       25.64       25.64
      Elevated |  1,701,064       14.11       39.75
 High, stage I |  3,688,954       30.60       70.35
High, stage II |  2,039,769       16.92       87.27
       Unknown |  1,534,187       12.73      100.00
---------------+-----------------------------------
         Total | 12,054,790      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,236,251       76.62       76.62
          1 |  2,818,539       23.38      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,236,251       76.62       76.62
          1 |  2,818,539       23.38      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,296,481       19.05       19.05
               2 |  2,408,020       19.98       39.03
               3 |  2,476,236       20.54       59.57
               4 |  2,560,130       21.24       80.80
 5 most deprived |  2,313,923       19.20      100.00
-----------------+-----------------------------------
           Total | 12,054,790      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,296,481       19.05       19.05
               2 |  2,408,020       19.98       39.03
               3 |  2,476,236       20.54       59.57
               4 |  2,560,130       21.24       80.80
 5 most deprived |  2,313,923       19.20      100.00
-----------------+-----------------------------------
           Total | 12,054,790      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,568,414       82.65       82.65
                 Mixed |    158,211        1.73       84.38
Asian or Asian British |    833,178        9.10       93.48
                 Black |    306,342        3.35       96.83
                 Other |    290,505        3.17      100.00
-----------------------+-----------------------------------
                 Total |  9,156,650      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,568,414       62.78       62.78
                 Mixed |    158,211        1.31       64.10
Asian or Asian British |    833,178        6.91       71.01
                 Black |    306,342        2.54       73.55
                 Other |    290,505        2.41       75.96
               Unknown |  2,898,140       24.04      100.00
-----------------------+-----------------------------------
                 Total | 12,054,790      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,299        0.03        0.03
          2 |  1,147,519        9.52        9.55
          3 |    520,866        4.32       13.87
          4 |    120,044        1.00       14.86
          5 |     84,535        0.70       15.56
          6 |    566,583        4.70       20.26
          7 |     33,906        0.28       20.55
          8 |    439,715        3.65       24.19
          9 |    340,400        2.82       27.02
         10 |    479,727        3.98       31.00
         11 |    537,837        4.46       35.46
         12 |    183,735        1.52       36.98
         13 |    271,068        2.25       39.23
         14 |    334,548        2.78       42.01
         15 |    428,231        3.55       45.56
         16 |    423,433        3.51       49.07
         17 |    367,079        3.05       52.12
         18 |    536,674        4.45       56.57
         19 |    419,814        3.48       60.05
         20 |    595,523        4.94       64.99
         21 |    971,579        8.06       73.05
         22 |     62,504        0.52       73.57
         23 |    459,008        3.81       77.38
         24 |     21,869        0.18       77.56
         25 |    117,285        0.97       78.53
         26 |    368,126        3.05       81.59
         27 |    459,895        3.82       85.40
         28 |    370,468        3.07       88.47
         29 |    312,517        2.59       91.07
         30 |    239,477        1.99       93.05
         31 |     14,213        0.12       93.17
         32 |    823,313        6.83      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  2,828,345       23.46       23.46
          2 |  4,796,779       39.79       63.25
          3 |  4,429,666       36.75      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

     Number |
  people in |
  household |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  2,183,673       18.11       18.11
          2 |  2,891,184       23.98       42.10
          3 |  2,634,516       21.85       63.95
          4 |  2,330,873       19.34       83.29
          5 |  1,051,622        8.72       92.01
          6 |    492,763        4.09       96.10
          7 |    249,403        2.07       98.17
          8 |    138,696        1.15       99.32
          9 |     82,060        0.68      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Number |
 people in |          Index of Multiple Deprivation (IMD)
 household | 1 least d          2          3          4  5 most de |     Total
-----------+-------------------------------------------------------+----------
         1 |   336,012    422,257    474,599    505,276    445,529 | 2,183,673 
           |     14.63      17.54      19.17      19.74      19.25 |     18.11 
-----------+-------------------------------------------------------+----------
         2 |   582,275    620,500    613,412    587,881    487,116 | 2,891,184 
           |     25.36      25.77      24.77      22.96      21.05 |     23.98 
-----------+-------------------------------------------------------+----------
         3 |   561,451    554,951    537,888    525,400    454,826 | 2,634,516 
           |     24.45      23.05      21.72      20.52      19.66 |     21.85 
-----------+-------------------------------------------------------+----------
         4 |   536,914    488,655    460,312    450,888    394,104 | 2,330,873 
           |     23.38      20.29      18.59      17.61      17.03 |     19.34 
-----------+-------------------------------------------------------+----------
         5 |   178,161    187,133    206,045    237,129    243,154 | 1,051,622 
           |      7.76       7.77       8.32       9.26      10.51 |      8.72 
-----------+-------------------------------------------------------+----------
         6 |    59,995     74,841     94,127    123,653    140,147 |   492,763 
           |      2.61       3.11       3.80       4.83       6.06 |      4.09 
-----------+-------------------------------------------------------+----------
         7 |    23,805     33,201     47,413     67,294     77,690 |   249,403 
           |      1.04       1.38       1.91       2.63       3.36 |      2.07 
-----------+-------------------------------------------------------+----------
         8 |    11,768     16,995     26,553     38,472     44,908 |   138,696 
           |      0.51       0.71       1.07       1.50       1.94 |      1.15 
-----------+-------------------------------------------------------+----------
         9 |     6,100      9,487     15,887     24,137     26,449 |    82,060 
           |      0.27       0.39       0.64       0.94       1.14 |      0.68 
-----------+-------------------------------------------------------+----------
     Total | 2,296,481  2,408,020  2,476,236  2,560,130  2,313,923 |12,054,790 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(32) =  2.3e+05   Pr = 0.000
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,825,600       98.10       98.10
          1 |    229,190        1.90      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,011,771       83.05       83.05
          1 |  2,043,019       16.95      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,719,491       97.22       97.22
          1 |    335,299        2.78      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 11,307,629       95.26       95.26
  T1DM, controlled |     16,423        0.14       95.39
T1DM, uncontrolled |     49,194        0.41       95.81
  T2DM, controlled |    275,002        2.32       98.13
T2DM, uncontrolled |    217,094        1.83       99.95
Diabetes, no HbA1c |      5,483        0.05      100.00
-------------------+-----------------------------------
             Total | 11,870,825      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,797,926       97.87       97.87
    Last year |     28,605        0.24       98.11
2-5 years ago |     82,318        0.68       98.79
     5+ years |    145,941        1.21      100.00
--------------+-----------------------------------
        Total | 12,054,790      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 12,016,997       99.69       99.69
    Last year |      3,056        0.03       99.71
2-5 years ago |      9,513        0.08       99.79
     5+ years |     25,224        0.21      100.00
--------------+-----------------------------------
        Total | 12,054,790      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,015,567       99.67       99.67
          1 |     39,223        0.33      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,051,966       99.98       99.98
          1 |      2,824        0.02      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,040,929       99.89       99.89
          1 |     13,861        0.11      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,991,598       99.48       99.48
          1 |     63,192        0.52      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,972,286       99.32       99.32
          1 |     82,504        0.68      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,962,956       99.24       99.24
          1 |     91,834        0.76      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,989        0.06        0.06
         15 |      6,929        0.08        0.14
         30 |     16,738        0.20        0.35
         45 |    105,021        1.27        1.62
         60 |  8,121,544       98.38      100.00
------------+-----------------------------------
      Total |  8,255,221      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 11,921,113       98.89       98.89
Stage 3a/3b egfr 30-60       |    121,759        1.01       99.90
           Stage 4/5 egfr<30 |     11,918        0.10      100.00
-----------------------------+-----------------------------------
                       Total | 12,054,790      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,040,467       99.88       99.88
          1 |     14,323        0.12      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,715,484       88.89       88.89
          1 |  1,339,306       11.11      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,528,448       95.63       95.63
          1 |    526,342        4.37      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,568,695       79.38       79.38
          1 |  2,486,095       20.62      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

  Presence of |
  children or |
 young people |
       in the |
    household |      Freq.     Percent        Cum.
--------------+-----------------------------------
      No kids |  7,706,461       63.93       63.93
Kids under 12 |  3,170,883       26.30       90.23
Kids under 18 |  1,177,446        9.77      100.00
--------------+-----------------------------------
        Total | 12,054,790      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
           none |  7,706,461       63.93       63.93
 only >12 years |  1,177,446        9.77       73.70
    1 child <12 |  1,746,284       14.49       88.18
 2 children <12 |  1,096,701        9.10       97.28
3+ children <12 |    327,898        2.72      100.00
----------------+-----------------------------------
          Total | 12,054,790      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,052,072       99.98       99.98
          1 |      2,718        0.02      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,044,500       99.91       99.91
          1 |     10,290        0.09      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,020,764       99.72       99.72
          1 |     34,026        0.28      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,052,072       99.98       99.98
          1 |      2,718        0.02      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
     covid |     people in the household
 icu/death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,704,396  3,170,478  1,177,198 |12,052,072 
           |     63.93      26.31       9.77 |    100.00 
           |     99.97      99.99      99.98 |     99.98 
-----------+---------------------------------+----------
         1 |     2,065        405        248 |     2,718 
           |     75.97      14.90       9.12 |    100.00 
           |      0.03       0.01       0.02 |      0.02 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |     63.93      26.30       9.77 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
     covid |            Number kids under 12 years in hh
 icu/death |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 7,704,396  1,177,198  1,746,034  1,096,586    327,858 |12,052,072 
           |     63.93       9.77      14.49       9.10       2.72 |    100.00 
           |     99.97      99.98      99.99      99.99      99.99 |     99.98 
-----------+-------------------------------------------------------+----------
         1 |     2,065        248        250        115         40 |     2,718 
           |     75.97       9.12       9.20       4.23       1.47 |    100.00 
           |      0.03       0.02       0.01       0.01       0.01 |      0.02 
-----------+-------------------------------------------------------+----------
     Total | 7,706,461  1,177,446  1,746,284  1,096,701    327,898 |12,054,790 
           |     63.93       9.77      14.49       9.10       2.72 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,044,500       99.91       99.91
          1 |     10,290        0.09      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
 non-covid |     people in the household
     death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,697,624  3,170,008  1,176,868 |12,044,500 
           |     63.91      26.32       9.77 |    100.00 
           |     99.89      99.97      99.95 |     99.91 
-----------+---------------------------------+----------
         1 |     8,837        875        578 |    10,290 
           |     85.88       8.50       5.62 |    100.00 
           |      0.11       0.03       0.05 |      0.09 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |     63.93      26.30       9.77 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |            Number kids under 12 years in hh
     death |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 7,697,624  1,176,868  1,745,735  1,096,445    327,828 |12,044,500 
           |     63.91       9.77      14.49       9.10       2.72 |    100.00 
           |     99.89      99.95      99.97      99.98      99.98 |     99.91 
-----------+-------------------------------------------------------+----------
         1 |     8,837        578        549        256         70 |    10,290 
           |     85.88       5.62       5.34       2.49       0.68 |    100.00 
           |      0.11       0.05       0.03       0.02       0.02 |      0.09 
-----------+-------------------------------------------------------+----------
     Total | 7,706,461  1,177,446  1,746,284  1,096,701    327,898 |12,054,790 
           |     63.93       9.77      14.49       9.10       2.72 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,020,764       99.72       99.72
          1 |     34,026        0.28      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
covid prob |     people in the household
      case |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,685,984  3,161,195  1,173,585 |12,020,764 
           |     63.94      26.30       9.76 |    100.00 
           |     99.73      99.69      99.67 |     99.72 
-----------+---------------------------------+----------
         1 |    20,477      9,688      3,861 |    34,026 
           |     60.18      28.47      11.35 |    100.00 
           |      0.27       0.31       0.33 |      0.28 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |     63.93      26.30       9.77 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |            Number kids under 12 years in hh
      case |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 7,685,984  1,173,585  1,740,950  1,093,406    326,839 |12,020,764 
           |     63.94       9.76      14.48       9.10       2.72 |    100.00 
           |     99.73      99.67      99.69      99.70      99.68 |     99.72 
-----------+-------------------------------------------------------+----------
         1 |    20,477      3,861      5,334      3,295      1,059 |    34,026 
           |     60.18      11.35      15.68       9.68       3.11 |    100.00 
           |      0.27       0.33       0.31       0.30       0.32 |      0.28 
-----------+-------------------------------------------------------+----------
     Total | 7,706,461  1,177,446  1,746,284  1,096,701    327,898 |12,054,790 
           |     63.93       9.77      14.49       9.10       2.72 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
   Grouped |     people in the household
       age |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
    18-<30 | 1,956,680    609,671    278,819 | 2,845,170 
           |     25.39      19.23      23.68 |     23.60 
-----------+---------------------------------+----------
    30-<40 | 1,314,744  1,337,393    115,967 | 2,768,104 
           |     17.06      42.18       9.85 |     22.96 
-----------+---------------------------------+----------
    40-<50 | 1,132,266    929,659    433,586 | 2,495,511 
           |     14.69      29.32      36.82 |     20.70 
-----------+---------------------------------+----------
    50-<60 | 2,075,359    232,431    317,136 | 2,624,926 
           |     26.93       7.33      26.93 |     21.77 
-----------+---------------------------------+----------
    60-<70 | 1,227,412     61,729     31,938 | 1,321,079 
           |     15.93       1.95       2.71 |     10.96 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
      Male |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,594,576  1,786,354    628,211 | 6,009,141 
           |     46.64      56.34      53.35 |     49.85 
-----------+---------------------------------+----------
         1 | 4,111,885  1,384,529    549,235 | 6,045,649 
           |     53.36      43.66      46.65 |     50.15 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
                     |     people in the household
         Grouped BMI |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |   150,116     55,501     18,069 |   223,686 
                     |      1.95       1.75       1.53 |      1.86 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) | 2,163,552    951,229    291,498 | 3,406,279 
                     |     28.07      30.00      24.76 |     28.26 
---------------------+---------------------------------+----------
Overweight (25-29.9) | 1,882,179    833,585    287,618 | 3,003,382 
                     |     24.42      26.29      24.43 |     24.91 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   983,148    407,373    152,729 | 1,543,250 
                     |     12.76      12.85      12.97 |     12.80 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   407,750    165,409     62,629 |   635,788 
                     |      5.29       5.22       5.32 |      5.27 
---------------------+---------------------------------+----------
     Obese III (40+) |   224,827     87,005     33,844 |   345,676 
                     |      2.92       2.74       2.87 |      2.87 
---------------------+---------------------------------+----------
        Unknown (.u) | 1,894,889    670,781    331,059 | 2,896,729 
                     |     24.59      21.15      28.12 |     24.03 
---------------------+---------------------------------+----------
               Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
                     |    100.00     100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |  Presence of children or young
     Smoking |     people in the household
      status |   No kids  Kids unde  Kids unde |     Total
-------------+---------------------------------+----------
       Never | 3,670,302  1,493,743    564,054 | 5,728,099 
             |     47.63      47.11      47.90 |     47.52 
-------------+---------------------------------+----------
      Former | 2,069,952    913,837    319,443 | 3,303,232 
             |     26.86      28.82      27.13 |     27.40 
-------------+---------------------------------+----------
     Current | 1,592,103    636,641    200,840 | 2,429,584 
             |     20.66      20.08      17.06 |     20.15 
-------------+---------------------------------+----------
Unknown (.u) |   374,104    126,662     93,109 |   593,875 
             |      4.85       3.99       7.91 |      4.93 
-------------+---------------------------------+----------
       Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
             |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
 Evidence of obesity |     people in the household
      (4 categories) |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
No record of obesity | 6,090,736  2,511,096    928,244 | 9,530,076 
                     |     79.03      79.19      78.84 |     79.06 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   983,148    407,373    152,729 | 1,543,250 
                     |     12.76      12.85      12.97 |     12.80 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   407,750    165,409     62,629 |   635,788 
                     |      5.29       5.22       5.32 |      5.27 
---------------------+---------------------------------+----------
     Obese III (40+) |   224,827     87,005     33,844 |   345,676 
                     |      2.92       2.74       2.87 |      2.87 
---------------------+---------------------------------+----------
               Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
                     |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
  Probable |     people in the household
 shielding |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 6,072,959  2,555,471    940,265 | 9,568,695 
           |     78.80      80.59      79.86 |     79.38 
-----------+---------------------------------+----------
         1 | 1,633,502    615,412    237,181 | 2,486,095 
           |     21.20      19.41      20.14 |     20.62 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Total |
    number |  Presence of children or young
 adults in |     people in the household
        hh |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 2,233,136    466,032    129,177 | 2,828,345 
           |     28.98      14.70      10.97 |     23.46 
-----------+---------------------------------+----------
         2 | 2,612,158  1,723,466    461,155 | 4,796,779 
           |     33.90      54.35      39.17 |     39.79 
-----------+---------------------------------+----------
         3 | 2,861,167    981,385    587,114 | 4,429,666 
           |     37.13      30.95      49.86 |     36.75 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Number |  Presence of children or young
 people in |     people in the household
 household |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 2,183,673          0          0 | 2,183,673 
           |     28.34       0.00       0.00 |     18.11 
-----------+---------------------------------+----------
         2 | 2,593,740    206,025     91,419 | 2,891,184 
           |     33.66       6.50       7.76 |     23.98 
-----------+---------------------------------+----------
         3 | 1,575,975    739,855    318,686 | 2,634,516 
           |     20.45      23.33      27.07 |     21.85 
-----------+---------------------------------+----------
         4 |   863,426  1,028,608    438,839 | 2,330,873 
           |     11.20      32.44      37.27 |     19.34 
-----------+---------------------------------+----------
         5 |   290,206    566,562    194,854 | 1,051,622 
           |      3.77      17.87      16.55 |      8.72 
-----------+---------------------------------+----------
         6 |   108,736    305,750     78,277 |   492,763 
           |      1.41       9.64       6.65 |      4.09 
-----------+---------------------------------+----------
         7 |    48,725    167,947     32,731 |   249,403 
           |      0.63       5.30       2.78 |      2.07 
-----------+---------------------------------+----------
         8 |    26,247     97,289     15,160 |   138,696 
           |      0.34       3.07       1.29 |      1.15 
-----------+---------------------------------+----------
         9 |    15,733     58,847      7,480 |    82,060 
           |      0.20       1.86       0.64 |      0.68 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |  Presence of children or young
     Deprivation |     people in the household
           (IMD) |   No kids  Kids unde  Kids unde |     Total
-----------------+---------------------------------+----------
1 least deprived | 1,455,648    579,706    261,127 | 2,296,481 
                 |     18.89      18.28      22.18 |     19.05 
-----------------+---------------------------------+----------
               2 | 1,585,775    585,581    236,664 | 2,408,020 
                 |     20.58      18.47      20.10 |     19.98 
-----------------+---------------------------------+----------
               3 | 1,639,109    609,622    227,505 | 2,476,236 
                 |     21.27      19.23      19.32 |     20.54 
-----------------+---------------------------------+----------
               4 | 1,643,753    684,885    231,492 | 2,560,130 
                 |     21.33      21.60      19.66 |     21.24 
-----------------+---------------------------------+----------
 5 most deprived | 1,382,176    711,089    220,658 | 2,313,923 
                 |     17.94      22.43      18.74 |     19.20 
-----------------+---------------------------------+----------
           Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
                 |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
                      |     people in the household
            Ethnicity |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                White | 4,900,584  1,986,115    681,715 | 7,568,414 
                      |     63.59      62.64      57.90 |     62.78 
----------------------+---------------------------------+----------
                Mixed |    94,230     49,748     14,233 |   158,211 
                      |      1.22       1.57       1.21 |      1.31 
----------------------+---------------------------------+----------
Asian or Asian Britis |   393,335    340,673     99,170 |   833,178 
                      |      5.10      10.74       8.42 |      6.91 
----------------------+---------------------------------+----------
                Black |   166,703    106,557     33,082 |   306,342 
                      |      2.16       3.36       2.81 |      2.54 
----------------------+---------------------------------+----------
                Other |   182,763     85,561     22,181 |   290,505 
                      |      2.37       2.70       1.88 |      2.41 
----------------------+---------------------------------+----------
              Unknown | 1,968,846    602,229    327,065 | 2,898,140 
                      |     25.55      18.99      27.78 |     24.04 
----------------------+---------------------------------+----------
                Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
                      |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |
      tion |  Presence of children or young
Partnershi |     people in the household
         p |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 |     1,744      1,220        335 |     3,299 
           |      0.02       0.04       0.03 |      0.03 
-----------+---------------------------------+----------
         2 |   692,317    338,839    116,363 | 1,147,519 
           |      8.98      10.69       9.88 |      9.52 
-----------+---------------------------------+----------
         3 |   339,030    132,668     49,168 |   520,866 
           |      4.40       4.18       4.18 |      4.32 
-----------+---------------------------------+----------
         4 |    74,762     32,469     12,813 |   120,044 
           |      0.97       1.02       1.09 |      1.00 
-----------+---------------------------------+----------
         5 |    53,420     22,169      8,946 |    84,535 
           |      0.69       0.70       0.76 |      0.70 
-----------+---------------------------------+----------
         6 |   366,311    146,454     53,818 |   566,583 
           |      4.75       4.62       4.57 |      4.70 
-----------+---------------------------------+----------
         7 |    22,330      8,604      2,972 |    33,906 
           |      0.29       0.27       0.25 |      0.28 
-----------+---------------------------------+----------
         8 |   281,616    115,325     42,774 |   439,715 
           |      3.65       3.64       3.63 |      3.65 
-----------+---------------------------------+----------
         9 |   223,995     83,197     33,208 |   340,400 
           |      2.91       2.62       2.82 |      2.82 
-----------+---------------------------------+----------
        10 |   301,540    132,371     45,816 |   479,727 
           |      3.91       4.17       3.89 |      3.98 
-----------+---------------------------------+----------
        11 |   335,734    147,199     54,904 |   537,837 
           |      4.36       4.64       4.66 |      4.46 
-----------+---------------------------------+----------
        12 |   109,277     55,840     18,618 |   183,735 
           |      1.42       1.76       1.58 |      1.52 
-----------+---------------------------------+----------
        13 |   164,380     77,770     28,918 |   271,068 
           |      2.13       2.45       2.46 |      2.25 
-----------+---------------------------------+----------
        14 |   201,952     97,727     34,869 |   334,548 
           |      2.62       3.08       2.96 |      2.78 
-----------+---------------------------------+----------
        15 |   261,219    124,496     42,516 |   428,231 
           |      3.39       3.93       3.61 |      3.55 
-----------+---------------------------------+----------
        16 |   275,769    107,143     40,521 |   423,433 
           |      3.58       3.38       3.44 |      3.51 
-----------+---------------------------------+----------
        17 |   236,459     94,130     36,490 |   367,079 
           |      3.07       2.97       3.10 |      3.05 
-----------+---------------------------------+----------
        18 |   307,869    170,428     58,377 |   536,674 
           |      3.99       5.37       4.96 |      4.45 
-----------+---------------------------------+----------
        19 |   259,097    117,801     42,916 |   419,814 
           |      3.36       3.72       3.64 |      3.48 
-----------+---------------------------------+----------
        20 |   357,888    171,365     66,270 |   595,523 
           |      4.64       5.40       5.63 |      4.94 
-----------+---------------------------------+----------
        21 |   685,905    211,289     74,385 |   971,579 
           |      8.90       6.66       6.32 |      8.06 
-----------+---------------------------------+----------
        22 |    36,264     19,680      6,560 |    62,504 
           |      0.47       0.62       0.56 |      0.52 
-----------+---------------------------------+----------
        23 |   300,201    113,469     45,338 |   459,008 
           |      3.90       3.58       3.85 |      3.81 
-----------+---------------------------------+----------
        24 |    14,680      4,924      2,265 |    21,869 
           |      0.19       0.16       0.19 |      0.18 
-----------+---------------------------------+----------
        25 |    81,886     24,923     10,476 |   117,285 
           |      1.06       0.79       0.89 |      0.97 
-----------+---------------------------------+----------
        26 |   247,539     85,553     35,034 |   368,126 
           |      3.21       2.70       2.98 |      3.05 
-----------+---------------------------------+----------
        27 |   297,986    115,054     46,855 |   459,895 
           |      3.87       3.63       3.98 |      3.82 
-----------+---------------------------------+----------
        28 |   252,154     83,954     34,360 |   370,468 
           |      3.27       2.65       2.92 |      3.07 
-----------+---------------------------------+----------
        29 |   215,191     71,195     26,131 |   312,517 
           |      2.79       2.25       2.22 |      2.59 
-----------+---------------------------------+----------
        30 |   158,814     57,224     23,439 |   239,477 
           |      2.06       1.80       1.99 |      1.99 
-----------+---------------------------------+----------
        31 |     9,387      3,335      1,491 |    14,213 
           |      0.12       0.11       0.13 |      0.12 
-----------+---------------------------------+----------
        32 |   539,745    203,068     80,500 |   823,313 
           |      7.00       6.40       6.84 |      6.83 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
Respirator |     people in the household
y Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,519,098  3,144,828  1,161,674 |11,825,600 
           |     97.57      99.18      98.66 |     98.10 
-----------+---------------------------------+----------
         1 |   187,363     26,055     15,772 |   229,190 
           |      2.43       0.82       1.34 |      1.90 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
    Asthma |     people in the household
  category |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 6,420,702  2,615,296    975,773 |10,011,771 
           |     83.32      82.48      82.87 |     83.05 
-----------+---------------------------------+----------
         1 | 1,285,759    555,587    201,673 | 2,043,019 
           |     16.68      17.52      17.13 |     16.95 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
   Cardiac |     people in the household
  Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,441,030  3,127,121  1,151,340 |11,719,491 
           |     96.56      98.62      97.78 |     97.22 
-----------+---------------------------------+----------
         1 |   265,431     43,762     26,106 |   335,299 
           |      3.44       1.38       2.22 |      2.78 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |  Presence of children or young
                   |     people in the household
          Diabetes |   No kids  Kids unde  Kids unde |     Total
-------------------+---------------------------------+----------
       No diabetes | 7,166,000  3,033,017  1,108,612 |11,307,629 
                   |     94.47      97.01      95.64 |     95.26 
-------------------+---------------------------------+----------
  T1DM, controlled |    11,316      3,764      1,343 |    16,423 
                   |      0.15       0.12       0.12 |      0.14 
-------------------+---------------------------------+----------
T1DM, uncontrolled |    34,367     10,353      4,474 |    49,194 
                   |      0.45       0.33       0.39 |      0.41 
-------------------+---------------------------------+----------
  T2DM, controlled |   208,271     42,902     23,829 |   275,002 
                   |      2.75       1.37       2.06 |      2.32 
-------------------+---------------------------------+----------
T2DM, uncontrolled |   161,581     35,125     20,388 |   217,094 
                   |      2.13       1.12       1.76 |      1.83 
-------------------+---------------------------------+----------
Diabetes, no HbA1c |     3,679      1,328        476 |     5,483 
                   |      0.05       0.04       0.04 |      0.05 
-------------------+---------------------------------+----------
             Total | 7,585,214  3,126,489  1,159,122 |11,870,825 
                   |    100.00     100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Non-haematolo |     people in the household
 gical cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 7,505,642  3,137,345  1,154,939 |11,797,926 
              |     97.39      98.94      98.09 |     97.87 
--------------+---------------------------------+----------
    Last year |    21,806      4,187      2,612 |    28,605 
              |      0.28       0.13       0.22 |      0.24 
--------------+---------------------------------+----------
2-5 years ago |    63,119     11,651      7,548 |    82,318 
              |      0.82       0.37       0.64 |      0.68 
--------------+---------------------------------+----------
     5+ years |   115,894     17,700     12,347 |   145,941 
              |      1.50       0.56       1.05 |      1.21 
--------------+---------------------------------+----------
        Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
              |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Haematologica |     people in the household
     l cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 7,678,326  3,164,437  1,174,234 |12,016,997 
              |     99.63      99.80      99.73 |     99.69 
--------------+---------------------------------+----------
    Last year |     2,293        511        252 |     3,056 
              |      0.03       0.02       0.02 |      0.03 
--------------+---------------------------------+----------
2-5 years ago |     7,259      1,472        782 |     9,513 
              |      0.09       0.05       0.07 |      0.08 
--------------+---------------------------------+----------
     5+ years |    18,583      4,463      2,178 |    25,224 
              |      0.24       0.14       0.18 |      0.21 
--------------+---------------------------------+----------
        Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
              |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |  Presence of children or young
        on |     people in the household
algorithm) |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,678,765  3,162,533  1,174,269 |12,015,567 
           |     99.64      99.74      99.73 |     99.67 
-----------+---------------------------------+----------
         1 |    27,696      8,350      3,177 |    39,223 
           |      0.36       0.26       0.27 |      0.33 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |  Presence of children or young
     organ |     people in the household
transplant |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,704,290  3,170,488  1,177,188 |12,051,966 
           |     99.97      99.99      99.98 |     99.98 
-----------+---------------------------------+----------
         1 |     2,171        395        258 |     2,824 
           |      0.03       0.01       0.02 |      0.02 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
  Asplenia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,696,364  3,168,363  1,176,202 |12,040,929 
           |     99.87      99.92      99.89 |     99.89 
-----------+---------------------------------+----------
         1 |    10,097      2,520      1,244 |    13,861 
           |      0.13       0.08       0.11 |      0.11 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
     liver |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,657,699  3,160,716  1,173,183 |11,991,598 
           |     99.37      99.68      99.64 |     99.48 
-----------+---------------------------------+----------
         1 |    48,762     10,167      4,263 |    63,192 
           |      0.63       0.32       0.36 |      0.52 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Neurologic |     people in the household
al disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,642,982  3,158,606  1,170,698 |11,972,286 
           |     99.18      99.61      99.43 |     99.32 
-----------+---------------------------------+----------
         1 |    63,479     12,277      6,748 |    82,504 
           |      0.82       0.39       0.57 |      0.68 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
 Stroke or |     people in the household
  dementia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,632,031  3,160,002  1,170,923 |11,962,956 
           |     99.03      99.66      99.45 |     99.24 
-----------+---------------------------------+----------
         1 |    74,430     10,881      6,523 |    91,834 
           |      0.97       0.34       0.55 |      0.76 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Calculated |     people in the household
      eGFR |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 |     3,909        690        390 |     4,989 
           |      0.07       0.03       0.05 |      0.06 
-----------+---------------------------------+----------
        15 |     5,499        891        539 |     6,929 
           |      0.10       0.04       0.06 |      0.08 
-----------+---------------------------------+----------
        30 |    13,898      1,774      1,066 |    16,738 
           |      0.26       0.08       0.13 |      0.20 
-----------+---------------------------------+----------
        45 |    88,387      9,622      7,012 |   105,021 
           |      1.67       0.45       0.84 |      1.27 
-----------+---------------------------------+----------
        60 | 5,176,060  2,117,504    827,980 | 8,121,544 
           |     97.89      99.39      98.92 |     98.38 
-----------+---------------------------------+----------
     Total | 5,287,753  2,130,481    836,987 | 8,255,221 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
       Reduced kidney |     people in the household
             function |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                 None | 7,594,768  3,157,906  1,168,439 |11,921,113 
                      |     98.55      99.59      99.24 |     98.89 
----------------------+---------------------------------+----------
Stage 3a/3b egfr 30-6 |   102,285     11,396      8,078 |   121,759 
                      |      1.33       0.36       0.69 |      1.01 
----------------------+---------------------------------+----------
    Stage 4/5 egfr<30 |     9,408      1,581        929 |    11,918 
                      |      0.12       0.05       0.08 |      0.10 
----------------------+---------------------------------+----------
                Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
                      |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |  Presence of children or young
     renal |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,695,541  3,168,615  1,176,311 |12,040,467 
           |     99.86      99.93      99.90 |     99.88 
-----------+---------------------------------+----------
         1 |    10,920      2,268      1,135 |    14,323 
           |      0.14       0.07       0.10 |      0.12 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |  Presence of children or young
hypertensi |     people in the household
        on |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 6,667,793  2,988,251  1,059,440 |10,715,484 
           |     86.52      94.24      89.98 |     88.89 
-----------+---------------------------------+----------
         1 | 1,038,668    182,632    118,006 | 1,339,306 
           |     13.48       5.76      10.02 |     11.11 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Autoimmune |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,360,644  3,042,631  1,125,173 |11,528,448 
           |     95.51      95.96      95.56 |     95.63 
-----------+---------------------------------+----------
         1 |   345,817    128,252     52,273 |   526,342 
           |      4.49       4.04       4.44 |      4.37 
-----------+---------------------------------+----------
     Total | 7,706,461  3,170,883  1,177,446 |12,054,790 
           |    100.00     100.00     100.00 |    100.00 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  3,489,829    75.53668    7.086557         66        110
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |    797,869       22.86       22.86
     70-<80 |  1,729,904       49.57       72.43
        80+ |    962,056       27.57      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    205,455        5.89        5.89
          1 |  3,284,374       94.11      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,871,868       53.64       53.64
          1 |  1,617,961       46.36      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     59,559        1.87        1.87
  Normal (18.5-24.9) |    991,006       31.18       33.06
Overweight (25-29.9) |  1,239,012       38.99       72.05
   Obese I (30-34.9) |    609,753       19.19       91.23
  Obese II (35-39.9) |    200,575        6.31       97.55
     Obese III (40+) |     77,983        2.45      100.00
---------------------+-----------------------------------
               Total |  3,177,888      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     59,559        1.71        1.71
  Normal (18.5-24.9) |    991,006       28.40       30.10
Overweight (25-29.9) |  1,239,012       35.50       65.61
   Obese I (30-34.9) |    609,753       17.47       83.08
  Obese II (35-39.9) |    200,575        5.75       88.83
     Obese III (40+) |     77,983        2.23       91.06
        Unknown (.u) |    311,941        8.94      100.00
---------------------+-----------------------------------
               Total |  3,489,829      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  2,601,518       74.55       74.55
   Obese I (30-34.9) |    609,753       17.47       92.02
  Obese II (35-39.9) |    200,575        5.75       97.77
     Obese III (40+) |     77,983        2.23      100.00
---------------------+-----------------------------------
               Total |  3,489,829      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,391,736       40.12       40.12
      Former |  1,788,526       51.56       91.69
     Current |    288,328        8.31      100.00
-------------+-----------------------------------
       Total |  3,468,590      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,391,736       39.88       39.88
      Former |  1,788,526       51.25       91.13
     Current |    288,328        8.26       99.39
Unknown (.u) |     21,239        0.61      100.00
-------------+-----------------------------------
       Total |  3,489,829      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    393,715       11.38       11.38
      Elevated |    532,889       15.40       26.77
 High, stage I |  1,271,356       36.73       63.51
High, stage II |  1,262,994       36.49      100.00
---------------+-----------------------------------
         Total |  3,460,954      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    393,715       11.28       11.28
      Elevated |    532,889       15.27       26.55
 High, stage I |  1,271,356       36.43       62.98
High, stage II |  1,262,994       36.19       99.17
       Unknown |     28,875        0.83      100.00
---------------+-----------------------------------
         Total |  3,489,829      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,055,573       30.25       30.25
          1 |  2,434,256       69.75      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,055,573       30.25       30.25
          1 |  2,434,256       69.75      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    873,864       25.04       25.04
               2 |    824,723       23.63       48.67
               3 |    749,221       21.47       70.14
               4 |    609,457       17.46       87.61
 5 most deprived |    432,564       12.39      100.00
-----------------+-----------------------------------
           Total |  3,489,829      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    873,864       25.04       25.04
               2 |    824,723       23.63       48.67
               3 |    749,221       21.47       70.14
               4 |    609,457       17.46       87.61
 5 most deprived |    432,564       12.39      100.00
-----------------+-----------------------------------
           Total |  3,489,829      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,418,927       94.22       94.22
                 Mixed |      9,775        0.38       94.60
Asian or Asian British |     90,164        3.51       98.11
                 Black |     27,280        1.06       99.17
                 Other |     21,306        0.83      100.00
-----------------------+-----------------------------------
                 Total |  2,567,452      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,418,927       69.31       69.31
                 Mixed |      9,775        0.28       69.59
Asian or Asian British |     90,164        2.58       72.18
                 Black |     27,280        0.78       72.96
                 Other |     21,306        0.61       73.57
               Unknown |    922,377       26.43      100.00
-----------------------+-----------------------------------
                 Total |  3,489,829      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        326        0.01        0.01
          2 |    288,061        8.25        8.26
          3 |    156,042        4.47       12.73
          4 |     34,260        0.98       13.72
          5 |     23,736        0.68       14.40
          6 |    162,281        4.65       19.05
          7 |      9,359        0.27       19.32
          8 |    136,985        3.93       23.24
          9 |    129,034        3.70       26.94
         10 |    141,974        4.07       31.01
         11 |    142,833        4.09       35.10
         12 |     38,803        1.11       36.21
         13 |     68,560        1.96       38.18
         14 |     85,051        2.44       40.61
         15 |    111,820        3.20       43.82
         16 |    165,848        4.75       48.57
         17 |    123,412        3.54       52.11
         18 |    125,645        3.60       55.71
         19 |    111,888        3.21       58.91
         20 |    180,469        5.17       64.08
         21 |    134,611        3.86       67.94
         22 |      9,422        0.27       68.21
         23 |    152,809        4.38       72.59
         24 |      8,140        0.23       72.82
         25 |     45,683        1.31       74.13
         26 |    152,040        4.36       78.49
         27 |    147,260        4.22       82.71
         28 |    150,597        4.32       87.02
         29 |     97,776        2.80       89.82
         30 |     81,201        2.33       92.15
         31 |      4,912        0.14       92.29
         32 |    268,991        7.71      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  1,204,801       34.52       34.52
          2 |  1,783,758       51.11       85.64
          3 |    501,270       14.36      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

     Number |
  people in |
  household |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  1,195,478       34.26       34.26
          2 |  1,764,490       50.56       84.82
          3 |    322,395        9.24       94.06
          4 |    102,348        2.93       96.99
          5 |     49,083        1.41       98.39
          6 |     28,811        0.83       99.22
          7 |     14,796        0.42       99.64
          8 |      8,054        0.23       99.87
          9 |      4,374        0.13      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Number |
 people in |          Index of Multiple Deprivation (IMD)
 household | 1 least d          2          3          4  5 most de |     Total
-----------+-------------------------------------------------------+----------
         1 |   259,349    266,421    257,351    229,606    182,751 | 1,195,478 
           |     29.68      32.30      34.35      37.67      42.25 |     34.26 
-----------+-------------------------------------------------------+----------
         2 |   497,703    440,700    378,453    276,874    170,760 | 1,764,490 
           |     56.95      53.44      50.51      45.43      39.48 |     50.56 
-----------+-------------------------------------------------------+----------
         3 |    77,169     75,240     68,669     58,484     42,833 |   322,395 
           |      8.83       9.12       9.17       9.60       9.90 |      9.24 
-----------+-------------------------------------------------------+----------
         4 |    21,474     22,028     22,206     20,558     16,082 |   102,348 
           |      2.46       2.67       2.96       3.37       3.72 |      2.93 
-----------+-------------------------------------------------------+----------
         5 |     9,528     10,198     10,692     10,421      8,244 |    49,083 
           |      1.09       1.24       1.43       1.71       1.91 |      1.41 
-----------+-------------------------------------------------------+----------
         6 |     5,121      5,617      6,247      6,568      5,258 |    28,811 
           |      0.59       0.68       0.83       1.08       1.22 |      0.83 
-----------+-------------------------------------------------------+----------
         7 |     2,143      2,604      3,040      3,681      3,328 |    14,796 
           |      0.25       0.32       0.41       0.60       0.77 |      0.42 
-----------+-------------------------------------------------------+----------
         8 |       955      1,243      1,670      2,104      2,082 |     8,054 
           |      0.11       0.15       0.22       0.35       0.48 |      0.23 
-----------+-------------------------------------------------------+----------
         9 |       422        672        893      1,161      1,226 |     4,374 
           |      0.05       0.08       0.12       0.19       0.28 |      0.13 
-----------+-------------------------------------------------------+----------
     Total |   873,864    824,723    749,221    609,457    432,564 | 3,489,829 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(32) =  5.2e+04   Pr = 0.000
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,076,599       88.16       88.16
          1 |    413,230       11.84      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,037,098       87.03       87.03
          1 |    452,731       12.97      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,761,710       79.14       79.14
          1 |    728,119       20.86      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |  2,707,793       81.33       81.33
  T1DM, controlled |      4,559        0.14       81.46
T1DM, uncontrolled |      9,411        0.28       81.75
  T2DM, controlled |    416,800       12.52       94.26
T2DM, uncontrolled |    188,459        5.66       99.92
Diabetes, no HbA1c |      2,506        0.08      100.00
-------------------+-----------------------------------
             Total |  3,329,528      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  2,991,080       85.71       85.71
    Last year |     41,833        1.20       86.91
2-5 years ago |    124,197        3.56       90.47
     5+ years |    332,719        9.53      100.00
--------------+-----------------------------------
        Total |  3,489,829      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  3,438,436       98.53       98.53
    Last year |      4,958        0.14       98.67
2-5 years ago |     15,342        0.44       99.11
     5+ years |     31,093        0.89      100.00
--------------+-----------------------------------
        Total |  3,489,829      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,483,012       99.80       99.80
          1 |      6,817        0.20      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,488,702       99.97       99.97
          1 |      1,127        0.03      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,481,242       99.75       99.75
          1 |      8,587        0.25      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,457,690       99.08       99.08
          1 |     32,139        0.92      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,421,356       98.04       98.04
          1 |     68,473        1.96      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,231,828       92.61       92.61
          1 |    258,001        7.39      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,107        0.25        0.25
         15 |     47,293        1.43        1.68
         30 |    203,176        6.16        7.84
         45 |    551,793       16.72       24.56
         60 |  2,489,207       75.44      100.00
------------+-----------------------------------
      Total |  3,299,576      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |  2,679,460       76.78       76.78
Stage 3a/3b egfr 30-60       |    754,969       21.63       98.41
           Stage 4/5 egfr<30 |     55,400        1.59      100.00
-----------------------------+-----------------------------------
                       Total |  3,489,829      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,481,193       99.75       99.75
          1 |      8,636        0.25      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,548,492       44.37       44.37
          1 |  1,941,337       55.63      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,224,210       92.39       92.39
          1 |    265,619        7.61      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,287,451       65.55       65.55
          1 |  1,202,378       34.45      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

  Presence of |
  children or |
 young people |
       in the |
    household |      Freq.     Percent        Cum.
--------------+-----------------------------------
      No kids |  3,379,769       96.85       96.85
Kids under 12 |     73,301        2.10       98.95
Kids under 18 |     36,759        1.05      100.00
--------------+-----------------------------------
        Total |  3,489,829      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
           none |  3,379,769       96.85       96.85
 only >12 years |     36,759        1.05       97.90
    1 child <12 |     45,738        1.31       99.21
 2 children <12 |     21,598        0.62       99.83
3+ children <12 |      5,965        0.17      100.00
----------------+-----------------------------------
          Total |  3,489,829      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,480,899       99.74       99.74
          1 |      8,930        0.26      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,436,629       98.48       98.48
          1 |     53,200        1.52      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,474,198       99.55       99.55
          1 |     15,631        0.45      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,480,899       99.74       99.74
          1 |      8,930        0.26      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
     covid |     people in the household
 icu/death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,371,095     73,132     36,672 | 3,480,899 
           |     96.85       2.10       1.05 |    100.00 
           |     99.74      99.77      99.76 |     99.74 
-----------+---------------------------------+----------
         1 |     8,674        169         87 |     8,930 
           |     97.13       1.89       0.97 |    100.00 
           |      0.26       0.23       0.24 |      0.26 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |     96.85       2.10       1.05 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
     covid |            Number kids under 12 years in hh
 icu/death |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 3,371,095     36,672     45,636     21,552      5,944 | 3,480,899 
           |     96.85       1.05       1.31       0.62       0.17 |    100.00 
           |     99.74      99.76      99.78      99.79      99.65 |     99.74 
-----------+-------------------------------------------------------+----------
         1 |     8,674         87        102         46         21 |     8,930 
           |     97.13       0.97       1.14       0.52       0.24 |    100.00 
           |      0.26       0.24       0.22       0.21       0.35 |      0.26 
-----------+-------------------------------------------------------+----------
     Total | 3,379,769     36,759     45,738     21,598      5,965 | 3,489,829 
           |     96.85       1.05       1.31       0.62       0.17 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,436,629       98.48       98.48
          1 |     53,200        1.52      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
 non-covid |     people in the household
     death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,327,757     72,551     36,321 | 3,436,629 
           |     96.83       2.11       1.06 |    100.00 
           |     98.46      98.98      98.81 |     98.48 
-----------+---------------------------------+----------
         1 |    52,012        750        438 |    53,200 
           |     97.77       1.41       0.82 |    100.00 
           |      1.54       1.02       1.19 |      1.52 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |     96.85       2.10       1.05 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |            Number kids under 12 years in hh
     death |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 3,327,757     36,321     45,263     21,385      5,903 | 3,436,629 
           |     96.83       1.06       1.32       0.62       0.17 |    100.00 
           |     98.46      98.81      98.96      99.01      98.96 |     98.48 
-----------+-------------------------------------------------------+----------
         1 |    52,012        438        475        213         62 |    53,200 
           |     97.77       0.82       0.89       0.40       0.12 |    100.00 
           |      1.54       1.19       1.04       0.99       1.04 |      1.52 
-----------+-------------------------------------------------------+----------
     Total | 3,379,769     36,759     45,738     21,598      5,965 | 3,489,829 
           |     96.85       1.05       1.31       0.62       0.17 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,474,198       99.55       99.55
          1 |     15,631        0.45      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
covid prob |     people in the household
      case |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,364,719     72,897     36,582 | 3,474,198 
           |     96.85       2.10       1.05 |    100.00 
           |     99.55      99.45      99.52 |     99.55 
-----------+---------------------------------+----------
         1 |    15,050        404        177 |    15,631 
           |     96.28       2.58       1.13 |    100.00 
           |      0.45       0.55       0.48 |      0.45 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |     96.85       2.10       1.05 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |            Number kids under 12 years in hh
      case |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 3,364,719     36,582     45,504     21,471      5,922 | 3,474,198 
           |     96.85       1.05       1.31       0.62       0.17 |    100.00 
           |     99.55      99.52      99.49      99.41      99.28 |     99.55 
-----------+-------------------------------------------------------+----------
         1 |    15,050        177        234        127         43 |    15,631 
           |     96.28       1.13       1.50       0.81       0.28 |    100.00 
           |      0.45       0.48       0.51       0.59       0.72 |      0.45 
-----------+-------------------------------------------------------+----------
     Total | 3,379,769     36,759     45,738     21,598      5,965 | 3,489,829 
           |     96.85       1.05       1.31       0.62       0.17 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
   Grouped |     people in the household
       age |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
    60-<70 |   758,173     28,399     11,297 |   797,869 
           |     22.43      38.74      30.73 |     22.86 
-----------+---------------------------------+----------
    70-<80 | 1,676,907     34,621     18,376 | 1,729,904 
           |     49.62      47.23      49.99 |     49.57 
-----------+---------------------------------+----------
       80+ |   944,689     10,281      7,086 |   962,056 
           |     27.95      14.03      19.28 |     27.57 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
      Male |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 1,814,163     38,684     19,021 | 1,871,868 
           |     53.68      52.77      51.75 |     53.64 
-----------+---------------------------------+----------
         1 | 1,565,606     34,617     17,738 | 1,617,961 
           |     46.32      47.23      48.25 |     46.36 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
                     |     people in the household
         Grouped BMI |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |    58,085        943        531 |    59,559 
                     |      1.72       1.29       1.44 |      1.71 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |   964,635     17,736      8,635 |   991,006 
                     |     28.54      24.20      23.49 |     28.40 
---------------------+---------------------------------+----------
Overweight (25-29.9) | 1,201,840     24,548     12,624 | 1,239,012 
                     |     35.56      33.49      34.34 |     35.50 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   589,032     13,856      6,865 |   609,753 
                     |     17.43      18.90      18.68 |     17.47 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   193,244      4,741      2,590 |   200,575 
                     |      5.72       6.47       7.05 |      5.75 
---------------------+---------------------------------+----------
     Obese III (40+) |    74,865      2,057      1,061 |    77,983 
                     |      2.22       2.81       2.89 |      2.23 
---------------------+---------------------------------+----------
        Unknown (.u) |   298,068      9,420      4,453 |   311,941 
                     |      8.82      12.85      12.11 |      8.94 
---------------------+---------------------------------+----------
               Total | 3,379,769     73,301     36,759 | 3,489,829 
                     |    100.00     100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |  Presence of children or young
     Smoking |     people in the household
      status |   No kids  Kids unde  Kids unde |     Total
-------------+---------------------------------+----------
       Never | 1,340,030     35,483     16,223 | 1,391,736 
             |     39.65      48.41      44.13 |     39.88 
-------------+---------------------------------+----------
      Former | 1,744,237     28,236     16,053 | 1,788,526 
             |     51.61      38.52      43.67 |     51.25 
-------------+---------------------------------+----------
     Current |   276,992      7,535      3,801 |   288,328 
             |      8.20      10.28      10.34 |      8.26 
-------------+---------------------------------+----------
Unknown (.u) |    18,510      2,047        682 |    21,239 
             |      0.55       2.79       1.86 |      0.61 
-------------+---------------------------------+----------
       Total | 3,379,769     73,301     36,759 | 3,489,829 
             |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
 Evidence of obesity |     people in the household
      (4 categories) |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
No record of obesity | 2,522,628     52,647     26,243 | 2,601,518 
                     |     74.64      71.82      71.39 |     74.55 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   589,032     13,856      6,865 |   609,753 
                     |     17.43      18.90      18.68 |     17.47 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   193,244      4,741      2,590 |   200,575 
                     |      5.72       6.47       7.05 |      5.75 
---------------------+---------------------------------+----------
     Obese III (40+) |    74,865      2,057      1,061 |    77,983 
                     |      2.22       2.81       2.89 |      2.23 
---------------------+---------------------------------+----------
               Total | 3,379,769     73,301     36,759 | 3,489,829 
                     |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
  Probable |     people in the household
 shielding |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 2,210,937     51,566     24,948 | 2,287,451 
           |     65.42      70.35      67.87 |     65.55 
-----------+---------------------------------+----------
         1 | 1,168,832     21,735     11,811 | 1,202,378 
           |     34.58      29.65      32.13 |     34.45 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Total |
    number |  Presence of children or young
 adults in |     people in the household
        hh |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 1,200,657      2,139      2,005 | 1,204,801 
           |     35.52       2.92       5.45 |     34.52 
-----------+---------------------------------+----------
         2 | 1,762,632     12,035      9,091 | 1,783,758 
           |     52.15      16.42      24.73 |     51.11 
-----------+---------------------------------+----------
         3 |   416,480     59,127     25,663 |   501,270 
           |     12.32      80.66      69.81 |     14.36 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Number |  Presence of children or young
 people in |     people in the household
 household |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 1,195,478          0          0 | 1,195,478 
           |     35.37       0.00       0.00 |     34.26 
-----------+---------------------------------+----------
         2 | 1,761,375      1,432      1,683 | 1,764,490 
           |     52.12       1.95       4.58 |     50.56 
-----------+---------------------------------+----------
         3 |   307,716      7,086      7,593 |   322,395 
           |      9.10       9.67      20.66 |      9.24 
-----------+---------------------------------+----------
         4 |    77,667     14,765      9,916 |   102,348 
           |      2.30      20.14      26.98 |      2.93 
-----------+---------------------------------+----------
         5 |    22,545     18,076      8,462 |    49,083 
           |      0.67      24.66      23.02 |      1.41 
-----------+---------------------------------+----------
         6 |     8,462     15,011      5,338 |    28,811 
           |      0.25      20.48      14.52 |      0.83 
-----------+---------------------------------+----------
         7 |     3,407      9,103      2,286 |    14,796 
           |      0.10      12.42       6.22 |      0.42 
-----------+---------------------------------+----------
         8 |     2,006      5,030      1,018 |     8,054 
           |      0.06       6.86       2.77 |      0.23 
-----------+---------------------------------+----------
         9 |     1,113      2,798        463 |     4,374 
           |      0.03       3.82       1.26 |      0.13 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |  Presence of children or young
     Deprivation |     people in the household
           (IMD) |   No kids  Kids unde  Kids unde |     Total
-----------------+---------------------------------+----------
1 least deprived |   853,562     12,949      7,353 |   873,864 
                 |     25.26      17.67      20.00 |     25.04 
-----------------+---------------------------------+----------
               2 |   803,416     13,981      7,326 |   824,723 
                 |     23.77      19.07      19.93 |     23.63 
-----------------+---------------------------------+----------
               3 |   726,148     15,202      7,871 |   749,221 
                 |     21.49      20.74      21.41 |     21.47 
-----------------+---------------------------------+----------
               4 |   585,487     16,323      7,647 |   609,457 
                 |     17.32      22.27      20.80 |     17.46 
-----------------+---------------------------------+----------
 5 most deprived |   411,156     14,846      6,562 |   432,564 
                 |     12.17      20.25      17.85 |     12.39 
-----------------+---------------------------------+----------
           Total | 3,379,769     73,301     36,759 | 3,489,829 
                 |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
                      |     people in the household
            Ethnicity |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                White | 2,362,396     36,012     20,519 | 2,418,927 
                      |     69.90      49.13      55.82 |     69.31 
----------------------+---------------------------------+----------
                Mixed |     8,650        762        363 |     9,775 
                      |      0.26       1.04       0.99 |      0.28 
----------------------+---------------------------------+----------
Asian or Asian Britis |    67,918     16,756      5,490 |    90,164 
                      |      2.01      22.86      14.94 |      2.58 
----------------------+---------------------------------+----------
                Black |    23,610      2,528      1,142 |    27,280 
                      |      0.70       3.45       3.11 |      0.78 
----------------------+---------------------------------+----------
                Other |    18,416      2,114        776 |    21,306 
                      |      0.54       2.88       2.11 |      0.61 
----------------------+---------------------------------+----------
              Unknown |   898,779     15,129      8,469 |   922,377 
                      |     26.59      20.64      23.04 |     26.43 
----------------------+---------------------------------+----------
                Total | 3,379,769     73,301     36,759 | 3,489,829 
                      |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |
      tion |  Presence of children or young
Partnershi |     people in the household
         p |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 |       302         14         10 |       326 
           |      0.01       0.02       0.03 |      0.01 
-----------+---------------------------------+----------
         2 |   276,691      7,948      3,422 |   288,061 
           |      8.19      10.84       9.31 |      8.25 
-----------+---------------------------------+----------
         3 |   152,924      1,885      1,233 |   156,042 
           |      4.52       2.57       3.35 |      4.47 
-----------+---------------------------------+----------
         4 |    33,281        616        363 |    34,260 
           |      0.98       0.84       0.99 |      0.98 
-----------+---------------------------------+----------
         5 |    23,148        393        195 |    23,736 
           |      0.68       0.54       0.53 |      0.68 
-----------+---------------------------------+----------
         6 |   158,447      2,438      1,396 |   162,281 
           |      4.69       3.33       3.80 |      4.65 
-----------+---------------------------------+----------
         7 |     9,178        117         64 |     9,359 
           |      0.27       0.16       0.17 |      0.27 
-----------+---------------------------------+----------
         8 |   133,805      2,059      1,121 |   136,985 
           |      3.96       2.81       3.05 |      3.93 
-----------+---------------------------------+----------
         9 |   126,299      1,643      1,092 |   129,034 
           |      3.74       2.24       2.97 |      3.70 
-----------+---------------------------------+----------
        10 |   138,511      2,210      1,253 |   141,974 
           |      4.10       3.01       3.41 |      4.07 
-----------+---------------------------------+----------
        11 |   136,501      4,337      1,995 |   142,833 
           |      4.04       5.92       5.43 |      4.09 
-----------+---------------------------------+----------
        12 |    36,233      1,821        749 |    38,803 
           |      1.07       2.48       2.04 |      1.11 
-----------+---------------------------------+----------
        13 |    65,350      2,254        956 |    68,560 
           |      1.93       3.07       2.60 |      1.96 
-----------+---------------------------------+----------
        14 |    82,142      1,904      1,005 |    85,051 
           |      2.43       2.60       2.73 |      2.44 
-----------+---------------------------------+----------
        15 |   107,954      2,651      1,215 |   111,820 
           |      3.19       3.62       3.31 |      3.20 
-----------+---------------------------------+----------
        16 |   162,507      2,148      1,193 |   165,848 
           |      4.81       2.93       3.25 |      4.75 
-----------+---------------------------------+----------
        17 |   120,585      1,774      1,053 |   123,412 
           |      3.57       2.42       2.86 |      3.54 
-----------+---------------------------------+----------
        18 |   119,428      4,338      1,879 |   125,645 
           |      3.53       5.92       5.11 |      3.60 
-----------+---------------------------------+----------
        19 |   107,856      2,721      1,311 |   111,888 
           |      3.19       3.71       3.57 |      3.21 
-----------+---------------------------------+----------
        20 |   174,347      4,070      2,052 |   180,469 
           |      5.16       5.55       5.58 |      5.17 
-----------+---------------------------------+----------
        21 |   121,821      9,161      3,629 |   134,611 
           |      3.60      12.50       9.87 |      3.86 
-----------+---------------------------------+----------
        22 |     8,560        637        225 |     9,422 
           |      0.25       0.87       0.61 |      0.27 
-----------+---------------------------------+----------
        23 |   148,873      2,611      1,325 |   152,809 
           |      4.40       3.56       3.60 |      4.38 
-----------+---------------------------------+----------
        24 |     7,941        129         70 |     8,140 
           |      0.23       0.18       0.19 |      0.23 
-----------+---------------------------------+----------
        25 |    44,602        681        400 |    45,683 
           |      1.32       0.93       1.09 |      1.31 
-----------+---------------------------------+----------
        26 |   148,765      2,017      1,258 |   152,040 
           |      4.40       2.75       3.42 |      4.36 
-----------+---------------------------------+----------
        27 |   143,636      2,363      1,261 |   147,260 
           |      4.25       3.22       3.43 |      4.22 
-----------+---------------------------------+----------
        28 |   147,169      2,247      1,181 |   150,597 
           |      4.35       3.07       3.21 |      4.32 
-----------+---------------------------------+----------
        29 |    95,313      1,580        883 |    97,776 
           |      2.82       2.16       2.40 |      2.80 
-----------+---------------------------------+----------
        30 |    79,539        998        664 |    81,201 
           |      2.35       1.36       1.81 |      2.33 
-----------+---------------------------------+----------
        31 |     4,811         68         33 |     4,912 
           |      0.14       0.09       0.09 |      0.14 
-----------+---------------------------------+----------
        32 |   263,250      3,468      2,273 |   268,991 
           |      7.79       4.73       6.18 |      7.71 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
Respirator |     people in the household
y Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 2,978,232     65,903     32,464 | 3,076,599 
           |     88.12      89.91      88.32 |     88.16 
-----------+---------------------------------+----------
         1 |   401,537      7,398      4,295 |   413,230 
           |     11.88      10.09      11.68 |     11.84 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
    Asthma |     people in the household
  category |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 2,942,244     63,170     31,684 | 3,037,098 
           |     87.05      86.18      86.19 |     87.03 
-----------+---------------------------------+----------
         1 |   437,525     10,131      5,075 |   452,731 
           |     12.95      13.82      13.81 |     12.97 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
   Cardiac |     people in the household
  Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 2,673,192     59,366     29,152 | 2,761,710 
           |     79.09      80.99      79.31 |     79.14 
-----------+---------------------------------+----------
         1 |   706,577     13,935      7,607 |   728,119 
           |     20.91      19.01      20.69 |     20.86 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |  Presence of children or young
                   |     people in the household
          Diabetes |   No kids  Kids unde  Kids unde |     Total
-------------------+---------------------------------+----------
       No diabetes | 2,632,002     49,796     25,995 | 2,707,793 
                   |     81.59      72.23      74.86 |     81.33 
-------------------+---------------------------------+----------
  T1DM, controlled |     4,439         78         42 |     4,559 
                   |      0.14       0.11       0.12 |      0.14 
-------------------+---------------------------------+----------
T1DM, uncontrolled |     9,169        151         91 |     9,411 
                   |      0.28       0.22       0.26 |      0.28 
-------------------+---------------------------------+----------
  T2DM, controlled |   399,594     11,706      5,500 |   416,800 
                   |     12.39      16.98      15.84 |     12.52 
-------------------+---------------------------------+----------
T2DM, uncontrolled |   178,379      7,046      3,034 |   188,459 
                   |      5.53      10.22       8.74 |      5.66 
-------------------+---------------------------------+----------
Diabetes, no HbA1c |     2,279        164         63 |     2,506 
                   |      0.07       0.24       0.18 |      0.08 
-------------------+---------------------------------+----------
             Total | 3,225,862     68,941     34,725 | 3,329,528 
                   |    100.00     100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Non-haematolo |     people in the household
 gical cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 2,892,068     66,296     32,716 | 2,991,080 
              |     85.57      90.44      89.00 |     85.71 
--------------+---------------------------------+----------
    Last year |    40,773        705        355 |    41,833 
              |      1.21       0.96       0.97 |      1.20 
--------------+---------------------------------+----------
2-5 years ago |   121,093      2,006      1,098 |   124,197 
              |      3.58       2.74       2.99 |      3.56 
--------------+---------------------------------+----------
     5+ years |   325,835      4,294      2,590 |   332,719 
              |      9.64       5.86       7.05 |      9.53 
--------------+---------------------------------+----------
        Total | 3,379,769     73,301     36,759 | 3,489,829 
              |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Haematologica |     people in the household
     l cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 3,329,634     72,492     36,310 | 3,438,436 
              |     98.52      98.90      98.78 |     98.53 
--------------+---------------------------------+----------
    Last year |     4,835         81         42 |     4,958 
              |      0.14       0.11       0.11 |      0.14 
--------------+---------------------------------+----------
2-5 years ago |    14,956        239        147 |    15,342 
              |      0.44       0.33       0.40 |      0.44 
--------------+---------------------------------+----------
     5+ years |    30,344        489        260 |    31,093 
              |      0.90       0.67       0.71 |      0.89 
--------------+---------------------------------+----------
        Total | 3,379,769     73,301     36,759 | 3,489,829 
              |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |  Presence of children or young
        on |     people in the household
algorithm) |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,373,204     73,134     36,674 | 3,483,012 
           |     99.81      99.77      99.77 |     99.80 
-----------+---------------------------------+----------
         1 |     6,565        167         85 |     6,817 
           |      0.19       0.23       0.23 |      0.20 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |  Presence of children or young
     organ |     people in the household
transplant |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,378,695     73,265     36,742 | 3,488,702 
           |     99.97      99.95      99.95 |     99.97 
-----------+---------------------------------+----------
         1 |     1,074         36         17 |     1,127 
           |      0.03       0.05       0.05 |      0.03 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
  Asplenia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,371,398     73,167     36,677 | 3,481,242 
           |     99.75      99.82      99.78 |     99.75 
-----------+---------------------------------+----------
         1 |     8,371        134         82 |     8,587 
           |      0.25       0.18       0.22 |      0.25 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
     liver |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,348,720     72,587     36,383 | 3,457,690 
           |     99.08      99.03      98.98 |     99.08 
-----------+---------------------------------+----------
         1 |    31,049        714        376 |    32,139 
           |      0.92       0.97       1.02 |      0.92 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Neurologic |     people in the household
al disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,313,184     72,049     36,123 | 3,421,356 
           |     98.03      98.29      98.27 |     98.04 
-----------+---------------------------------+----------
         1 |    66,585      1,252        636 |    68,473 
           |      1.97       1.71       1.73 |      1.96 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
 Stroke or |     people in the household
  dementia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,128,910     68,701     34,217 | 3,231,828 
           |     92.58      93.72      93.08 |     92.61 
-----------+---------------------------------+----------
         1 |   250,859      4,600      2,542 |   258,001 
           |      7.42       6.28       6.92 |      7.39 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Calculated |     people in the household
      eGFR |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 |     7,700        272        135 |     8,107 
           |      0.24       0.42       0.40 |      0.25 
-----------+---------------------------------+----------
        15 |    45,991        842        460 |    47,293 
           |      1.44       1.29       1.37 |      1.43 
-----------+---------------------------------+----------
        30 |   198,405      2,982      1,789 |   203,176 
           |      6.20       4.56       5.33 |      6.16 
-----------+---------------------------------+----------
        45 |   538,047      8,667      5,079 |   551,793 
           |     16.81      13.25      15.14 |     16.72 
-----------+---------------------------------+----------
        60 | 2,410,451     52,663     26,093 | 2,489,207 
           |     75.31      80.49      77.76 |     75.44 
-----------+---------------------------------+----------
     Total | 3,200,594     65,426     33,556 | 3,299,576 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
       Reduced kidney |     people in the household
             function |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                 None | 2,589,626     60,538     29,296 | 2,679,460 
                      |     76.62      82.59      79.70 |     76.78 
----------------------+---------------------------------+----------
Stage 3a/3b egfr 30-6 |   736,452     11,649      6,868 |   754,969 
                      |     21.79      15.89      18.68 |     21.63 
----------------------+---------------------------------+----------
    Stage 4/5 egfr<30 |    53,691      1,114        595 |    55,400 
                      |      1.59       1.52       1.62 |      1.59 
----------------------+---------------------------------+----------
                Total | 3,379,769     73,301     36,759 | 3,489,829 
                      |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |  Presence of children or young
     renal |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,371,568     72,996     36,629 | 3,481,193 
           |     99.76      99.58      99.65 |     99.75 
-----------+---------------------------------+----------
         1 |     8,201        305        130 |     8,636 
           |      0.24       0.42       0.35 |      0.25 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |  Presence of children or young
hypertensi |     people in the household
        on |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 1,496,234     35,386     16,872 | 1,548,492 
           |     44.27      48.27      45.90 |     44.37 
-----------+---------------------------------+----------
         1 | 1,883,535     37,915     19,887 | 1,941,337 
           |     55.73      51.73      54.10 |     55.63 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Autoimmune |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,121,389     68,671     34,150 | 3,224,210 
           |     92.36      93.68      92.90 |     92.39 
-----------+---------------------------------+----------
         1 |   258,380      4,630      2,609 |   265,619 
           |      7.64       6.32       7.10 |      7.61 
-----------+---------------------------------+----------
     Total | 3,379,769     73,301     36,759 | 3,489,829 
           |    100.00     100.00     100.00 |    100.00 

. * Close the log file
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\03a_an_descriptive_tables.log
  log type:  text
 closed on:  26 Aug 2020, 18:54:00
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
