------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\04a_an_descriptive_tables.log
  log type:  text
 opened on:  26 Aug 2020, 18:36:22

. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_ageband_`x', clear
  3. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. ta shield
 16. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd            ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 17.                                                 
. safetab `var'
 18. }
 19. 
. safetab imd 
 20. safetab imd, m
 21. safetab ethnicity
 22. safetab ethnicity, m
 23. safetab stp
 24. 
. 
. * Outcomes
. safetab non_covid_death
 25. safetab covid_death
 26. safetab covid_tpp_prob
 27. safetab covid_death_icu
 28. safetab covid_icu
 29. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death_icu non_covid_death {
 30. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                        `outvar', col
 31.         safetab male                                                            `outvar', col
 32.         safetab bmicat                                                          `outvar', col m 
 33.         safetab smoke                                                           `outvar', col m
 34.         safetab obese4cat                                                       `outvar', col m 
 35.         safetab shield                                                          `outvar', col m 
 36. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat                                               ///
>                                                 cancer_haem_cat                                                 ///
>                                                 other_immuno    ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 egfr_cat  ///
>                                                 esrd ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 37.         safetab `var'           `outvar', col
 38. }
 39.         
.         safetab imd                                                             `outvar', col m
 40.         safetab ethnicity                                                       `outvar', col m
 41.         *safetab urban                                                          `outvar', col
.         safetab stp                                                             `outvar', col
 42. }
 43. 
. 
. ********************************************
. *  Cumulative incidence of ONS COVID DEATH*
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_death_icu_ageband_`x'.dta", clear
 44. 
. sts list , at(0 80) by(agegroup male) fail
 45. 
. 
. ********************************************
. *  Cumulative incidence of ONS NON COVID DEATH*
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_non_covid_death_ageband_`x'.dta", clear
 46. 
. sts list , at(0 80) by(agegroup male) fail
 47. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROBABLE CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'.dta", clear
 48. 
. sts list , at(0 80) by(agegroup male) fail
 49. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 12,054,790    41.46564     13.3974         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  2,845,170       23.60       23.60
     30-<40 |  2,768,104       22.96       46.56
     40-<50 |  2,495,511       20.70       67.27
     50-<60 |  2,624,926       21.77       89.04
     60-<70 |  1,321,079       10.96      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,054,790      100.00      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  6,009,141       49.85       49.85
          1 |  6,045,649       50.15      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    223,686        2.44        2.44
  Normal (18.5-24.9) |  3,406,279       37.19       39.64
Overweight (25-29.9) |  3,003,382       32.79       72.43
   Obese I (30-34.9) |  1,543,250       16.85       89.28
  Obese II (35-39.9) |    635,788        6.94       96.23
     Obese III (40+) |    345,676        3.77      100.00
---------------------+-----------------------------------
               Total |  9,158,061      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    223,686        1.86        1.86
  Normal (18.5-24.9) |  3,406,279       28.26       30.11
Overweight (25-29.9) |  3,003,382       24.91       55.03
   Obese I (30-34.9) |  1,543,250       12.80       67.83
  Obese II (35-39.9) |    635,788        5.27       73.10
     Obese III (40+) |    345,676        2.87       75.97
        Unknown (.u) |  2,896,729       24.03      100.00
---------------------+-----------------------------------
               Total | 12,054,790      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  9,530,076       79.06       79.06
   Obese I (30-34.9) |  1,543,250       12.80       91.86
  Obese II (35-39.9) |    635,788        5.27       97.13
     Obese III (40+) |    345,676        2.87      100.00
---------------------+-----------------------------------
               Total | 12,054,790      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,728,099       49.98       49.98
      Former |  3,303,232       28.82       78.80
     Current |  2,429,584       21.20      100.00
-------------+-----------------------------------
       Total | 11,460,915      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,728,099       47.52       47.52
      Former |  3,303,232       27.40       74.92
     Current |  2,429,584       20.15       95.07
Unknown (.u) |    593,875        4.93      100.00
-------------+-----------------------------------
       Total | 12,054,790      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,090,816       29.38       29.38
      Elevated |  1,701,064       16.17       45.55
 High, stage I |  3,688,954       35.06       80.61
High, stage II |  2,039,769       19.39      100.00
---------------+-----------------------------------
         Total | 10,520,603      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,090,816       25.64       25.64
      Elevated |  1,701,064       14.11       39.75
 High, stage I |  3,688,954       30.60       70.35
High, stage II |  2,039,769       16.92       87.27
       Unknown |  1,534,187       12.73      100.00
---------------+-----------------------------------
         Total | 12,054,790      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,236,251       76.62       76.62
          1 |  2,818,539       23.38      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,568,695       79.38       79.38
          1 |  2,486,095       20.62      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,825,600       98.10       98.10
          1 |    229,190        1.90      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,011,771       83.05       83.05
          1 |  2,043,019       16.95      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,719,491       97.22       97.22
          1 |    335,299        2.78      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 11,307,629       95.26       95.26
  T1DM, controlled |     16,423        0.14       95.39
T1DM, uncontrolled |     49,194        0.41       95.81
  T2DM, controlled |    275,002        2.32       98.13
T2DM, uncontrolled |    217,094        1.83       99.95
Diabetes, no HbA1c |      5,483        0.05      100.00
-------------------+-----------------------------------
             Total | 11,870,825      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,797,926       97.87       97.87
    Last year |     28,605        0.24       98.11
2-5 years ago |     82,318        0.68       98.79
     5+ years |    145,941        1.21      100.00
--------------+-----------------------------------
        Total | 12,054,790      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 12,016,997       99.69       99.69
    Last year |      3,056        0.03       99.71
2-5 years ago |      9,513        0.08       99.79
     5+ years |     25,224        0.21      100.00
--------------+-----------------------------------
        Total | 12,054,790      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,015,567       99.67       99.67
          1 |     39,223        0.33      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,051,966       99.98       99.98
          1 |      2,824        0.02      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,040,929       99.89       99.89
          1 |     13,861        0.11      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,991,598       99.48       99.48
          1 |     63,192        0.52      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,972,286       99.32       99.32
          1 |     82,504        0.68      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,962,956       99.24       99.24
          1 |     91,834        0.76      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,989        0.06        0.06
         15 |      6,929        0.08        0.14
         30 |     16,738        0.20        0.35
         45 |    105,021        1.27        1.62
         60 |  8,121,544       98.38      100.00
------------+-----------------------------------
      Total |  8,255,221      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 11,921,113       98.89       98.89
Stage 3a/3b egfr 30-60       |    121,759        1.01       99.90
           Stage 4/5 egfr<30 |     11,918        0.10      100.00
-----------------------------+-----------------------------------
                       Total | 12,054,790      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,040,467       99.88       99.88
          1 |     14,323        0.12      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,715,484       88.89       88.89
          1 |  1,339,306       11.11      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,528,448       95.63       95.63
          1 |    526,342        4.37      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,296,481       19.05       19.05
               2 |  2,408,020       19.98       39.03
               3 |  2,476,236       20.54       59.57
               4 |  2,560,130       21.24       80.80
 5 most deprived |  2,313,923       19.20      100.00
-----------------+-----------------------------------
           Total | 12,054,790      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,296,481       19.05       19.05
               2 |  2,408,020       19.98       39.03
               3 |  2,476,236       20.54       59.57
               4 |  2,560,130       21.24       80.80
 5 most deprived |  2,313,923       19.20      100.00
-----------------+-----------------------------------
           Total | 12,054,790      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,568,414       82.65       82.65
                 Mixed |    158,211        1.73       84.38
Asian or Asian British |    833,178        9.10       93.48
                 Black |    306,342        3.35       96.83
                 Other |    290,505        3.17      100.00
-----------------------+-----------------------------------
                 Total |  9,156,650      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,568,414       62.78       62.78
                 Mixed |    158,211        1.31       64.10
Asian or Asian British |    833,178        6.91       71.01
                 Black |    306,342        2.54       73.55
                 Other |    290,505        2.41       75.96
               Unknown |  2,898,140       24.04      100.00
-----------------------+-----------------------------------
                 Total | 12,054,790      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,299        0.03        0.03
          2 |  1,147,519        9.52        9.55
          3 |    520,866        4.32       13.87
          4 |    120,044        1.00       14.86
          5 |     84,535        0.70       15.56
          6 |    566,583        4.70       20.26
          7 |     33,906        0.28       20.55
          8 |    439,715        3.65       24.19
          9 |    340,400        2.82       27.02
         10 |    479,727        3.98       31.00
         11 |    537,837        4.46       35.46
         12 |    183,735        1.52       36.98
         13 |    271,068        2.25       39.23
         14 |    334,548        2.78       42.01
         15 |    428,231        3.55       45.56
         16 |    423,433        3.51       49.07
         17 |    367,079        3.05       52.12
         18 |    536,674        4.45       56.57
         19 |    419,814        3.48       60.05
         20 |    595,523        4.94       64.99
         21 |    971,579        8.06       73.05
         22 |     62,504        0.52       73.57
         23 |    459,008        3.81       77.38
         24 |     21,869        0.18       77.56
         25 |    117,285        0.97       78.53
         26 |    368,126        3.05       81.59
         27 |    459,895        3.82       85.40
         28 |    370,468        3.07       88.47
         29 |    312,517        2.59       91.07
         30 |    239,477        1.99       93.05
         31 |     14,213        0.12       93.17
         32 |    823,313        6.83      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,044,500       99.91       99.91
          1 |     10,290        0.09      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,053,329       99.99       99.99
          1 |      1,461        0.01      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,020,764       99.72       99.72
          1 |     34,026        0.28      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,052,072       99.98       99.98
          1 |      2,718        0.02      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,052,970       99.98       99.98
          1 |      1,820        0.02      100.00
------------+-----------------------------------
      Total | 12,054,790      100.00
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,839,276      5,894 | 2,845,170 
           |     23.62      17.32 |     23.60 
-----------+----------------------+----------
    30-<40 | 2,761,056      7,048 | 2,768,104 
           |     22.97      20.71 |     22.96 
-----------+----------------------+----------
    40-<50 | 2,487,851      7,660 | 2,495,511 
           |     20.70      22.51 |     20.70 
-----------+----------------------+----------
    50-<60 | 2,615,778      9,148 | 2,624,926 
           |     21.76      26.89 |     21.77 
-----------+----------------------+----------
    60-<70 | 1,316,803      4,276 | 1,321,079 
           |     10.95      12.57 |     10.96 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 5,989,525     19,616 | 6,009,141 
           |     49.83      57.65 |     49.85 
-----------+----------------------+----------
         1 | 6,031,239     14,410 | 6,045,649 
           |     50.17      42.35 |     50.15 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   223,155        531 |   223,686 
                     |      1.86       1.56 |      1.86 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,398,306      7,973 | 3,406,279 
                     |     28.27      23.43 |     28.26 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,993,868      9,514 | 3,003,382 
                     |     24.91      27.96 |     24.91 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,537,226      6,024 | 1,543,250 
                     |     12.79      17.70 |     12.80 
---------------------+----------------------+----------
  Obese II (35-39.9) |   632,861      2,927 |   635,788 
                     |      5.26       8.60 |      5.27 
---------------------+----------------------+----------
     Obese III (40+) |   343,733      1,943 |   345,676 
                     |      2.86       5.71 |      2.87 
---------------------+----------------------+----------
        Unknown (.u) | 2,891,615      5,114 | 2,896,729 
                     |     24.06      15.03 |     24.03 
---------------------+----------------------+----------
               Total |12,020,764     34,026 |12,054,790 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,710,265     17,834 | 5,728,099 
             |     47.50      52.41 |     47.52 
-------------+----------------------+----------
      Former | 3,292,392     10,840 | 3,303,232 
             |     27.39      31.86 |     27.40 
-------------+----------------------+----------
     Current | 2,425,000      4,584 | 2,429,584 
             |     20.17      13.47 |     20.15 
-------------+----------------------+----------
Unknown (.u) |   593,107        768 |   593,875 
             |      4.93       2.26 |      4.93 
-------------+----------------------+----------
       Total |12,020,764     34,026 |12,054,790 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,506,944     23,132 | 9,530,076 
                     |     79.09      67.98 |     79.06 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,537,226      6,024 | 1,543,250 
                     |     12.79      17.70 |     12.80 
---------------------+----------------------+----------
  Obese II (35-39.9) |   632,861      2,927 |   635,788 
                     |      5.26       8.60 |      5.27 
---------------------+----------------------+----------
     Obese III (40+) |   343,733      1,943 |   345,676 
                     |      2.86       5.71 |      2.87 
---------------------+----------------------+----------
               Total |12,020,764     34,026 |12,054,790 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,543,869     24,826 | 9,568,695 
           |     79.39      72.96 |     79.38 
-----------+----------------------+----------
         1 | 2,476,895      9,200 | 2,486,095 
           |     20.61      27.04 |     20.62 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,792,996     32,604 |11,825,600 
           |     98.11      95.82 |     98.10 
-----------+----------------------+----------
         1 |   227,768      1,422 |   229,190 
           |      1.89       4.18 |      1.90 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,984,527     27,244 |10,011,771 
           |     83.06      80.07 |     83.05 
-----------+----------------------+----------
         1 | 2,036,237      6,782 | 2,043,019 
           |     16.94      19.93 |     16.95 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,687,273     32,218 |11,719,491 
           |     97.23      94.69 |     97.22 
-----------+----------------------+----------
         1 |   333,491      1,808 |   335,299 
           |      2.77       5.31 |      2.78 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: covid prob
                   |         case
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |11,278,181     29,448 |11,307,629 
                   |     95.27      88.75 |     95.26 
-------------------+----------------------+----------
  T1DM, controlled |    16,358         65 |    16,423 
                   |      0.14       0.20 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    48,963        231 |    49,194 
                   |      0.41       0.70 |      0.41 
-------------------+----------------------+----------
  T2DM, controlled |   273,255      1,747 |   275,002 
                   |      2.31       5.26 |      2.32 
-------------------+----------------------+----------
T2DM, uncontrolled |   215,425      1,669 |   217,094 
                   |      1.82       5.03 |      1.83 
-------------------+----------------------+----------
Diabetes, no HbA1c |     5,461         22 |     5,483 
                   |      0.05       0.07 |      0.05 
-------------------+----------------------+----------
             Total |11,837,643     33,182 |11,870,825 
                   |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,764,949     32,977 |11,797,926 
              |     97.87      96.92 |     97.87 
--------------+----------------------+----------
    Last year |    28,425        180 |    28,605 
              |      0.24       0.53 |      0.24 
--------------+----------------------+----------
2-5 years ago |    81,972        346 |    82,318 
              |      0.68       1.02 |      0.68 
--------------+----------------------+----------
     5+ years |   145,418        523 |   145,941 
              |      1.21       1.54 |      1.21 
--------------+----------------------+----------
        Total |12,020,764     34,026 |12,054,790 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,983,228     33,769 |12,016,997 
              |     99.69      99.24 |     99.69 
--------------+----------------------+----------
    Last year |     3,021         35 |     3,056 
              |      0.03       0.10 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,429         84 |     9,513 
              |      0.08       0.25 |      0.08 
--------------+----------------------+----------
     5+ years |    25,086        138 |    25,224 
              |      0.21       0.41 |      0.21 
--------------+----------------------+----------
        Total |12,020,764     34,026 |12,054,790 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |11,981,813     33,754 |12,015,567 
           |     99.68      99.20 |     99.67 
-----------+----------------------+----------
         1 |    38,951        272 |    39,223 
           |      0.32       0.80 |      0.33 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |12,017,986     33,980 |12,051,966 
           |     99.98      99.86 |     99.98 
-----------+----------------------+----------
         1 |     2,778         46 |     2,824 
           |      0.02       0.14 |      0.02 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,007,013     33,916 |12,040,929 
           |     99.89      99.68 |     99.89 
-----------+----------------------+----------
         1 |    13,751        110 |    13,861 
           |      0.11       0.32 |      0.11 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,957,969     33,629 |11,991,598 
           |     99.48      98.83 |     99.48 
-----------+----------------------+----------
         1 |    62,795        397 |    63,192 
           |      0.52       1.17 |      0.52 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,938,647     33,639 |11,972,286 
           |     99.32      98.86 |     99.32 
-----------+----------------------+----------
         1 |    82,117        387 |    82,504 
           |      0.68       1.14 |      0.68 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,929,499     33,457 |11,962,956 
           |     99.24      98.33 |     99.24 
-----------+----------------------+----------
         1 |    91,265        569 |    91,834 
           |      0.76       1.67 |      0.76 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,830        159 |     4,989 
           |      0.06       0.57 |      0.06 
-----------+----------------------+----------
        15 |     6,843         86 |     6,929 
           |      0.08       0.31 |      0.08 
-----------+----------------------+----------
        30 |    16,583        155 |    16,738 
           |      0.20       0.55 |      0.20 
-----------+----------------------+----------
        45 |   104,511        510 |   105,021 
           |      1.27       1.82 |      1.27 
-----------+----------------------+----------
        60 | 8,094,375     27,169 | 8,121,544 
           |     98.39      96.76 |     98.38 
-----------+----------------------+----------
     Total | 8,227,142     28,079 | 8,255,221 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,006,732     33,735 |12,040,467 
           |     99.88      99.14 |     99.88 
-----------+----------------------+----------
         1 |    14,032        291 |    14,323 
           |      0.12       0.86 |      0.12 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,887,997     33,116 |11,921,113 
                      |     98.90      97.33 |     98.89 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   121,094        665 |   121,759 
                      |      1.01       1.95 |      1.01 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,673        245 |    11,918 
                      |      0.10       0.72 |      0.10 
----------------------+----------------------+----------
                Total |12,020,764     34,026 |12,054,790 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,687,781     27,703 |10,715,484 
           |     88.91      81.42 |     88.89 
-----------+----------------------+----------
         1 | 1,332,983      6,323 | 1,339,306 
           |     11.09      18.58 |     11.11 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,496,357     32,091 |11,528,448 
           |     95.64      94.31 |     95.63 
-----------+----------------------+----------
         1 |   524,407      1,935 |   526,342 
           |      4.36       5.69 |      4.37 
-----------+----------------------+----------
     Total |12,020,764     34,026 |12,054,790 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,291,521      4,960 | 2,296,481 
                 |     19.06      14.58 |     19.05 
-----------------+----------------------+----------
               2 | 2,402,135      5,885 | 2,408,020 
                 |     19.98      17.30 |     19.98 
-----------------+----------------------+----------
               3 | 2,469,910      6,326 | 2,476,236 
                 |     20.55      18.59 |     20.54 
-----------------+----------------------+----------
               4 | 2,552,213      7,917 | 2,560,130 
                 |     21.23      23.27 |     21.24 
-----------------+----------------------+----------
 5 most deprived | 2,304,985      8,938 | 2,313,923 
                 |     19.18      26.27 |     19.20 
-----------------+----------------------+----------
           Total |12,020,764     34,026 |12,054,790 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,550,035     18,379 | 7,568,414 
                      |     62.81      54.01 |     62.78 
----------------------+----------------------+----------
                Mixed |   157,680        531 |   158,211 
                      |      1.31       1.56 |      1.31 
----------------------+----------------------+----------
Asian or Asian Britis |   827,020      6,158 |   833,178 
                      |      6.88      18.10 |      6.91 
----------------------+----------------------+----------
                Black |   304,933      1,409 |   306,342 
                      |      2.54       4.14 |      2.54 
----------------------+----------------------+----------
                Other |   289,718        787 |   290,505 
                      |      2.41       2.31 |      2.41 
----------------------+----------------------+----------
              Unknown | 2,891,378      6,762 | 2,898,140 
                      |     24.05      19.87 |     24.04 
----------------------+----------------------+----------
                Total |12,020,764     34,026 |12,054,790 
                      |    100.00     100.00 |    100.00 
19

**TABLE OF stp covid_tpp_prob REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |       icu/death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,845,116         54 | 2,845,170 
           |     23.61       1.99 |     23.60 
-----------+----------------------+----------
    30-<40 | 2,767,920        184 | 2,768,104 
           |     22.97       6.77 |     22.96 
-----------+----------------------+----------
    40-<50 | 2,495,043        468 | 2,495,511 
           |     20.70      17.22 |     20.70 
-----------+----------------------+----------
    50-<60 | 2,623,835      1,091 | 2,624,926 
           |     21.77      40.14 |     21.77 
-----------+----------------------+----------
    60-<70 | 1,320,158        921 | 1,321,079 
           |     10.95      33.89 |     10.96 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,008,214        927 | 6,009,141 
           |     49.85      34.11 |     49.85 
-----------+----------------------+----------
         1 | 6,043,858      1,791 | 6,045,649 
           |     50.15      65.89 |     50.15 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |       icu/death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   223,652         34 |   223,686 
                     |      1.86       1.25 |      1.86 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,405,911        368 | 3,406,279 
                     |     28.26      13.54 |     28.26 
---------------------+----------------------+----------
Overweight (25-29.9) | 3,002,706        676 | 3,003,382 
                     |     24.91      24.87 |     24.91 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,542,615        635 | 1,543,250 
                     |     12.80      23.36 |     12.80 
---------------------+----------------------+----------
  Obese II (35-39.9) |   635,404        384 |   635,788 
                     |      5.27      14.13 |      5.27 
---------------------+----------------------+----------
     Obese III (40+) |   345,395        281 |   345,676 
                     |      2.87      10.34 |      2.87 
---------------------+----------------------+----------
        Unknown (.u) | 2,896,389        340 | 2,896,729 
                     |     24.03      12.51 |     24.03 
---------------------+----------------------+----------
               Total |12,052,072      2,718 |12,054,790 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |       icu/death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,726,850      1,249 | 5,728,099 
             |     47.52      45.95 |     47.52 
-------------+----------------------+----------
      Former | 3,302,108      1,124 | 3,303,232 
             |     27.40      41.35 |     27.40 
-------------+----------------------+----------
     Current | 2,429,254        330 | 2,429,584 
             |     20.16      12.14 |     20.15 
-------------+----------------------+----------
Unknown (.u) |   593,860         15 |   593,875 
             |      4.93       0.55 |      4.93 
-------------+----------------------+----------
       Total |12,052,072      2,718 |12,054,790 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |       icu/death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,528,658      1,418 | 9,530,076 
                     |     79.06      52.17 |     79.06 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,542,615        635 | 1,543,250 
                     |     12.80      23.36 |     12.80 
---------------------+----------------------+----------
  Obese II (35-39.9) |   635,404        384 |   635,788 
                     |      5.27      14.13 |      5.27 
---------------------+----------------------+----------
     Obese III (40+) |   345,395        281 |   345,676 
                     |      2.87      10.34 |      2.87 
---------------------+----------------------+----------
               Total |12,052,072      2,718 |12,054,790 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |       icu/death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,567,048      1,647 | 9,568,695 
           |     79.38      60.60 |     79.38 
-----------+----------------------+----------
         1 | 2,485,024      1,071 | 2,486,095 
           |     20.62      39.40 |     20.62 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |       icu/death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,823,208      2,392 |11,825,600 
           |     98.10      88.01 |     98.10 
-----------+----------------------+----------
         1 |   228,864        326 |   229,190 
           |      1.90      11.99 |      1.90 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |       icu/death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |10,009,602      2,169 |10,011,771 
           |     83.05      79.80 |     83.05 
-----------+----------------------+----------
         1 | 2,042,470        549 | 2,043,019 
           |     16.95      20.20 |     16.95 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |       icu/death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,717,193      2,298 |11,719,491 
           |     97.22      84.55 |     97.22 
-----------+----------------------+----------
         1 |   334,879        420 |   335,299 
           |      2.78      15.45 |      2.78 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |    outcome: covid
                   |       icu/death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |11,305,874      1,755 |11,307,629 
                   |     95.26      67.84 |     95.26 
-------------------+----------------------+----------
  T1DM, controlled |    16,412         11 |    16,423 
                   |      0.14       0.43 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    49,153         41 |    49,194 
                   |      0.41       1.58 |      0.41 
-------------------+----------------------+----------
  T2DM, controlled |   274,656        346 |   275,002 
                   |      2.31      13.37 |      2.32 
-------------------+----------------------+----------
T2DM, uncontrolled |   216,668        426 |   217,094 
                   |      1.83      16.47 |      1.83 
-------------------+----------------------+----------
Diabetes, no HbA1c |     5,475          8 |     5,483 
                   |      0.05       0.31 |      0.05 
-------------------+----------------------+----------
             Total |11,868,238      2,587 |11,870,825 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |       icu/death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,795,393      2,533 |11,797,926 
              |     97.87      93.19 |     97.87 
--------------+----------------------+----------
    Last year |    28,558         47 |    28,605 
              |      0.24       1.73 |      0.24 
--------------+----------------------+----------
2-5 years ago |    82,248         70 |    82,318 
              |      0.68       2.58 |      0.68 
--------------+----------------------+----------
     5+ years |   145,873         68 |   145,941 
              |      1.21       2.50 |      1.21 
--------------+----------------------+----------
        Total |12,052,072      2,718 |12,054,790 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |       icu/death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,014,340      2,657 |12,016,997 
              |     99.69      97.76 |     99.69 
--------------+----------------------+----------
    Last year |     3,047          9 |     3,056 
              |      0.03       0.33 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,486         27 |     9,513 
              |      0.08       0.99 |      0.08 
--------------+----------------------+----------
     5+ years |    25,199         25 |    25,224 
              |      0.21       0.92 |      0.21 
--------------+----------------------+----------
        Total |12,052,072      2,718 |12,054,790 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |       icu/death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |12,012,887      2,680 |12,015,567 
           |     99.67      98.60 |     99.67 
-----------+----------------------+----------
         1 |    39,185         38 |    39,223 
           |      0.33       1.40 |      0.33 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |    outcome: covid
     organ |       icu/death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |12,049,254      2,712 |12,051,966 
           |     99.98      99.78 |     99.98 
-----------+----------------------+----------
         1 |     2,818          6 |     2,824 
           |      0.02       0.22 |      0.02 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,038,227      2,702 |12,040,929 
           |     99.89      99.41 |     99.89 
-----------+----------------------+----------
         1 |    13,845         16 |    13,861 
           |      0.11       0.59 |      0.11 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,988,977      2,621 |11,991,598 
           |     99.48      96.43 |     99.48 
-----------+----------------------+----------
         1 |    63,095         97 |    63,192 
           |      0.52       3.57 |      0.52 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |       icu/death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,969,668      2,618 |11,972,286 
           |     99.32      96.32 |     99.32 
-----------+----------------------+----------
         1 |    82,404        100 |    82,504 
           |      0.68       3.68 |      0.68 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |       icu/death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,960,403      2,553 |11,962,956 
           |     99.24      93.93 |     99.24 
-----------+----------------------+----------
         1 |    91,669        165 |    91,834 
           |      0.76       6.07 |      0.76 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |       icu/death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,935         54 |     4,989 
           |      0.06       2.19 |      0.06 
-----------+----------------------+----------
        15 |     6,880         49 |     6,929 
           |      0.08       1.98 |      0.08 
-----------+----------------------+----------
        30 |    16,664         74 |    16,738 
           |      0.20       2.99 |      0.20 
-----------+----------------------+----------
        45 |   104,884        137 |   105,021 
           |      1.27       5.54 |      1.27 
-----------+----------------------+----------
        60 | 8,119,387      2,157 | 8,121,544 
           |     98.38      87.29 |     98.38 
-----------+----------------------+----------
     Total | 8,252,750      2,471 | 8,255,221 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |    outcome: covid
     renal |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,037,849      2,618 |12,040,467 
           |     99.88      96.32 |     99.88 
-----------+----------------------+----------
         1 |    14,223        100 |    14,323 
           |      0.12       3.68 |      0.12 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |       icu/death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,918,709      2,404 |11,921,113 
                      |     98.89      88.45 |     98.89 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   121,548        211 |   121,759 
                      |      1.01       7.76 |      1.01 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,815        103 |    11,918 
                      |      0.10       3.79 |      0.10 
----------------------+----------------------+----------
                Total |12,052,072      2,718 |12,054,790 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |       icu/death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,713,948      1,536 |10,715,484 
           |     88.90      56.51 |     88.89 
-----------+----------------------+----------
         1 | 1,338,124      1,182 | 1,339,306 
           |     11.10      43.49 |     11.11 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,525,938      2,510 |11,528,448 
           |     95.63      92.35 |     95.63 
-----------+----------------------+----------
         1 |   526,134        208 |   526,342 
           |      4.37       7.65 |      4.37 
-----------+----------------------+----------
     Total |12,052,072      2,718 |12,054,790 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |       icu/death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,296,123        358 | 2,296,481 
                 |     19.05      13.17 |     19.05 
-----------------+----------------------+----------
               2 | 2,407,588        432 | 2,408,020 
                 |     19.98      15.89 |     19.98 
-----------------+----------------------+----------
               3 | 2,475,731        505 | 2,476,236 
                 |     20.54      18.58 |     20.54 
-----------------+----------------------+----------
               4 | 2,559,417        713 | 2,560,130 
                 |     21.24      26.23 |     21.24 
-----------------+----------------------+----------
 5 most deprived | 2,313,213        710 | 2,313,923 
                 |     19.19      26.12 |     19.20 
-----------------+----------------------+----------
           Total |12,052,072      2,718 |12,054,790 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |       icu/death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,566,965      1,449 | 7,568,414 
                      |     62.79      53.31 |     62.78 
----------------------+----------------------+----------
                Mixed |   158,153         58 |   158,211 
                      |      1.31       2.13 |      1.31 
----------------------+----------------------+----------
Asian or Asian Britis |   832,771        407 |   833,178 
                      |      6.91      14.97 |      6.91 
----------------------+----------------------+----------
                Black |   306,144        198 |   306,342 
                      |      2.54       7.28 |      2.54 
----------------------+----------------------+----------
                Other |   290,418         87 |   290,505 
                      |      2.41       3.20 |      2.41 
----------------------+----------------------+----------
              Unknown | 2,897,621        519 | 2,898,140 
                      |     24.04      19.09 |     24.04 
----------------------+----------------------+----------
                Total |12,052,072      2,718 |12,054,790 
                      |    100.00     100.00 |    100.00 
20

**TABLE OF stp covid_death_icu REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,844,977        193 | 2,845,170 
           |     23.62       1.88 |     23.60 
-----------+----------------------+----------
    30-<40 | 2,767,642        462 | 2,768,104 
           |     22.98       4.49 |     22.96 
-----------+----------------------+----------
    40-<50 | 2,494,046      1,465 | 2,495,511 
           |     20.71      14.24 |     20.70 
-----------+----------------------+----------
    50-<60 | 2,620,972      3,954 | 2,624,926 
           |     21.76      38.43 |     21.77 
-----------+----------------------+----------
    60-<70 | 1,316,863      4,216 | 1,321,079 
           |     10.93      40.97 |     10.96 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,004,866      4,275 | 6,009,141 
           |     49.86      41.55 |     49.85 
-----------+----------------------+----------
         1 | 6,039,634      6,015 | 6,045,649 
           |     50.14      58.45 |     50.15 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   223,134        552 |   223,686 
                     |      1.85       5.36 |      1.86 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,403,319      2,960 | 3,406,279 
                     |     28.26      28.77 |     28.26 
---------------------+----------------------+----------
Overweight (25-29.9) | 3,000,922      2,460 | 3,003,382 
                     |     24.92      23.91 |     24.91 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,541,743      1,507 | 1,543,250 
                     |     12.80      14.65 |     12.80 
---------------------+----------------------+----------
  Obese II (35-39.9) |   635,047        741 |   635,788 
                     |      5.27       7.20 |      5.27 
---------------------+----------------------+----------
     Obese III (40+) |   345,101        575 |   345,676 
                     |      2.87       5.59 |      2.87 
---------------------+----------------------+----------
        Unknown (.u) | 2,895,234      1,495 | 2,896,729 
                     |     24.04      14.53 |     24.03 
---------------------+----------------------+----------
               Total |12,044,500     10,290 |12,054,790 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,725,268      2,831 | 5,728,099 
             |     47.53      27.51 |     47.52 
-------------+----------------------+----------
      Former | 3,299,638      3,594 | 3,303,232 
             |     27.40      34.93 |     27.40 
-------------+----------------------+----------
     Current | 2,425,825      3,759 | 2,429,584 
             |     20.14      36.53 |     20.15 
-------------+----------------------+----------
Unknown (.u) |   593,769        106 |   593,875 
             |      4.93       1.03 |      4.93 
-------------+----------------------+----------
       Total |12,044,500     10,290 |12,054,790 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,522,609      7,467 | 9,530,076 
                     |     79.06      72.57 |     79.06 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,541,743      1,507 | 1,543,250 
                     |     12.80      14.65 |     12.80 
---------------------+----------------------+----------
  Obese II (35-39.9) |   635,047        741 |   635,788 
                     |      5.27       7.20 |      5.27 
---------------------+----------------------+----------
     Obese III (40+) |   345,101        575 |   345,676 
                     |      2.87       5.59 |      2.87 
---------------------+----------------------+----------
               Total |12,044,500     10,290 |12,054,790 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,565,094      3,601 | 9,568,695 
           |     79.41      35.00 |     79.38 
-----------+----------------------+----------
         1 | 2,479,406      6,689 | 2,486,095 
           |     20.59      65.00 |     20.62 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,817,087      8,513 |11,825,600 
           |     98.11      82.73 |     98.10 
-----------+----------------------+----------
         1 |   227,413      1,777 |   229,190 
           |      1.89      17.27 |      1.90 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |10,003,269      8,502 |10,011,771 
           |     83.05      82.62 |     83.05 
-----------+----------------------+----------
         1 | 2,041,231      1,788 | 2,043,019 
           |     16.95      17.38 |     16.95 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,711,032      8,459 |11,719,491 
           |     97.23      82.21 |     97.22 
-----------+----------------------+----------
         1 |   333,468      1,831 |   335,299 
           |      2.77      17.79 |      2.78 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: non-covid
                   |         death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |11,299,720      7,909 |11,307,629 
                   |     95.27      79.00 |     95.26 
-------------------+----------------------+----------
  T1DM, controlled |    16,358         65 |    16,423 
                   |      0.14       0.65 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    49,019        175 |    49,194 
                   |      0.41       1.75 |      0.41 
-------------------+----------------------+----------
  T2DM, controlled |   274,042        960 |   275,002 
                   |      2.31       9.59 |      2.32 
-------------------+----------------------+----------
T2DM, uncontrolled |   216,218        876 |   217,094 
                   |      1.82       8.75 |      1.83 
-------------------+----------------------+----------
Diabetes, no HbA1c |     5,456         27 |     5,483 
                   |      0.05       0.27 |      0.05 
-------------------+----------------------+----------
             Total |11,860,813     10,012 |11,870,825 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,791,309      6,617 |11,797,926 
              |     97.90      64.31 |     97.87 
--------------+----------------------+----------
    Last year |    27,214      1,391 |    28,605 
              |      0.23      13.52 |      0.24 
--------------+----------------------+----------
2-5 years ago |    80,846      1,472 |    82,318 
              |      0.67      14.31 |      0.68 
--------------+----------------------+----------
     5+ years |   145,131        810 |   145,941 
              |      1.20       7.87 |      1.21 
--------------+----------------------+----------
        Total |12,044,500     10,290 |12,054,790 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,007,026      9,971 |12,016,997 
              |     99.69      96.90 |     99.69 
--------------+----------------------+----------
    Last year |     2,971         85 |     3,056 
              |      0.02       0.83 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,394        119 |     9,513 
              |      0.08       1.16 |      0.08 
--------------+----------------------+----------
     5+ years |    25,109        115 |    25,224 
              |      0.21       1.12 |      0.21 
--------------+----------------------+----------
        Total |12,044,500     10,290 |12,054,790 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |12,005,421     10,146 |12,015,567 
           |     99.68      98.60 |     99.67 
-----------+----------------------+----------
         1 |    39,079        144 |    39,223 
           |      0.32       1.40 |      0.33 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |12,041,709     10,257 |12,051,966 
           |     99.98      99.68 |     99.98 
-----------+----------------------+----------
         1 |     2,791         33 |     2,824 
           |      0.02       0.32 |      0.02 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,030,733     10,196 |12,040,929 
           |     99.89      99.09 |     99.89 
-----------+----------------------+----------
         1 |    13,767         94 |    13,861 
           |      0.11       0.91 |      0.11 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,982,300      9,298 |11,991,598 
           |     99.48      90.36 |     99.48 
-----------+----------------------+----------
         1 |    62,200        992 |    63,192 
           |      0.52       9.64 |      0.52 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,962,422      9,864 |11,972,286 
           |     99.32      95.86 |     99.32 
-----------+----------------------+----------
         1 |    82,078        426 |    82,504 
           |      0.68       4.14 |      0.68 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,953,395      9,561 |11,962,956 
           |     99.24      92.92 |     99.24 
-----------+----------------------+----------
         1 |    91,105        729 |    91,834 
           |      0.76       7.08 |      0.76 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,816        173 |     4,989 
           |      0.06       1.84 |      0.06 
-----------+----------------------+----------
        15 |     6,763        166 |     6,929 
           |      0.08       1.77 |      0.08 
-----------+----------------------+----------
        30 |    16,506        232 |    16,738 
           |      0.20       2.47 |      0.20 
-----------+----------------------+----------
        45 |   104,548        473 |   105,021 
           |      1.27       5.04 |      1.27 
-----------+----------------------+----------
        60 | 8,113,194      8,350 | 8,121,544 
           |     98.39      88.89 |     98.38 
-----------+----------------------+----------
     Total | 8,245,827      9,394 | 8,255,221 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,030,398     10,069 |12,040,467 
           |     99.88      97.85 |     99.88 
-----------+----------------------+----------
         1 |    14,102        221 |    14,323 
           |      0.12       2.15 |      0.12 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,911,867      9,246 |11,921,113 
                      |     98.90      89.85 |     98.89 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   121,054        705 |   121,759 
                      |      1.01       6.85 |      1.01 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,579        339 |    11,918 
                      |      0.10       3.29 |      0.10 
----------------------+----------------------+----------
                Total |12,044,500     10,290 |12,054,790 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,708,707      6,777 |10,715,484 
           |     88.91      65.86 |     88.89 
-----------+----------------------+----------
         1 | 1,335,793      3,513 | 1,339,306 
           |     11.09      34.14 |     11.11 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,518,938      9,510 |11,528,448 
           |     95.64      92.42 |     95.63 
-----------+----------------------+----------
         1 |   525,562        780 |   526,342 
           |      4.36       7.58 |      4.37 
-----------+----------------------+----------
     Total |12,044,500     10,290 |12,054,790 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,295,048      1,433 | 2,296,481 
                 |     19.05      13.93 |     19.05 
-----------------+----------------------+----------
               2 | 2,406,323      1,697 | 2,408,020 
                 |     19.98      16.49 |     19.98 
-----------------+----------------------+----------
               3 | 2,474,257      1,979 | 2,476,236 
                 |     20.54      19.23 |     20.54 
-----------------+----------------------+----------
               4 | 2,557,822      2,308 | 2,560,130 
                 |     21.24      22.43 |     21.24 
-----------------+----------------------+----------
 5 most deprived | 2,311,050      2,873 | 2,313,923 
                 |     19.19      27.92 |     19.20 
-----------------+----------------------+----------
           Total |12,044,500     10,290 |12,054,790 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,561,369      7,045 | 7,568,414 
                      |     62.78      68.46 |     62.78 
----------------------+----------------------+----------
                Mixed |   158,153         58 |   158,211 
                      |      1.31       0.56 |      1.31 
----------------------+----------------------+----------
Asian or Asian Britis |   832,790        388 |   833,178 
                      |      6.91       3.77 |      6.91 
----------------------+----------------------+----------
                Black |   306,127        215 |   306,342 
                      |      2.54       2.09 |      2.54 
----------------------+----------------------+----------
                Other |   290,424         81 |   290,505 
                      |      2.41       0.79 |      2.41 
----------------------+----------------------+----------
              Unknown | 2,895,637      2,503 | 2,898,140 
                      |     24.04      24.32 |     24.04 
----------------------+----------------------+----------
                Total |12,044,500     10,290 |12,054,790 
                      |    100.00     100.00 |    100.00 
20

**TABLE OF stp non_covid_death REDACTED DUE TO SMALL N**


         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06       13              0.0000    0.0000     0.0000    0.0000
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06       28              0.0000    0.0000     0.0000    0.0000
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06       49              0.0000    0.0000     0.0000    0.0000
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06       89              0.0001    0.0000     0.0001    0.0001
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06      100              0.0001    0.0000     0.0001    0.0001
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06      230              0.0002    0.0000     0.0002    0.0002
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06      253              0.0002    0.0000     0.0002    0.0002
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06      536              0.0004    0.0000     0.0004    0.0004
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    665213      198              0.0003    0.0000     0.0003    0.0003
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    653202      432              0.0007    0.0000     0.0006    0.0007
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06       23              0.0000    0.0000     0.0000    0.0000
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06       78              0.0001    0.0000     0.0000    0.0001
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      111              0.0001    0.0000     0.0001    0.0001
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      137              0.0001    0.0000     0.0001    0.0001
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06      321              0.0003    0.0000     0.0002    0.0003
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06      404              0.0003    0.0000     0.0003    0.0003
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06      830              0.0006    0.0000     0.0006    0.0007
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     1165              0.0009    0.0000     0.0008    0.0009
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    665287      837              0.0013    0.0000     0.0012    0.0013
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    653376     1241              0.0019    0.0001     0.0018    0.0020
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      976              0.0007    0.0000     0.0006    0.0007
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      469              0.0003    0.0000     0.0003    0.0004
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06     1451              0.0011    0.0000     0.0010    0.0011
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      860              0.0006    0.0000     0.0006    0.0007
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06     1766              0.0015    0.0000     0.0014    0.0015
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     1209              0.0009    0.0000     0.0009    0.0010
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     2248              0.0017    0.0000     0.0017    0.0018
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     1973              0.0015    0.0000     0.0014    0.0016
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    662662      991              0.0015    0.0000     0.0014    0.0016
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    650244     1130              0.0017    0.0001     0.0016    0.0018
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  3,489,829    75.53668    7.086557         66        110
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |    797,869       22.86       22.86
     70-<80 |  1,729,904       49.57       72.43
        80+ |    962,056       27.57      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    205,455        5.89        5.89
          1 |  3,284,374       94.11      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,871,868       53.64       53.64
          1 |  1,617,961       46.36      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     59,559        1.87        1.87
  Normal (18.5-24.9) |    991,006       31.18       33.06
Overweight (25-29.9) |  1,239,012       38.99       72.05
   Obese I (30-34.9) |    609,753       19.19       91.23
  Obese II (35-39.9) |    200,575        6.31       97.55
     Obese III (40+) |     77,983        2.45      100.00
---------------------+-----------------------------------
               Total |  3,177,888      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     59,559        1.71        1.71
  Normal (18.5-24.9) |    991,006       28.40       30.10
Overweight (25-29.9) |  1,239,012       35.50       65.61
   Obese I (30-34.9) |    609,753       17.47       83.08
  Obese II (35-39.9) |    200,575        5.75       88.83
     Obese III (40+) |     77,983        2.23       91.06
        Unknown (.u) |    311,941        8.94      100.00
---------------------+-----------------------------------
               Total |  3,489,829      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  2,601,518       74.55       74.55
   Obese I (30-34.9) |    609,753       17.47       92.02
  Obese II (35-39.9) |    200,575        5.75       97.77
     Obese III (40+) |     77,983        2.23      100.00
---------------------+-----------------------------------
               Total |  3,489,829      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,391,736       40.12       40.12
      Former |  1,788,526       51.56       91.69
     Current |    288,328        8.31      100.00
-------------+-----------------------------------
       Total |  3,468,590      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,391,736       39.88       39.88
      Former |  1,788,526       51.25       91.13
     Current |    288,328        8.26       99.39
Unknown (.u) |     21,239        0.61      100.00
-------------+-----------------------------------
       Total |  3,489,829      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    393,715       11.38       11.38
      Elevated |    532,889       15.40       26.77
 High, stage I |  1,271,356       36.73       63.51
High, stage II |  1,262,994       36.49      100.00
---------------+-----------------------------------
         Total |  3,460,954      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    393,715       11.28       11.28
      Elevated |    532,889       15.27       26.55
 High, stage I |  1,271,356       36.43       62.98
High, stage II |  1,262,994       36.19       99.17
       Unknown |     28,875        0.83      100.00
---------------+-----------------------------------
         Total |  3,489,829      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,055,573       30.25       30.25
          1 |  2,434,256       69.75      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,287,451       65.55       65.55
          1 |  1,202,378       34.45      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,076,599       88.16       88.16
          1 |    413,230       11.84      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,037,098       87.03       87.03
          1 |    452,731       12.97      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,761,710       79.14       79.14
          1 |    728,119       20.86      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |  2,707,793       81.33       81.33
  T1DM, controlled |      4,559        0.14       81.46
T1DM, uncontrolled |      9,411        0.28       81.75
  T2DM, controlled |    416,800       12.52       94.26
T2DM, uncontrolled |    188,459        5.66       99.92
Diabetes, no HbA1c |      2,506        0.08      100.00
-------------------+-----------------------------------
             Total |  3,329,528      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  2,991,080       85.71       85.71
    Last year |     41,833        1.20       86.91
2-5 years ago |    124,197        3.56       90.47
     5+ years |    332,719        9.53      100.00
--------------+-----------------------------------
        Total |  3,489,829      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  3,438,436       98.53       98.53
    Last year |      4,958        0.14       98.67
2-5 years ago |     15,342        0.44       99.11
     5+ years |     31,093        0.89      100.00
--------------+-----------------------------------
        Total |  3,489,829      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,483,012       99.80       99.80
          1 |      6,817        0.20      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,488,702       99.97       99.97
          1 |      1,127        0.03      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,481,242       99.75       99.75
          1 |      8,587        0.25      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,457,690       99.08       99.08
          1 |     32,139        0.92      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,421,356       98.04       98.04
          1 |     68,473        1.96      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,231,828       92.61       92.61
          1 |    258,001        7.39      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,107        0.25        0.25
         15 |     47,293        1.43        1.68
         30 |    203,176        6.16        7.84
         45 |    551,793       16.72       24.56
         60 |  2,489,207       75.44      100.00
------------+-----------------------------------
      Total |  3,299,576      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |  2,679,460       76.78       76.78
Stage 3a/3b egfr 30-60       |    754,969       21.63       98.41
           Stage 4/5 egfr<30 |     55,400        1.59      100.00
-----------------------------+-----------------------------------
                       Total |  3,489,829      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,481,193       99.75       99.75
          1 |      8,636        0.25      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,548,492       44.37       44.37
          1 |  1,941,337       55.63      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,224,210       92.39       92.39
          1 |    265,619        7.61      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    873,864       25.04       25.04
               2 |    824,723       23.63       48.67
               3 |    749,221       21.47       70.14
               4 |    609,457       17.46       87.61
 5 most deprived |    432,564       12.39      100.00
-----------------+-----------------------------------
           Total |  3,489,829      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    873,864       25.04       25.04
               2 |    824,723       23.63       48.67
               3 |    749,221       21.47       70.14
               4 |    609,457       17.46       87.61
 5 most deprived |    432,564       12.39      100.00
-----------------+-----------------------------------
           Total |  3,489,829      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,418,927       94.22       94.22
                 Mixed |      9,775        0.38       94.60
Asian or Asian British |     90,164        3.51       98.11
                 Black |     27,280        1.06       99.17
                 Other |     21,306        0.83      100.00
-----------------------+-----------------------------------
                 Total |  2,567,452      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,418,927       69.31       69.31
                 Mixed |      9,775        0.28       69.59
Asian or Asian British |     90,164        2.58       72.18
                 Black |     27,280        0.78       72.96
                 Other |     21,306        0.61       73.57
               Unknown |    922,377       26.43      100.00
-----------------------+-----------------------------------
                 Total |  3,489,829      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        326        0.01        0.01
          2 |    288,061        8.25        8.26
          3 |    156,042        4.47       12.73
          4 |     34,260        0.98       13.72
          5 |     23,736        0.68       14.40
          6 |    162,281        4.65       19.05
          7 |      9,359        0.27       19.32
          8 |    136,985        3.93       23.24
          9 |    129,034        3.70       26.94
         10 |    141,974        4.07       31.01
         11 |    142,833        4.09       35.10
         12 |     38,803        1.11       36.21
         13 |     68,560        1.96       38.18
         14 |     85,051        2.44       40.61
         15 |    111,820        3.20       43.82
         16 |    165,848        4.75       48.57
         17 |    123,412        3.54       52.11
         18 |    125,645        3.60       55.71
         19 |    111,888        3.21       58.91
         20 |    180,469        5.17       64.08
         21 |    134,611        3.86       67.94
         22 |      9,422        0.27       68.21
         23 |    152,809        4.38       72.59
         24 |      8,140        0.23       72.82
         25 |     45,683        1.31       74.13
         26 |    152,040        4.36       78.49
         27 |    147,260        4.22       82.71
         28 |    150,597        4.32       87.02
         29 |     97,776        2.80       89.82
         30 |     81,201        2.33       92.15
         31 |      4,912        0.14       92.29
         32 |    268,991        7.71      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,436,629       98.48       98.48
          1 |     53,200        1.52      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,481,254       99.75       99.75
          1 |      8,575        0.25      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,474,198       99.55       99.55
          1 |     15,631        0.45      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
      covid |
  icu/death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,480,899       99.74       99.74
          1 |      8,930        0.26      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,488,958       99.98       99.98
          1 |        871        0.02      100.00
------------+-----------------------------------
      Total |  3,489,829      100.00
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   795,597      2,272 |   797,869 
           |     22.90      14.54 |     22.86 
-----------+----------------------+----------
    70-<80 | 1,723,888      6,016 | 1,729,904 
           |     49.62      38.49 |     49.57 
-----------+----------------------+----------
       80+ |   954,713      7,343 |   962,056 
           |     27.48      46.98 |     27.57 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,864,202      7,666 | 1,871,868 
           |     53.66      49.04 |     53.64 
-----------+----------------------+----------
         1 | 1,609,996      7,965 | 1,617,961 
           |     46.34      50.96 |     46.36 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    58,961        598 |    59,559 
                     |      1.70       3.83 |      1.71 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   986,501      4,505 |   991,006 
                     |     28.40      28.82 |     28.40 
---------------------+----------------------+----------
Overweight (25-29.9) | 1,234,009      5,003 | 1,239,012 
                     |     35.52      32.01 |     35.50 
---------------------+----------------------+----------
   Obese I (30-34.9) |   606,838      2,915 |   609,753 
                     |     17.47      18.65 |     17.47 
---------------------+----------------------+----------
  Obese II (35-39.9) |   199,475      1,100 |   200,575 
                     |      5.74       7.04 |      5.75 
---------------------+----------------------+----------
     Obese III (40+) |    77,443        540 |    77,983 
                     |      2.23       3.45 |      2.23 
---------------------+----------------------+----------
        Unknown (.u) |   310,971        970 |   311,941 
                     |      8.95       6.21 |      8.94 
---------------------+----------------------+----------
               Total | 3,474,198     15,631 | 3,489,829 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,386,580      5,156 | 1,391,736 
             |     39.91      32.99 |     39.88 
-------------+----------------------+----------
      Former | 1,779,227      9,299 | 1,788,526 
             |     51.21      59.49 |     51.25 
-------------+----------------------+----------
     Current |   287,203      1,125 |   288,328 
             |      8.27       7.20 |      8.26 
-------------+----------------------+----------
Unknown (.u) |    21,188         51 |    21,239 
             |      0.61       0.33 |      0.61 
-------------+----------------------+----------
       Total | 3,474,198     15,631 | 3,489,829 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 2,590,442     11,076 | 2,601,518 
                     |     74.56      70.86 |     74.55 
---------------------+----------------------+----------
   Obese I (30-34.9) |   606,838      2,915 |   609,753 
                     |     17.47      18.65 |     17.47 
---------------------+----------------------+----------
  Obese II (35-39.9) |   199,475      1,100 |   200,575 
                     |      5.74       7.04 |      5.75 
---------------------+----------------------+----------
     Obese III (40+) |    77,443        540 |    77,983 
                     |      2.23       3.45 |      2.23 
---------------------+----------------------+----------
               Total | 3,474,198     15,631 | 3,489,829 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,279,947      7,504 | 2,287,451 
           |     65.63      48.01 |     65.55 
-----------+----------------------+----------
         1 | 1,194,251      8,127 | 1,202,378 
           |     34.37      51.99 |     34.45 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,064,857     11,742 | 3,076,599 
           |     88.22      75.12 |     88.16 
-----------+----------------------+----------
         1 |   409,341      3,889 |   413,230 
           |     11.78      24.88 |     11.84 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,024,189     12,909 | 3,037,098 
           |     87.05      82.59 |     87.03 
-----------+----------------------+----------
         1 |   450,009      2,722 |   452,731 
           |     12.95      17.41 |     12.97 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,751,903      9,807 | 2,761,710 
           |     79.21      62.74 |     79.14 
-----------+----------------------+----------
         1 |   722,295      5,824 |   728,119 
           |     20.79      37.26 |     20.86 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: covid prob
                   |         case
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,697,803      9,990 | 2,707,793 
                   |     81.39      67.59 |     81.33 
-------------------+----------------------+----------
  T1DM, controlled |     4,521         38 |     4,559 
                   |      0.14       0.26 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |     9,315         96 |     9,411 
                   |      0.28       0.65 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   413,791      3,009 |   416,800 
                   |     12.48      20.36 |     12.52 
-------------------+----------------------+----------
T2DM, uncontrolled |   186,838      1,621 |   188,459 
                   |      5.64      10.97 |      5.66 
-------------------+----------------------+----------
Diabetes, no HbA1c |     2,479         27 |     2,506 
                   |      0.07       0.18 |      0.08 
-------------------+----------------------+----------
             Total | 3,314,747     14,781 | 3,329,528 
                   |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,978,355     12,725 | 2,991,080 
              |     85.73      81.41 |     85.71 
--------------+----------------------+----------
    Last year |    41,498        335 |    41,833 
              |      1.19       2.14 |      1.20 
--------------+----------------------+----------
2-5 years ago |   123,493        704 |   124,197 
              |      3.55       4.50 |      3.56 
--------------+----------------------+----------
     5+ years |   330,852      1,867 |   332,719 
              |      9.52      11.94 |      9.53 
--------------+----------------------+----------
        Total | 3,474,198     15,631 | 3,489,829 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 3,423,314     15,122 | 3,438,436 
              |     98.54      96.74 |     98.53 
--------------+----------------------+----------
    Last year |     4,877         81 |     4,958 
              |      0.14       0.52 |      0.14 
--------------+----------------------+----------
2-5 years ago |    15,184        158 |    15,342 
              |      0.44       1.01 |      0.44 
--------------+----------------------+----------
     5+ years |    30,823        270 |    31,093 
              |      0.89       1.73 |      0.89 
--------------+----------------------+----------
        Total | 3,474,198     15,631 | 3,489,829 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,467,448     15,564 | 3,483,012 
           |     99.81      99.57 |     99.80 
-----------+----------------------+----------
         1 |     6,750         67 |     6,817 
           |      0.19       0.43 |      0.20 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,473,088     15,614 | 3,488,702 
           |     99.97      99.89 |     99.97 
-----------+----------------------+----------
         1 |     1,110         17 |     1,127 
           |      0.03       0.11 |      0.03 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,465,670     15,572 | 3,481,242 
           |     99.75      99.62 |     99.75 
-----------+----------------------+----------
         1 |     8,528         59 |     8,587 
           |      0.25       0.38 |      0.25 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,442,345     15,345 | 3,457,690 
           |     99.08      98.17 |     99.08 
-----------+----------------------+----------
         1 |    31,853        286 |    32,139 
           |      0.92       1.83 |      0.92 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,406,474     14,882 | 3,421,356 
           |     98.05      95.21 |     98.04 
-----------+----------------------+----------
         1 |    67,724        749 |    68,473 
           |      1.95       4.79 |      1.96 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,218,909     12,919 | 3,231,828 
           |     92.65      82.65 |     92.61 
-----------+----------------------+----------
         1 |   255,289      2,712 |   258,001 
           |      7.35      17.35 |      7.39 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,858        249 |     8,107 
           |      0.24       1.64 |      0.25 
-----------+----------------------+----------
        15 |    46,650        643 |    47,293 
           |      1.42       4.24 |      1.43 
-----------+----------------------+----------
        30 |   201,322      1,854 |   203,176 
           |      6.13      12.22 |      6.16 
-----------+----------------------+----------
        45 |   548,658      3,135 |   551,793 
           |     16.70      20.66 |     16.72 
-----------+----------------------+----------
        60 | 2,479,911      9,296 | 2,489,207 
           |     75.51      61.25 |     75.44 
-----------+----------------------+----------
     Total | 3,284,399     15,177 | 3,299,576 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,465,810     15,383 | 3,481,193 
           |     99.76      98.41 |     99.75 
-----------+----------------------+----------
         1 |     8,388        248 |     8,636 
           |      0.24       1.59 |      0.25 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,669,710      9,750 | 2,679,460 
                      |     76.84      62.38 |     76.78 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   749,980      4,989 |   754,969 
                      |     21.59      31.92 |     21.63 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    54,508        892 |    55,400 
                      |      1.57       5.71 |      1.59 
----------------------+----------------------+----------
                Total | 3,474,198     15,631 | 3,489,829 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,543,417      5,075 | 1,548,492 
           |     44.43      32.47 |     44.37 
-----------+----------------------+----------
         1 | 1,930,781     10,556 | 1,941,337 
           |     55.57      67.53 |     55.63 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,210,233     13,977 | 3,224,210 
           |     92.40      89.42 |     92.39 
-----------+----------------------+----------
         1 |   263,965      1,654 |   265,619 
           |      7.60      10.58 |      7.61 
-----------+----------------------+----------
     Total | 3,474,198     15,631 | 3,489,829 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   870,832      3,032 |   873,864 
                 |     25.07      19.40 |     25.04 
-----------------+----------------------+----------
               2 |   821,463      3,260 |   824,723 
                 |     23.64      20.86 |     23.63 
-----------------+----------------------+----------
               3 |   746,036      3,185 |   749,221 
                 |     21.47      20.38 |     21.47 
-----------------+----------------------+----------
               4 |   606,159      3,298 |   609,457 
                 |     17.45      21.10 |     17.46 
-----------------+----------------------+----------
 5 most deprived |   429,708      2,856 |   432,564 
                 |     12.37      18.27 |     12.39 
-----------------+----------------------+----------
           Total | 3,474,198     15,631 | 3,489,829 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,408,425     10,502 | 2,418,927 
                      |     69.32      67.19 |     69.31 
----------------------+----------------------+----------
                Mixed |     9,721         54 |     9,775 
                      |      0.28       0.35 |      0.28 
----------------------+----------------------+----------
Asian or Asian Britis |    89,387        777 |    90,164 
                      |      2.57       4.97 |      2.58 
----------------------+----------------------+----------
                Black |    27,055        225 |    27,280 
                      |      0.78       1.44 |      0.78 
----------------------+----------------------+----------
                Other |    21,195        111 |    21,306 
                      |      0.61       0.71 |      0.61 
----------------------+----------------------+----------
              Unknown |   918,415      3,962 |   922,377 
                      |     26.44      25.35 |     26.43 
----------------------+----------------------+----------
                Total | 3,474,198     15,631 | 3,489,829 
                      |    100.00     100.00 |    100.00 
19

**TABLE OF stp covid_tpp_prob REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
   Grouped |       icu/death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   797,151        718 |   797,869 
           |     22.90       8.04 |     22.86 
-----------+----------------------+----------
    70-<80 | 1,727,147      2,757 | 1,729,904 
           |     49.62      30.87 |     49.57 
-----------+----------------------+----------
       80+ |   956,601      5,455 |   962,056 
           |     27.48      61.09 |     27.57 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,868,239      3,629 | 1,871,868 
           |     53.67      40.64 |     53.64 
-----------+----------------------+----------
         1 | 1,612,660      5,301 | 1,617,961 
           |     46.33      59.36 |     46.36 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
                     |       icu/death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    59,208        351 |    59,559 
                     |      1.70       3.93 |      1.71 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   988,374      2,632 |   991,006 
                     |     28.39      29.47 |     28.40 
---------------------+----------------------+----------
Overweight (25-29.9) | 1,236,352      2,660 | 1,239,012 
                     |     35.52      29.79 |     35.50 
---------------------+----------------------+----------
   Obese I (30-34.9) |   608,162      1,591 |   609,753 
                     |     17.47      17.82 |     17.47 
---------------------+----------------------+----------
  Obese II (35-39.9) |   199,922        653 |   200,575 
                     |      5.74       7.31 |      5.75 
---------------------+----------------------+----------
     Obese III (40+) |    77,688        295 |    77,983 
                     |      2.23       3.30 |      2.23 
---------------------+----------------------+----------
        Unknown (.u) |   311,193        748 |   311,941 
                     |      8.94       8.38 |      8.94 
---------------------+----------------------+----------
               Total | 3,480,899      8,930 | 3,489,829 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: covid
     Smoking |       icu/death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,389,062      2,674 | 1,391,736 
             |     39.91      29.94 |     39.88 
-------------+----------------------+----------
      Former | 1,782,900      5,626 | 1,788,526 
             |     51.22      63.00 |     51.25 
-------------+----------------------+----------
     Current |   287,739        589 |   288,328 
             |      8.27       6.60 |      8.26 
-------------+----------------------+----------
Unknown (.u) |    21,198         41 |    21,239 
             |      0.61       0.46 |      0.61 
-------------+----------------------+----------
       Total | 3,480,899      8,930 | 3,489,829 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |    outcome: covid
 Evidence of obesity |       icu/death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 2,595,127      6,391 | 2,601,518 
                     |     74.55      71.57 |     74.55 
---------------------+----------------------+----------
   Obese I (30-34.9) |   608,162      1,591 |   609,753 
                     |     17.47      17.82 |     17.47 
---------------------+----------------------+----------
  Obese II (35-39.9) |   199,922        653 |   200,575 
                     |      5.74       7.31 |      5.75 
---------------------+----------------------+----------
     Obese III (40+) |    77,688        295 |    77,983 
                     |      2.23       3.30 |      2.23 
---------------------+----------------------+----------
               Total | 3,480,899      8,930 | 3,489,829 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
  Probable |       icu/death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,283,043      4,408 | 2,287,451 
           |     65.59      49.36 |     65.55 
-----------+----------------------+----------
         1 | 1,197,856      4,522 | 1,202,378 
           |     34.41      50.64 |     34.45 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
Respirator |       icu/death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,069,859      6,740 | 3,076,599 
           |     88.19      75.48 |     88.16 
-----------+----------------------+----------
         1 |   411,040      2,190 |   413,230 
           |     11.81      24.52 |     11.84 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
    Asthma |       icu/death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,029,521      7,577 | 3,037,098 
           |     87.03      84.85 |     87.03 
-----------+----------------------+----------
         1 |   451,378      1,353 |   452,731 
           |     12.97      15.15 |     12.97 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
   Cardiac |       icu/death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,756,477      5,233 | 2,761,710 
           |     79.19      58.60 |     79.14 
-----------+----------------------+----------
         1 |   724,422      3,697 |   728,119 
           |     20.81      41.40 |     20.86 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |    outcome: covid
                   |       icu/death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,702,361      5,432 | 2,707,793 
                   |     81.37      64.21 |     81.33 
-------------------+----------------------+----------
  T1DM, controlled |     4,537         22 |     4,559 
                   |      0.14       0.26 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |     9,344         67 |     9,411 
                   |      0.28       0.79 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   414,966      1,834 |   416,800 
                   |     12.49      21.68 |     12.52 
-------------------+----------------------+----------
T2DM, uncontrolled |   187,372      1,087 |   188,459 
                   |      5.64      12.85 |      5.66 
-------------------+----------------------+----------
Diabetes, no HbA1c |     2,488         18 |     2,506 
                   |      0.07       0.21 |      0.08 
-------------------+----------------------+----------
             Total | 3,321,068      8,460 | 3,329,528 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Non-haematolo |       icu/death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,983,871      7,209 | 2,991,080 
              |     85.72      80.73 |     85.71 
--------------+----------------------+----------
    Last year |    41,597        236 |    41,833 
              |      1.20       2.64 |      1.20 
--------------+----------------------+----------
2-5 years ago |   123,786        411 |   124,197 
              |      3.56       4.60 |      3.56 
--------------+----------------------+----------
     5+ years |   331,645      1,074 |   332,719 
              |      9.53      12.03 |      9.53 
--------------+----------------------+----------
        Total | 3,480,899      8,930 | 3,489,829 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |    outcome: covid
Haematologica |       icu/death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 3,429,818      8,618 | 3,438,436 
              |     98.53      96.51 |     98.53 
--------------+----------------------+----------
    Last year |     4,910         48 |     4,958 
              |      0.14       0.54 |      0.14 
--------------+----------------------+----------
2-5 years ago |    15,231        111 |    15,342 
              |      0.44       1.24 |      0.44 
--------------+----------------------+----------
     5+ years |    30,940        153 |    31,093 
              |      0.89       1.71 |      0.89 
--------------+----------------------+----------
        Total | 3,480,899      8,930 | 3,489,829 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |    outcome: covid
        on |       icu/death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,474,118      8,894 | 3,483,012 
           |     99.81      99.60 |     99.80 
-----------+----------------------+----------
         1 |     6,781         36 |     6,817 
           |      0.19       0.40 |      0.20 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |    outcome: covid
     organ |       icu/death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,479,783      8,919 | 3,488,702 
           |     99.97      99.88 |     99.97 
-----------+----------------------+----------
         1 |     1,116         11 |     1,127 
           |      0.03       0.12 |      0.03 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
           |       icu/death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,472,339      8,903 | 3,481,242 
           |     99.75      99.70 |     99.75 
-----------+----------------------+----------
         1 |     8,560         27 |     8,587 
           |      0.25       0.30 |      0.25 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |    outcome: covid
     liver |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,448,930      8,760 | 3,457,690 
           |     99.08      98.10 |     99.08 
-----------+----------------------+----------
         1 |    31,969        170 |    32,139 
           |      0.92       1.90 |      0.92 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Neurologic |       icu/death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,412,942      8,414 | 3,421,356 
           |     98.05      94.22 |     98.04 
-----------+----------------------+----------
         1 |    67,957        516 |    68,473 
           |      1.95       5.78 |      1.96 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
 Stroke or |       icu/death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,224,693      7,135 | 3,231,828 
           |     92.64      79.90 |     92.61 
-----------+----------------------+----------
         1 |   256,206      1,795 |   258,001 
           |      7.36      20.10 |      7.39 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Calculated |       icu/death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,907        200 |     8,107 
           |      0.24       2.30 |      0.25 
-----------+----------------------+----------
        15 |    46,695        598 |    47,293 
           |      1.42       6.86 |      1.43 
-----------+----------------------+----------
        30 |   201,737      1,439 |   203,176 
           |      6.13      16.51 |      6.16 
-----------+----------------------+----------
        45 |   549,795      1,998 |   551,793 
           |     16.71      22.93 |     16.72 
-----------+----------------------+----------
        60 | 2,484,728      4,479 | 2,489,207 
           |     75.50      51.40 |     75.44 
-----------+----------------------+----------
     Total | 3,290,862      8,714 | 3,299,576 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |    outcome: covid
     renal |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,472,425      8,768 | 3,481,193 
           |     99.76      98.19 |     99.75 
-----------+----------------------+----------
         1 |     8,474        162 |     8,636 
           |      0.24       1.81 |      0.25 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
       Reduced kidney |       icu/death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,674,765      4,695 | 2,679,460 
                      |     76.84      52.58 |     76.78 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   751,532      3,437 |   754,969 
                      |     21.59      38.49 |     21.63 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    54,602        798 |    55,400 
                      |      1.57       8.94 |      1.59 
----------------------+----------------------+----------
                Total | 3,480,899      8,930 | 3,489,829 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |    outcome: covid
hypertensi |       icu/death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,545,821      2,671 | 1,548,492 
           |     44.41      29.91 |     44.37 
-----------+----------------------+----------
         1 | 1,935,078      6,259 | 1,941,337 
           |     55.59      70.09 |     55.63 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Autoimmune |       icu/death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,216,148      8,062 | 3,224,210 
           |     92.39      90.28 |     92.39 
-----------+----------------------+----------
         1 |   264,751        868 |   265,619 
           |      7.61       9.72 |      7.61 
-----------+----------------------+----------
     Total | 3,480,899      8,930 | 3,489,829 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |    outcome: covid
     Deprivation |       icu/death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   872,174      1,690 |   873,864 
                 |     25.06      18.92 |     25.04 
-----------------+----------------------+----------
               2 |   822,914      1,809 |   824,723 
                 |     23.64      20.26 |     23.63 
-----------------+----------------------+----------
               3 |   747,400      1,821 |   749,221 
                 |     21.47      20.39 |     21.47 
-----------------+----------------------+----------
               4 |   607,594      1,863 |   609,457 
                 |     17.46      20.86 |     17.46 
-----------------+----------------------+----------
 5 most deprived |   430,817      1,747 |   432,564 
                 |     12.38      19.56 |     12.39 
-----------------+----------------------+----------
           Total | 3,480,899      8,930 | 3,489,829 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |    outcome: covid
                      |       icu/death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,413,018      5,909 | 2,418,927 
                      |     69.32      66.17 |     69.31 
----------------------+----------------------+----------
                Mixed |     9,739         36 |     9,775 
                      |      0.28       0.40 |      0.28 
----------------------+----------------------+----------
Asian or Asian Britis |    89,691        473 |    90,164 
                      |      2.58       5.30 |      2.58 
----------------------+----------------------+----------
                Black |    27,128        152 |    27,280 
                      |      0.78       1.70 |      0.78 
----------------------+----------------------+----------
                Other |    21,241         65 |    21,306 
                      |      0.61       0.73 |      0.61 
----------------------+----------------------+----------
              Unknown |   920,082      2,295 |   922,377 
                      |     26.43      25.70 |     26.43 
----------------------+----------------------+----------
                Total | 3,480,899      8,930 | 3,489,829 
                      |    100.00     100.00 |    100.00 
20

**TABLE OF stp covid_death_icu REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   793,906      3,963 |   797,869 
           |     23.10       7.45 |     22.86 
-----------+----------------------+----------
    70-<80 | 1,713,536     16,368 | 1,729,904 
           |     49.86      30.77 |     49.57 
-----------+----------------------+----------
       80+ |   929,187     32,869 |   962,056 
           |     27.04      61.78 |     27.57 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,845,914     25,954 | 1,871,868 
           |     53.71      48.79 |     53.64 
-----------+----------------------+----------
         1 | 1,590,715     27,246 | 1,617,961 
           |     46.29      51.21 |     46.36 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    56,130      3,429 |    59,559 
                     |      1.63       6.45 |      1.71 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   971,754     19,252 |   991,006 
                     |     28.28      36.19 |     28.40 
---------------------+----------------------+----------
Overweight (25-29.9) | 1,224,263     14,749 | 1,239,012 
                     |     35.62      27.72 |     35.50 
---------------------+----------------------+----------
   Obese I (30-34.9) |   602,875      6,878 |   609,753 
                     |     17.54      12.93 |     17.47 
---------------------+----------------------+----------
  Obese II (35-39.9) |   198,069      2,506 |   200,575 
                     |      5.76       4.71 |      5.75 
---------------------+----------------------+----------
     Obese III (40+) |    76,842      1,141 |    77,983 
                     |      2.24       2.14 |      2.23 
---------------------+----------------------+----------
        Unknown (.u) |   306,696      5,245 |   311,941 
                     |      8.92       9.86 |      8.94 
---------------------+----------------------+----------
               Total | 3,436,629     53,200 | 3,489,829 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,375,371     16,365 | 1,391,736 
             |     40.02      30.76 |     39.88 
-------------+----------------------+----------
      Former | 1,757,896     30,630 | 1,788,526 
             |     51.15      57.58 |     51.25 
-------------+----------------------+----------
     Current |   282,336      5,992 |   288,328 
             |      8.22      11.26 |      8.26 
-------------+----------------------+----------
Unknown (.u) |    21,026        213 |    21,239 
             |      0.61       0.40 |      0.61 
-------------+----------------------+----------
       Total | 3,436,629     53,200 | 3,489,829 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 2,558,843     42,675 | 2,601,518 
                     |     74.46      80.22 |     74.55 
---------------------+----------------------+----------
   Obese I (30-34.9) |   602,875      6,878 |   609,753 
                     |     17.54      12.93 |     17.47 
---------------------+----------------------+----------
  Obese II (35-39.9) |   198,069      2,506 |   200,575 
                     |      5.76       4.71 |      5.75 
---------------------+----------------------+----------
     Obese III (40+) |    76,842      1,141 |    77,983 
                     |      2.24       2.14 |      2.23 
---------------------+----------------------+----------
               Total | 3,436,629     53,200 | 3,489,829 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,267,211     20,240 | 2,287,451 
           |     65.97      38.05 |     65.55 
-----------+----------------------+----------
         1 | 1,169,418     32,960 | 1,202,378 
           |     34.03      61.95 |     34.45 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,036,810     39,789 | 3,076,599 
           |     88.37      74.79 |     88.16 
-----------+----------------------+----------
         1 |   399,819     13,411 |   413,230 
           |     11.63      25.21 |     11.84 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,990,711     46,387 | 3,037,098 
           |     87.02      87.19 |     87.03 
-----------+----------------------+----------
         1 |   445,918      6,813 |   452,731 
           |     12.98      12.81 |     12.97 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,730,674     31,036 | 2,761,710 
           |     79.46      58.34 |     79.14 
-----------+----------------------+----------
         1 |   705,955     22,164 |   728,119 
           |     20.54      41.66 |     20.86 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: non-covid
                   |         death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,671,377     36,416 | 2,707,793 
                   |     81.47      71.75 |     81.33 
-------------------+----------------------+----------
  T1DM, controlled |     4,426        133 |     4,559 
                   |      0.13       0.26 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |     9,119        292 |     9,411 
                   |      0.28       0.58 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   407,389      9,411 |   416,800 
                   |     12.43      18.54 |     12.52 
-------------------+----------------------+----------
T2DM, uncontrolled |   184,036      4,423 |   188,459 
                   |      5.61       8.71 |      5.66 
-------------------+----------------------+----------
Diabetes, no HbA1c |     2,425         81 |     2,506 
                   |      0.07       0.16 |      0.08 
-------------------+----------------------+----------
             Total | 3,278,772     50,756 | 3,329,528 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,955,007     36,073 | 2,991,080 
              |     85.99      67.81 |     85.71 
--------------+----------------------+----------
    Last year |    37,590      4,243 |    41,833 
              |      1.09       7.98 |      1.20 
--------------+----------------------+----------
2-5 years ago |   119,329      4,868 |   124,197 
              |      3.47       9.15 |      3.56 
--------------+----------------------+----------
     5+ years |   324,703      8,016 |   332,719 
              |      9.45      15.07 |      9.53 
--------------+----------------------+----------
        Total | 3,436,629     53,200 | 3,489,829 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 3,387,357     51,079 | 3,438,436 
              |     98.57      96.01 |     98.53 
--------------+----------------------+----------
    Last year |     4,536        422 |     4,958 
              |      0.13       0.79 |      0.14 
--------------+----------------------+----------
2-5 years ago |    14,656        686 |    15,342 
              |      0.43       1.29 |      0.44 
--------------+----------------------+----------
     5+ years |    30,080      1,013 |    31,093 
              |      0.88       1.90 |      0.89 
--------------+----------------------+----------
        Total | 3,436,629     53,200 | 3,489,829 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,430,064     52,948 | 3,483,012 
           |     99.81      99.53 |     99.80 
-----------+----------------------+----------
         1 |     6,565        252 |     6,817 
           |      0.19       0.47 |      0.20 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,435,540     53,162 | 3,488,702 
           |     99.97      99.93 |     99.97 
-----------+----------------------+----------
         1 |     1,089         38 |     1,127 
           |      0.03       0.07 |      0.03 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,428,282     52,960 | 3,481,242 
           |     99.76      99.55 |     99.75 
-----------+----------------------+----------
         1 |     8,347        240 |     8,587 
           |      0.24       0.45 |      0.25 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,405,759     51,931 | 3,457,690 
           |     99.10      97.61 |     99.08 
-----------+----------------------+----------
         1 |    30,870      1,269 |    32,139 
           |      0.90       2.39 |      0.92 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,370,716     50,640 | 3,421,356 
           |     98.08      95.19 |     98.04 
-----------+----------------------+----------
         1 |    65,913      2,560 |    68,473 
           |      1.92       4.81 |      1.96 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,189,041     42,787 | 3,231,828 
           |     92.80      80.43 |     92.61 
-----------+----------------------+----------
         1 |   247,588     10,413 |   258,001 
           |      7.20      19.57 |      7.39 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,144        963 |     8,107 
           |      0.22       1.87 |      0.25 
-----------+----------------------+----------
        15 |    43,668      3,625 |    47,293 
           |      1.34       7.02 |      1.43 
-----------+----------------------+----------
        30 |   195,009      8,167 |   203,176 
           |      6.00      15.82 |      6.16 
-----------+----------------------+----------
        45 |   540,608     11,185 |   551,793 
           |     16.64      21.67 |     16.72 
-----------+----------------------+----------
        60 | 2,461,527     27,680 | 2,489,207 
           |     75.79      53.62 |     75.44 
-----------+----------------------+----------
     Total | 3,247,956     51,620 | 3,299,576 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,428,591     52,602 | 3,481,193 
           |     99.77      98.88 |     99.75 
-----------+----------------------+----------
         1 |     8,038        598 |     8,636 
           |      0.23       1.12 |      0.25 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,650,200     29,260 | 2,679,460 
                      |     77.12      55.00 |     76.78 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   735,617     19,352 |   754,969 
                      |     21.41      36.38 |     21.63 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    50,812      4,588 |    55,400 
                      |      1.48       8.62 |      1.59 
----------------------+----------------------+----------
                Total | 3,436,629     53,200 | 3,489,829 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,531,689     16,803 | 1,548,492 
           |     44.57      31.58 |     44.37 
-----------+----------------------+----------
         1 | 1,904,940     36,397 | 1,941,337 
           |     55.43      68.42 |     55.63 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,175,789     48,421 | 3,224,210 
           |     92.41      91.02 |     92.39 
-----------+----------------------+----------
         1 |   260,840      4,779 |   265,619 
           |      7.59       8.98 |      7.61 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   862,798     11,066 |   873,864 
                 |     25.11      20.80 |     25.04 
-----------------+----------------------+----------
               2 |   813,117     11,606 |   824,723 
                 |     23.66      21.82 |     23.63 
-----------------+----------------------+----------
               3 |   737,802     11,419 |   749,221 
                 |     21.47      21.46 |     21.47 
-----------------+----------------------+----------
               4 |   599,109     10,348 |   609,457 
                 |     17.43      19.45 |     17.46 
-----------------+----------------------+----------
 5 most deprived |   423,803      8,761 |   432,564 
                 |     12.33      16.47 |     12.39 
-----------------+----------------------+----------
           Total | 3,436,629     53,200 | 3,489,829 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,383,268     35,659 | 2,418,927 
                      |     69.35      67.03 |     69.31 
----------------------+----------------------+----------
                Mixed |     9,661        114 |     9,775 
                      |      0.28       0.21 |      0.28 
----------------------+----------------------+----------
Asian or Asian Britis |    89,003      1,161 |    90,164 
                      |      2.59       2.18 |      2.58 
----------------------+----------------------+----------
                Black |    26,916        364 |    27,280 
                      |      0.78       0.68 |      0.78 
----------------------+----------------------+----------
                Other |    21,114        192 |    21,306 
                      |      0.61       0.36 |      0.61 
----------------------+----------------------+----------
              Unknown |   906,667     15,710 |   922,377 
                      |     26.38      29.53 |     26.43 
----------------------+----------------------+----------
                Total | 3,436,629     53,200 | 3,489,829 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       320          6 |       326 
           |      0.01       0.01 |      0.01 
-----------+----------------------+----------
         2 |   283,442      4,619 |   288,061 
           |      8.25       8.68 |      8.25 
-----------+----------------------+----------
         3 |   153,562      2,480 |   156,042 
           |      4.47       4.66 |      4.47 
-----------+----------------------+----------
         4 |    33,709        551 |    34,260 
           |      0.98       1.04 |      0.98 
-----------+----------------------+----------
         5 |    23,370        366 |    23,736 
           |      0.68       0.69 |      0.68 
-----------+----------------------+----------
         6 |   159,667      2,614 |   162,281 
           |      4.65       4.91 |      4.65 
-----------+----------------------+----------
         7 |     9,180        179 |     9,359 
           |      0.27       0.34 |      0.27 
-----------+----------------------+----------
         8 |   134,875      2,110 |   136,985 
           |      3.92       3.97 |      3.93 
-----------+----------------------+----------
         9 |   126,952      2,082 |   129,034 
           |      3.69       3.91 |      3.70 
-----------+----------------------+----------
        10 |   139,732      2,242 |   141,974 
           |      4.07       4.21 |      4.07 
-----------+----------------------+----------
        11 |   140,666      2,167 |   142,833 
           |      4.09       4.07 |      4.09 
-----------+----------------------+----------
        12 |    38,057        746 |    38,803 
           |      1.11       1.40 |      1.11 
-----------+----------------------+----------
        13 |    67,458      1,102 |    68,560 
           |      1.96       2.07 |      1.96 
-----------+----------------------+----------
        14 |    83,799      1,252 |    85,051 
           |      2.44       2.35 |      2.44 
-----------+----------------------+----------
        15 |   110,259      1,561 |   111,820 
           |      3.21       2.93 |      3.20 
-----------+----------------------+----------
        16 |   163,271      2,577 |   165,848 
           |      4.75       4.84 |      4.75 
-----------+----------------------+----------
        17 |   121,575      1,837 |   123,412 
           |      3.54       3.45 |      3.54 
-----------+----------------------+----------
        18 |   123,833      1,812 |   125,645 
           |      3.60       3.41 |      3.60 
-----------+----------------------+----------
        19 |   110,088      1,800 |   111,888 
           |      3.20       3.38 |      3.21 
-----------+----------------------+----------
        20 |   177,734      2,735 |   180,469 
           |      5.17       5.14 |      5.17 
-----------+----------------------+----------
        21 |   132,838      1,773 |   134,611 
           |      3.87       3.33 |      3.86 
-----------+----------------------+----------
        22 |     9,290        132 |     9,422 
           |      0.27       0.25 |      0.27 
-----------+----------------------+----------
        23 |   150,583      2,226 |   152,809 
           |      4.38       4.18 |      4.38 
-----------+----------------------+----------
        24 |     8,017        123 |     8,140 
           |      0.23       0.23 |      0.23 
-----------+----------------------+----------
        25 |    45,091        592 |    45,683 
           |      1.31       1.11 |      1.31 
-----------+----------------------+----------
        26 |   149,847      2,193 |   152,040 
           |      4.36       4.12 |      4.36 
-----------+----------------------+----------
        27 |   145,020      2,240 |   147,260 
           |      4.22       4.21 |      4.22 
-----------+----------------------+----------
        28 |   148,374      2,223 |   150,597 
           |      4.32       4.18 |      4.32 
-----------+----------------------+----------
        29 |    96,299      1,477 |    97,776 
           |      2.80       2.78 |      2.80 
-----------+----------------------+----------
        30 |    80,070      1,131 |    81,201 
           |      2.33       2.13 |      2.33 
-----------+----------------------+----------
        31 |     4,851         61 |     4,912 
           |      0.14       0.11 |      0.14 
-----------+----------------------+----------
        32 |   264,800      4,191 |   268,991 
           |      7.71       7.88 |      7.71 
-----------+----------------------+----------
     Total | 3,436,629     53,200 | 3,489,829 
           |    100.00     100.00 |    100.00 

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    408504      154              0.0004    0.0000     0.0003    0.0004
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    387027      314              0.0008    0.0000     0.0007    0.0009
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    901808      561              0.0006    0.0000     0.0006    0.0007
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    818547     1128              0.0014    0.0000     0.0013    0.0015
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    547205     1151              0.0021    0.0001     0.0020    0.0022
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    395898     1662              0.0042    0.0001     0.0040    0.0044
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    408542      736              0.0018    0.0001     0.0017    0.0019
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    387108     1175              0.0030    0.0001     0.0029    0.0032
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    901868     3424              0.0038    0.0001     0.0037    0.0039
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    818692     4551              0.0055    0.0001     0.0054    0.0057
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    547209     8544              0.0154    0.0002     0.0150    0.0157
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    395907     7906              0.0195    0.0002     0.0191    0.0200
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    407075      583              0.0014    0.0001     0.0013    0.0015
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    385422      690              0.0018    0.0001     0.0017    0.0019
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    898378     1577              0.0017    0.0000     0.0017    0.0018
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    814794     1995              0.0024    0.0001     0.0023    0.0025
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    542576     2145              0.0039    0.0001     0.0038    0.0041
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    392253     2155              0.0054    0.0001     0.0052    0.0057
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\04a_an_descriptive_tables.log
  log type:  text
 closed on:  26 Aug 2020, 19:14:22
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
