------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07a_an_multivariable_cox_models_non_covid_death.log
  log type:  text
 opened on:  26 Aug 2020, 18:36:46

. 
. 
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure'                                      ///
>                         $demogadjlist                                   ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. foreach exposure_type in kids_cat3  ///
>                 gp_number_kids {
  4. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
. }
  9. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 10. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 11. if _rc==0{
 12. estimates
 13. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_ageband_`x', replace
 14. *estat concordance /*c-statistic*/
.  }
 15.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 16. 
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(1) bmi(i.bmicat) smoking(i.smoke)
 17. if _rc==0{
 18. estimates
 19. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCeth_bmi_smok_ageband_`x', replace
 20. *estat concordance /*c-statistic*/
.  }
 21.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 22.  
. *Complete case ethnicity, BMI, smoking model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.bmicat) smoking(i.smoke)
 23. if _rc==0{
 24. estimates
 25. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_CCnoeth_bmi_smok_ageband_`x', replace
 26. *estat concordance /*c-statistic*/
.  }
 27.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')" 
 28.  
. }
 29. 
. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 30. foreach exposure_type in kids_cat3   {
 31. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 32. if _rc==0{
 33. estimates
 34. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_DEMOGADJ_noeth_12mo_ageband_`x', replace
 35. *estat concordance /*c-statistic*/
. }
 36. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
 37. 
. 
. }       
 38. 
. }       
   1:   3287.97 /        1 =    3287.9680

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =       10,290
Time at risk         =   2216905942
                                                Wald chi2(12)    =     9723.64
Log pseudolikelihood =   -127350.53             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .6424194   .0256354   -11.09   0.000     .5940897    .6946809
  Kids under 18  |   .7031258   .0310873    -7.97   0.000     .6447612    .7667736
                 |
            age1 |   1.105015   .0135267     8.16   0.000     1.078819    1.131848
            age2 |   1.028667   .0288706     1.01   0.314       .97361    1.086838
            age3 |   .8966065   .0607358    -1.61   0.107     .7851305     1.02391
          1.male |   1.364926   .0273272    15.54   0.000     1.312403    1.419551
                 |
             imd |
              2  |   1.183058   .0425669     4.67   0.000     1.102502      1.2695
              3  |   1.434406   .0502749    10.29   0.000     1.339177    1.536407
              4  |   1.754677   .0601416    16.41   0.000     1.640673    1.876602
5 most deprived  |   2.469562   .0835815    26.71   0.000      2.31106    2.638934
                 |
   tot_adults_hh |
              2  |   .6656077   .0157302   -17.22   0.000     .6354802    .6971635
              3  |   .6200151   .0157618   -18.80   0.000     .5898796    .6516901
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_ageband_0.ster saved
   1:   3002.56 /        1 =    3002.5580

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =       10,290
Time at risk         =   2216905942
                                                Wald chi2(12)    =     9723.64
Log pseudolikelihood =   -127350.53             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .6424194   .0256354   -11.09   0.000     .5940897    .6946809
  Kids under 18  |   .7031258   .0310873    -7.97   0.000     .6447612    .7667736
                 |
            age1 |   1.105015   .0135267     8.16   0.000     1.078819    1.131848
            age2 |   1.028667   .0288706     1.01   0.314       .97361    1.086838
            age3 |   .8966065   .0607358    -1.61   0.107     .7851305     1.02391
          1.male |   1.364926   .0273272    15.54   0.000     1.312403    1.419551
                 |
             imd |
              2  |   1.183058   .0425669     4.67   0.000     1.102502      1.2695
              3  |   1.434406   .0502749    10.29   0.000     1.339177    1.536407
              4  |   1.754677   .0601416    16.41   0.000     1.640673    1.876602
5 most deprived  |   2.469562   .0835815    26.71   0.000      2.31106    2.638934
                 |
   tot_adults_hh |
              2  |   .6656077   .0157302   -17.22   0.000     .6354802    .6971635
              3  |   .6200151   .0157618   -18.80   0.000     .5898796    .6516901
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_ageband_0.ster saved
   1:   2954.30 /        1 =    2954.3000

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =       10,290
Time at risk         =   2216905942
                                                Wald chi2(12)    =     9723.64
Log pseudolikelihood =   -127350.53             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .6424194   .0256354   -11.09   0.000     .5940897    .6946809
  Kids under 18  |   .7031258   .0310873    -7.97   0.000     .6447612    .7667736
                 |
            age1 |   1.105015   .0135267     8.16   0.000     1.078819    1.131848
            age2 |   1.028667   .0288706     1.01   0.314       .97361    1.086838
            age3 |   .8966065   .0607358    -1.61   0.107     .7851305     1.02391
          1.male |   1.364926   .0273272    15.54   0.000     1.312403    1.419551
                 |
             imd |
              2  |   1.183058   .0425669     4.67   0.000     1.102502      1.2695
              3  |   1.434406   .0502749    10.29   0.000     1.339177    1.536407
              4  |   1.754677   .0601416    16.41   0.000     1.640673    1.876602
5 most deprived  |   2.469562   .0835815    26.71   0.000      2.31106    2.638934
                 |
   tot_adults_hh |
              2  |   .6656077   .0157302   -17.22   0.000     .6354802    .6971635
              3  |   .6200151   .0157618   -18.80   0.000     .5898796    .6516901
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster saved
   1:   2931.89 /        1 =    2931.8880

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =       10,290
Time at risk         =   2216905942
                                                Wald chi2(12)    =     9723.64
Log pseudolikelihood =   -127350.53             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .6424194   .0256354   -11.09   0.000     .5940897    .6946809
  Kids under 18  |   .7031258   .0310873    -7.97   0.000     .6447612    .7667736
                 |
            age1 |   1.105015   .0135267     8.16   0.000     1.078819    1.131848
            age2 |   1.028667   .0288706     1.01   0.314       .97361    1.086838
            age3 |   .8966065   .0607358    -1.61   0.107     .7851305     1.02391
          1.male |   1.364926   .0273272    15.54   0.000     1.312403    1.419551
                 |
             imd |
              2  |   1.183058   .0425669     4.67   0.000     1.102502      1.2695
              3  |   1.434406   .0502749    10.29   0.000     1.339177    1.536407
              4  |   1.754677   .0601416    16.41   0.000     1.640673    1.876602
5 most deprived  |   2.469562   .0835815    26.71   0.000      2.31106    2.638934
                 |
   tot_adults_hh |
              2  |   .6656077   .0157302   -17.22   0.000     .6354802    .6971635
              3  |   .6200151   .0157618   -18.80   0.000     .5898796    .6516901
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster saved
   1:   3153.19 /        1 =    3153.1890

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =       10,290
Time at risk         =   2216905942
                                                Wald chi2(14)    =     9708.69
Log pseudolikelihood =   -127348.95             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .7030037   .0310818    -7.97   0.000     .6446494    .7666404
    1 child <12  |   .6716699   .0315158    -8.48   0.000     .6126553    .7363691
 2 children <12  |   .6045344    .040344    -7.54   0.000     .5304146    .6890115
3+ children <12  |    .566292   .0692272    -4.65   0.000     .4456398    .7196095
                 |
            age1 |   1.105981   .0135568     8.22   0.000     1.079727    1.132873
            age2 |   1.025841   .0288489     0.91   0.364     .9708284    1.083971
            age3 |   .9030267   .0613077    -1.50   0.133     .7905172    1.031549
          1.male |   1.365185   .0273328    15.55   0.000     1.312651    1.419821
                 |
             imd |
              2  |   1.182944   .0425626     4.67   0.000     1.102396    1.269377
              3  |   1.434284   .0502753    10.29   0.000     1.339055    1.536285
              4  |   1.754661   .0601434    16.40   0.000     1.640655     1.87659
5 most deprived  |   2.470401   .0836203    26.72   0.000     2.311826    2.639852
                 |
   tot_adults_hh |
              2  |   .6661443   .0157442   -17.19   0.000     .6359901    .6977282
              3  |   .6202866    .015767   -18.79   0.000      .590141     .651972
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth_ageband_0.ster saved
   1:   3090.30 /        1 =    3090.2960

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =       10,290
Time at risk         =   2216905942
                                                Wald chi2(14)    =     9708.69
Log pseudolikelihood =   -127348.95             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .7030037   .0310818    -7.97   0.000     .6446494    .7666404
    1 child <12  |   .6716699   .0315158    -8.48   0.000     .6126553    .7363691
 2 children <12  |   .6045344    .040344    -7.54   0.000     .5304146    .6890115
3+ children <12  |    .566292   .0692272    -4.65   0.000     .4456398    .7196095
                 |
            age1 |   1.105981   .0135568     8.22   0.000     1.079727    1.132873
            age2 |   1.025841   .0288489     0.91   0.364     .9708284    1.083971
            age3 |   .9030267   .0613077    -1.50   0.133     .7905172    1.031549
          1.male |   1.365185   .0273328    15.55   0.000     1.312651    1.419821
                 |
             imd |
              2  |   1.182944   .0425626     4.67   0.000     1.102396    1.269377
              3  |   1.434284   .0502753    10.29   0.000     1.339055    1.536285
              4  |   1.754661   .0601434    16.40   0.000     1.640655     1.87659
5 most deprived  |   2.470401   .0836203    26.72   0.000     2.311826    2.639852
                 |
   tot_adults_hh |
              2  |   .6661443   .0157442   -17.19   0.000     .6359901    .6977282
              3  |   .6202866    .015767   -18.79   0.000      .590141     .651972
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_ageband_0.ster saved
   1:   3123.89 /        1 =    3123.8880

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =       10,290
Time at risk         =   2216905942
                                                Wald chi2(14)    =     9708.69
Log pseudolikelihood =   -127348.95             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .7030037   .0310818    -7.97   0.000     .6446494    .7666404
    1 child <12  |   .6716699   .0315158    -8.48   0.000     .6126553    .7363691
 2 children <12  |   .6045344    .040344    -7.54   0.000     .5304146    .6890115
3+ children <12  |    .566292   .0692272    -4.65   0.000     .4456398    .7196095
                 |
            age1 |   1.105981   .0135568     8.22   0.000     1.079727    1.132873
            age2 |   1.025841   .0288489     0.91   0.364     .9708284    1.083971
            age3 |   .9030267   .0613077    -1.50   0.133     .7905172    1.031549
          1.male |   1.365185   .0273328    15.55   0.000     1.312651    1.419821
                 |
             imd |
              2  |   1.182944   .0425626     4.67   0.000     1.102396    1.269377
              3  |   1.434284   .0502753    10.29   0.000     1.339055    1.536285
              4  |   1.754661   .0601434    16.40   0.000     1.640655     1.87659
5 most deprived  |   2.470401   .0836203    26.72   0.000     2.311826    2.639852
                 |
   tot_adults_hh |
              2  |   .6661443   .0157442   -17.19   0.000     .6359901    .6977282
              3  |   .6202866    .015767   -18.79   0.000      .590141     .651972
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_0.ster saved
   1:   3100.47 /        1 =    3100.4750

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,054,790             Number of obs    =  12,054,790
No. of failures      =       10,290
Time at risk         =   2216905942
                                                Wald chi2(14)    =     9708.69
Log pseudolikelihood =   -127348.95             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,807,325 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .7030037   .0310818    -7.97   0.000     .6446494    .7666404
    1 child <12  |   .6716699   .0315158    -8.48   0.000     .6126553    .7363691
 2 children <12  |   .6045344    .040344    -7.54   0.000     .5304146    .6890115
3+ children <12  |    .566292   .0692272    -4.65   0.000     .4456398    .7196095
                 |
            age1 |   1.105981   .0135568     8.22   0.000     1.079727    1.132873
            age2 |   1.025841   .0288489     0.91   0.364     .9708284    1.083971
            age3 |   .9030267   .0613077    -1.50   0.133     .7905172    1.031549
          1.male |   1.365185   .0273328    15.55   0.000     1.312651    1.419821
                 |
             imd |
              2  |   1.182944   .0425626     4.67   0.000     1.102396    1.269377
              3  |   1.434284   .0502753    10.29   0.000     1.339055    1.536285
              4  |   1.754661   .0601434    16.40   0.000     1.640655     1.87659
5 most deprived  |   2.470401   .0836203    26.72   0.000     2.311826    2.639852
                 |
   tot_adults_hh |
              2  |   .6661443   .0157442   -17.19   0.000     .6359901    .6977282
              3  |   .6202866    .015767   -18.79   0.000      .590141     .651972
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_0.ster saved
(843,137 observations deleted)
   1:   2766.82 /        1 =    2766.8230

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,211,653             Number of obs    =  11,211,653
No. of failures      =        9,774
Time at risk         =   2061828908
                                                Wald chi2(12)    =     9033.17
Log pseudolikelihood =   -120445.01             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 6,406,502 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .6372514   .0263696   -10.89   0.000     .5876083    .6910885
  Kids under 18  |   .7031019   .0317859    -7.79   0.000      .643483    .7682445
                 |
            age1 |   1.102802    .014409     7.49   0.000      1.07492    1.131408
            age2 |   1.031753   .0306529     1.05   0.293     .9733899    1.093615
            age3 |   .8923191   .0637497    -1.59   0.111     .7757254    1.026437
          1.male |    1.35205   .0277482    14.70   0.000     1.298744    1.407544
                 |
             imd |
              2  |   1.175715   .0433776     4.39   0.000     1.093698    1.263883
              3  |   1.440454   .0516646    10.18   0.000      1.34267    1.545359
              4  |   1.768765   .0619788    16.27   0.000     1.651366     1.89451
5 most deprived  |   2.463852   .0855311    25.98   0.000      2.30179    2.637325
                 |
   tot_adults_hh |
              2  |   .6722708   .0163068   -16.37   0.000      .641058    .7050034
              3  |    .615808   .0160928   -18.55   0.000     .5850608     .648171
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo_ageband_0.ster saved
   1:    924.44 /        1 =     924.4390

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =       53,200
Time at risk         =    636034930
                                                Wald chi2(12)    =    49211.37
Log pseudolikelihood =   -608032.47             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .8636321   .0332415    -3.81   0.000     .8008769    .9313048
  Kids under 18  |   .9114322   .0447059    -1.89   0.059     .8278902    1.003404
                 |
            age1 |   1.092507   .0062994    15.34   0.000      1.08023    1.104924
            age2 |   1.052294   .0232529     2.31   0.021     1.007692     1.09887
            age3 |   .9070815   .0503451    -1.76   0.079     .8135845    1.011323
          1.male |    1.45502    .012991    42.00   0.000     1.429779    1.480706
                 |
             imd |
              2  |   1.122186   .0150334     8.61   0.000     1.093104    1.152041
              3  |   1.229538   .0166545    15.26   0.000     1.197325    1.262617
              4  |   1.379444   .0193087    22.98   0.000     1.342114    1.417812
5 most deprived  |     1.6504   .0247943    33.35   0.000     1.602512    1.699718
                 |
   tot_adults_hh |
              2  |   .8740516   .0088458   -13.30   0.000     .8568849    .8915622
              3  |   1.025867   .0158211     1.66   0.098     .9953218    1.057349
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_ageband_1.ster saved
   1:    912.51 /        1 =     912.5070

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =       53,200
Time at risk         =    636034930
                                                Wald chi2(12)    =    49211.37
Log pseudolikelihood =   -608032.47             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .8636321   .0332415    -3.81   0.000     .8008769    .9313048
  Kids under 18  |   .9114322   .0447059    -1.89   0.059     .8278902    1.003404
                 |
            age1 |   1.092507   .0062994    15.34   0.000      1.08023    1.104924
            age2 |   1.052294   .0232529     2.31   0.021     1.007692     1.09887
            age3 |   .9070815   .0503451    -1.76   0.079     .8135845    1.011323
          1.male |    1.45502    .012991    42.00   0.000     1.429779    1.480706
                 |
             imd |
              2  |   1.122186   .0150334     8.61   0.000     1.093104    1.152041
              3  |   1.229538   .0166545    15.26   0.000     1.197325    1.262617
              4  |   1.379444   .0193087    22.98   0.000     1.342114    1.417812
5 most deprived  |     1.6504   .0247943    33.35   0.000     1.602512    1.699718
                 |
   tot_adults_hh |
              2  |   .8740516   .0088458   -13.30   0.000     .8568849    .8915622
              3  |   1.025867   .0158211     1.66   0.098     .9953218    1.057349
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_ageband_1.ster saved
   1:    922.51 /        1 =     922.5120

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =       53,200
Time at risk         =    636034930
                                                Wald chi2(12)    =    49211.37
Log pseudolikelihood =   -608032.47             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .8636321   .0332415    -3.81   0.000     .8008769    .9313048
  Kids under 18  |   .9114322   .0447059    -1.89   0.059     .8278902    1.003404
                 |
            age1 |   1.092507   .0062994    15.34   0.000      1.08023    1.104924
            age2 |   1.052294   .0232529     2.31   0.021     1.007692     1.09887
            age3 |   .9070815   .0503451    -1.76   0.079     .8135845    1.011323
          1.male |    1.45502    .012991    42.00   0.000     1.429779    1.480706
                 |
             imd |
              2  |   1.122186   .0150334     8.61   0.000     1.093104    1.152041
              3  |   1.229538   .0166545    15.26   0.000     1.197325    1.262617
              4  |   1.379444   .0193087    22.98   0.000     1.342114    1.417812
5 most deprived  |     1.6504   .0247943    33.35   0.000     1.602512    1.699718
                 |
   tot_adults_hh |
              2  |   .8740516   .0088458   -13.30   0.000     .8568849    .8915622
              3  |   1.025867   .0158211     1.66   0.098     .9953218    1.057349
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster saved
   1:    915.39 /        1 =     915.3870

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =       53,200
Time at risk         =    636034930
                                                Wald chi2(12)    =    49211.37
Log pseudolikelihood =   -608032.47             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .8636321   .0332415    -3.81   0.000     .8008769    .9313048
  Kids under 18  |   .9114322   .0447059    -1.89   0.059     .8278902    1.003404
                 |
            age1 |   1.092507   .0062994    15.34   0.000      1.08023    1.104924
            age2 |   1.052294   .0232529     2.31   0.021     1.007692     1.09887
            age3 |   .9070815   .0503451    -1.76   0.079     .8135845    1.011323
          1.male |    1.45502    .012991    42.00   0.000     1.429779    1.480706
                 |
             imd |
              2  |   1.122186   .0150334     8.61   0.000     1.093104    1.152041
              3  |   1.229538   .0166545    15.26   0.000     1.197325    1.262617
              4  |   1.379444   .0193087    22.98   0.000     1.342114    1.417812
5 most deprived  |     1.6504   .0247943    33.35   0.000     1.602512    1.699718
                 |
   tot_adults_hh |
              2  |   .8740516   .0088458   -13.30   0.000     .8568849    .8915622
              3  |   1.025867   .0158211     1.66   0.098     .9953218    1.057349
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster saved
   1:    982.08 /        1 =     982.0820

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =       53,200
Time at risk         =    636034930
                                                Wald chi2(14)    =    49212.91
Log pseudolikelihood =   -608032.09             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .9113324   .0447009    -1.89   0.058     .8277998    1.003294
    1 child <12  |   .8836906   .0418896    -2.61   0.009     .8052871    .9697275
 2 children <12  |   .8398601   .0586809    -2.50   0.012     .7323753    .9631196
3+ children <12  |   .8009677   .1027971    -1.73   0.084      .622832    1.030052
                 |
            age1 |   1.092505   .0062994    15.34   0.000     1.080228    1.104922
            age2 |   1.052304   .0232532     2.31   0.021     1.007702    1.098881
            age3 |   .9070614    .050344    -1.76   0.079     .8135664    1.011301
          1.male |   1.455022   .0129909    42.00   0.000     1.429781    1.480707
                 |
             imd |
              2  |   1.122175   .0150333     8.60   0.000     1.093094     1.15203
              3  |   1.229536   .0166543    15.26   0.000     1.197324    1.262615
              4  |   1.379487   .0193097    22.98   0.000     1.342155    1.417857
5 most deprived  |    1.65055   .0247964    33.36   0.000     1.602658    1.699872
                 |
   tot_adults_hh |
              2  |   .8740514   .0088458   -13.30   0.000     .8568847     .891562
              3  |   1.026025   .0158216     1.67   0.096     .9954792    1.057508
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_noeth_ageband_1.ster saved
   1:    987.03 /        1 =     987.0300

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =       53,200
Time at risk         =    636034930
                                                Wald chi2(14)    =    49212.91
Log pseudolikelihood =   -608032.09             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .9113324   .0447009    -1.89   0.058     .8277998    1.003294
    1 child <12  |   .8836906   .0418896    -2.61   0.009     .8052871    .9697275
 2 children <12  |   .8398601   .0586809    -2.50   0.012     .7323753    .9631196
3+ children <12  |   .8009677   .1027971    -1.73   0.084      .622832    1.030052
                 |
            age1 |   1.092505   .0062994    15.34   0.000     1.080228    1.104922
            age2 |   1.052304   .0232532     2.31   0.021     1.007702    1.098881
            age3 |   .9070614    .050344    -1.76   0.079     .8135664    1.011301
          1.male |   1.455022   .0129909    42.00   0.000     1.429781    1.480707
                 |
             imd |
              2  |   1.122175   .0150333     8.60   0.000     1.093094     1.15203
              3  |   1.229536   .0166543    15.26   0.000     1.197324    1.262615
              4  |   1.379487   .0193097    22.98   0.000     1.342155    1.417857
5 most deprived  |    1.65055   .0247964    33.36   0.000     1.602658    1.699872
                 |
   tot_adults_hh |
              2  |   .8740514   .0088458   -13.30   0.000     .8568847     .891562
              3  |   1.026025   .0158216     1.67   0.096     .9954792    1.057508
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_ageband_1.ster saved
   1:    984.20 /        1 =     984.1960

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =       53,200
Time at risk         =    636034930
                                                Wald chi2(14)    =    49212.91
Log pseudolikelihood =   -608032.09             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .9113324   .0447009    -1.89   0.058     .8277998    1.003294
    1 child <12  |   .8836906   .0418896    -2.61   0.009     .8052871    .9697275
 2 children <12  |   .8398601   .0586809    -2.50   0.012     .7323753    .9631196
3+ children <12  |   .8009677   .1027971    -1.73   0.084      .622832    1.030052
                 |
            age1 |   1.092505   .0062994    15.34   0.000     1.080228    1.104922
            age2 |   1.052304   .0232532     2.31   0.021     1.007702    1.098881
            age3 |   .9070614    .050344    -1.76   0.079     .8135664    1.011301
          1.male |   1.455022   .0129909    42.00   0.000     1.429781    1.480707
                 |
             imd |
              2  |   1.122175   .0150333     8.60   0.000     1.093094     1.15203
              3  |   1.229536   .0166543    15.26   0.000     1.197324    1.262615
              4  |   1.379487   .0193097    22.98   0.000     1.342155    1.417857
5 most deprived  |    1.65055   .0247964    33.36   0.000     1.602658    1.699872
                 |
   tot_adults_hh |
              2  |   .8740514   .0088458   -13.30   0.000     .8568847     .891562
              3  |   1.026025   .0158216     1.67   0.096     .9954792    1.057508
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCeth_bmi_smok_ageband_1.ster saved
   1:    978.70 /        1 =     978.7000

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,489,829             Number of obs    =   3,489,829
No. of failures      =       53,200
Time at risk         =    636034930
                                                Wald chi2(14)    =    49212.91
Log pseudolikelihood =   -608032.09             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,613,761 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
  gp_number_kids |
 only >12 years  |   .9113324   .0447009    -1.89   0.058     .8277998    1.003294
    1 child <12  |   .8836906   .0418896    -2.61   0.009     .8052871    .9697275
 2 children <12  |   .8398601   .0586809    -2.50   0.012     .7323753    .9631196
3+ children <12  |   .8009677   .1027971    -1.73   0.084      .622832    1.030052
                 |
            age1 |   1.092505   .0062994    15.34   0.000     1.080228    1.104922
            age2 |   1.052304   .0232532     2.31   0.021     1.007702    1.098881
            age3 |   .9070614    .050344    -1.76   0.079     .8135664    1.011301
          1.male |   1.455022   .0129909    42.00   0.000     1.429781    1.480707
                 |
             imd |
              2  |   1.122175   .0150333     8.60   0.000     1.093094     1.15203
              3  |   1.229536   .0166543    15.26   0.000     1.197324    1.262615
              4  |   1.379487   .0193097    22.98   0.000     1.342155    1.417857
5 most deprived  |    1.65055   .0247964    33.36   0.000     1.602658    1.699872
                 |
   tot_adults_hh |
              2  |   .8740514   .0088458   -13.30   0.000     .8568847     .891562
              3  |   1.026025   .0158216     1.67   0.096     .9954792    1.057508
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_gp_number_kids_DEMOGADJ_CCnoeth_bmi_smok_ageband_1.ster saved
(80,442 observations deleted)
   1:    892.81 /        1 =     892.8070

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,409,387             Number of obs    =   3,409,387
No. of failures      =       51,731
Time at risk         =    621415400
                                                Wald chi2(12)    =    47654.93
Log pseudolikelihood =   -590186.66             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 2,553,148 clusters in household_id)
----------------------------------------------------------------------------------
                 |               Robust
              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       kids_cat3 |
  Kids under 12  |   .8672848   .0343954    -3.59   0.000     .8024244    .9373879
  Kids under 18  |   .9042224   .0457543    -1.99   0.047     .8188491    .9984967
                 |
            age1 |   1.091555   .0063785    14.99   0.000     1.079124    1.104128
            age2 |   1.052999   .0235827     2.31   0.021     1.007778     1.10025
            age3 |   .9069968   .0510241    -1.74   0.083     .8123076    1.012724
          1.male |    1.45265   .0131506    41.25   0.000     1.427102    1.478654
                 |
             imd |
              2  |   1.122342   .0152286     8.51   0.000     1.092888     1.15259
              3  |   1.228604   .0168616    15.00   0.000     1.195996      1.2621
              4  |   1.378665   .0195536    22.64   0.000     1.340868    1.417527
5 most deprived  |   1.651763    .025152    32.96   0.000     1.603195    1.701803
                 |
   tot_adults_hh |
              2  |   .8803161   .0090236   -12.44   0.000     .8628066    .8981809
              3  |   1.014776   .0159404     0.93   0.350     .9840096    1.046504
----------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_DEMOGADJ_noeth_12mo_ageband_1.ster saved

.         
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07a_an_multivariable_cox_models_non_covid_death.log
  log type:  text
 closed on:  27 Aug 2020, 04:37:31
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
