------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_covid_death_icu.log
  log type:  text
 opened on:  26 Aug 2020, 18:36:48

. 
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in        kids_cat3  {
  4. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.         /*  Proportional Hazards test  */
.         * Based on Schoenfeld residuals
.         timer clear 
  9.         timer on 1
 10.         if e(N_fail)>0 estat phtest, d
 11.         timer off 1
 12.         timer list
 13. }
 14. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 15. 
. }
 16. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 17. foreach exposure_type in kids_cat3   {
 18. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 19. if _rc==0{
 20. estimates
 21. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth_12mo_ageband_`x', replace
 22. *estat concordance /*c-statistic*/
. }
 23. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
 24. 
. 
. }       
 25. 
.  
.  
.  foreach exposure_type in       gp_number_kids {
 26. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 27. if _rc==0{
 28. estimates
 29. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth_ageband_`x', replace
 30. }
 31. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 32. }
 33. 
. }
   1:   5377.05 /        1 =    5377.0540

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  11,870,825
No. of failures      =        2,587
Time at risk         =   2182954615
                                                Wald chi2(37)    =     8788.66
Log pseudolikelihood =   -31196.978             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9861469   .0611351    -0.23   0.822     .8733177    1.113553
               Kids under 18  |   1.077788   .0780625     1.03   0.301      .935152     1.24218
                              |
                         age1 |   1.140292   .0245223     6.10   0.000     1.093228    1.189382
                         age2 |   .9210695   .0456379    -1.66   0.097      .835827    1.015006
                         age3 |   1.096849    .132297     0.77   0.443     .8659216     1.38936
                       1.male |   1.674619   .0699093    12.35   0.000     1.543055    1.817401
                              |
                          imd |
                           2  |    1.12891   .0829692     1.65   0.099     .9774633    1.303822
                           3  |   1.261261   .0906552     3.23   0.001     1.095528    1.452066
                           4  |   1.601459    .109711     6.87   0.000      1.40024    1.831593
             5 most deprived  |   1.709512   .1212794     7.56   0.000     1.487595    1.964535
                              |
                tot_adults_hh |
                           2  |   .8894845   .0472581    -2.20   0.028     .8015197    .9871032
                           3  |   1.158971   .0600256     2.85   0.004     1.047097    1.282797
                              |
           1.htdiag_or_highbp |      1.613     .07409    10.41   0.000     1.474131    1.764951
1.chronic_respiratory_disease |   2.354875   .1581954    12.75   0.000     2.064362     2.68627
                     1.asthma |    1.23254   .0625376     4.12   0.000     1.115866    1.361413
    1.chronic_cardiac_disease |   1.417989   .0894136     5.54   0.000     1.253138    1.604526
                              |
                      diabcat |
            T1DM, controlled  |   1.897609    .579812     2.10   0.036     1.042613    3.453745
          T1DM, uncontrolled  |   2.753484   .4444486     6.27   0.000     2.006723    3.778137
            T2DM, controlled  |   2.410611   .1553696    13.65   0.000     2.124542      2.7352
          T2DM, uncontrolled  |   3.789158    .230748    21.88   0.000     3.362848    4.269512
          Diabetes, no HbA1c  |   3.648048   1.300354     3.63   0.000     1.814046     7.33623
                              |
            cancer_exhaem_cat |
                   Last year  |   3.647276   .5488294     8.60   0.000     2.715706    4.898402
               2-5 years ago  |   1.908273   .2364225     5.22   0.000     1.496863    2.432757
                    5+ years  |   1.141378   .1451251     1.04   0.298     .8896104    1.464397
                              |
              cancer_haem_cat |
                   Last year  |   5.276419   1.789122     4.91   0.000     2.714656    10.25566
               2-5 years ago  |   5.345798   1.060974     8.45   0.000     3.623061    7.887684
                    5+ years  |   2.018697   .4323359     3.28   0.001       1.3267    3.071634
                              |
      1.chronic_liver_disease |   2.309824   .2560741     7.55   0.000     1.858712    2.870421
            1.stroke_dementia |   1.761065   .1618987     6.16   0.000     1.470695    2.108765
                1.other_neuro |   3.138752   .3403412    10.55   0.000     2.537813    3.881991
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |      2.327   .1837944    10.69   0.000     1.993267    2.716609
           Stage 4/5 egfr<30  |   3.859223   .6428836     8.11   0.000     2.784221    5.349291
                              |
                       1.esrd |   3.392424   .5644104     7.34   0.000     2.448457    4.700323
           1.other_transplant |   .6269637   .2688935    -1.09   0.276     .2705063     1.45314
                   1.asplenia |    2.16739   .5554643     3.02   0.003     1.311562    3.581667
           1.ra_sle_psoriasis |   1.193711   .0893593     2.37   0.018     1.030812    1.382352
               1.other_immuno |   2.352035   .4035351     4.99   0.000     1.680368    3.292177
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |     -0.02008         1.14        1         0.2859
      2.kids_cat3 |     -0.02735         2.11        1         0.1459
      age1        |      0.01506         0.65        1         0.4206
      age2        |     -0.01840         0.98        1         0.3228
      age3        |      0.01905         1.04        1         0.3079
      0b.male     |            .            .        1             .
      1.male      |     -0.08293        19.05        1         0.0000
      1b.imd      |            .            .        1             .
      2.imd       |      0.03658         3.60        1         0.0577
      3.imd       |      0.02742         2.03        1         0.1541
      4.imd       |      0.08373        18.93        1         0.0000
      5.imd       |      0.09263        24.00        1         0.0000
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.03533         3.42        1         0.0644
      3.tot_adul~h|     -0.00236         0.02        1         0.9024
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.02904         2.76        1         0.0966
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.00409         0.06        1         0.8132
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01637         0.80        1         0.3719
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.01172         0.44        1         0.5057
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00948         0.25        1         0.6203
      3.diabcat   |      0.01189         0.38        1         0.5357
      4.diabcat   |     -0.06148        11.57        1         0.0007
      5.diabcat   |     -0.05709        10.86        1         0.0010
      6.diabcat   |      0.00581         0.09        1         0.7619
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.06669        12.26        1         0.0005
      3.cancer_e~t|      0.05522         8.44        1         0.0037
      4.cancer_e~t|      0.04449         5.34        1         0.0208
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.02357         1.56        1         0.2119
      3.cancer_h~t|     -0.00889         0.23        1         0.6337
      4.cancer_h~t|     -0.00396         0.05        1         0.8314
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.08747        23.15        1         0.0000
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01543         0.79        1         0.3747
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.03285         3.30        1         0.0694
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.01036         0.31        1         0.5756
      3.reduced_~t|      0.00784         0.28        1         0.5958
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.01918         1.71        1         0.1913
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00171         0.01        1         0.9225
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.01711         0.89        1         0.3458
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00158         0.01        1         0.9343
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.01700         0.86        1         0.3526
      ------------+---------------------------------------------------
      global test |                    145.36       37         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   7757.32 /        1 =    7757.3160
(843,137 observations deleted)
   1:   4161.53 /        1 =    4161.5350

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,037,363             Number of obs    =  11,037,363
No. of failures      =        2,447
Time at risk         =   2029663999
                                                Wald chi2(37)    =     8307.04
Log pseudolikelihood =    -29374.12             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,353,709 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.010694    .064306     0.17   0.867     .8921987    1.144927
               Kids under 18  |   1.090792   .0804787     1.18   0.239     .9439315    1.260503
                              |
                         age1 |   1.131891   .0256993     5.46   0.000     1.082625    1.183398
                         age2 |    .938339   .0490114    -1.22   0.223     .8470319    1.039489
                         age3 |   1.048895   .1331644     0.38   0.707     .8178357    1.345234
                       1.male |   1.683339   .0722053    12.14   0.000     1.547605    1.830978
                              |
                          imd |
                           2  |   1.140555   .0859126     1.75   0.081     .9840094    1.322005
                           3  |   1.257175   .0929566     3.10   0.002      1.08757     1.45323
                           4  |   1.627112   .1145036     6.92   0.000     1.417478    1.867749
             5 most deprived  |   1.731457   .1264107     7.52   0.000     1.500607    1.997821
                              |
                tot_adults_hh |
                           2  |   .9008083   .0496332    -1.90   0.058     .8085976    1.003534
                           3  |    1.18801   .0636035     3.22   0.001     1.069667    1.319446
                              |
           1.htdiag_or_highbp |   1.620812   .0764106    10.24   0.000     1.477761    1.777711
1.chronic_respiratory_disease |   2.329004   .1611064    12.22   0.000     2.033711    2.667173
                     1.asthma |   1.233255   .0642323     4.03   0.000     1.113575    1.365798
    1.chronic_cardiac_disease |   1.418541   .0917043     5.41   0.000     1.249724    1.610161
                              |
                      diabcat |
            T1DM, controlled  |   1.634409   .5524242     1.45   0.146     .8426703    3.170033
          T1DM, uncontrolled  |   2.608477   .4431827     5.64   0.000     1.869679    3.639209
            T2DM, controlled  |   2.395573   .1581469    13.23   0.000     2.104826    2.726482
          T2DM, uncontrolled  |   3.729345   .2329802    21.07   0.000     3.299562    4.215111
          Diabetes, no HbA1c  |   3.619449   1.379752     3.37   0.001      1.71459    7.640554
                              |
            cancer_exhaem_cat |
                   Last year  |   3.279594   .5355408     7.27   0.000     2.381351    4.516655
               2-5 years ago  |   1.963675   .2451912     5.40   0.000     1.537396    2.508151
                    5+ years  |   1.155822   .1492487     1.12   0.262     .8973821    1.488692
                              |
              cancer_haem_cat |
                   Last year  |   5.722109   1.941106     5.14   0.000     2.943092    11.12522
               2-5 years ago  |   5.376537    1.08804     8.31   0.000     3.616151    7.993901
                    5+ years  |   2.103678   .4518394     3.46   0.001     1.380873     3.20483
                              |
      1.chronic_liver_disease |   2.360548   .2675493     7.58   0.000     1.890323    2.947744
            1.stroke_dementia |   1.768759   .1674824     6.02   0.000      1.46916    2.129454
                1.other_neuro |   3.232225    .355648    10.66   0.000     2.605207    4.010153
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.354949   .1905099    10.59   0.000     2.009654    2.759572
           Stage 4/5 egfr<30  |   4.008626   .6889635     8.08   0.000     2.862196     5.61425
                              |
                       1.esrd |   3.221103   .5555082     6.78   0.000     2.297245      4.5165
           1.other_transplant |   .5689149   .2648187    -1.21   0.226     .2284703    1.416657
                   1.asplenia |   2.269532   .5832652     3.19   0.001     1.371447    3.755722
           1.ra_sle_psoriasis |    1.16641   .0903354     1.99   0.047     1.002139    1.357609
               1.other_immuno |   2.231849   .4058697     4.41   0.000     1.562683    3.187564
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_0.ster saved
   1:   4301.79 /        1 =    4301.7930

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,037,363             Number of obs    =  11,037,363
No. of failures      =        2,447
Time at risk         =   2029663999
                                                Wald chi2(39)    =     8309.10
Log pseudolikelihood =   -29372.617             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,353,709 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |   1.090646   .0804698     1.18   0.240     .9438014    1.260338
                 1 child <12  |   1.067298   .0793919     0.88   0.381     .9225044    1.234818
              2 children <12  |   .8737043   .0954447    -1.24   0.216     .7053067    1.082308
             3+ children <12  |   1.082887   .1832527     0.47   0.638     .7772085    1.508789
                              |
                         age1 |   1.133515   .0257862     5.51   0.000     1.084085    1.185198
                         age2 |   .9344163   .0488906    -1.30   0.195     .8433421    1.035326
                         age3 |   1.060135   .1347981     0.46   0.646     .8262836    1.360169
                       1.male |    1.68397   .0722309    12.15   0.000     1.548187    1.831661
                              |
                          imd |
                           2  |   1.139959   .0858634     1.74   0.082     .9835022    1.321304
                           3  |   1.255897   .0928597     3.08   0.002     1.086468    1.451747
                           4  |    1.62531   .1143552     6.90   0.000     1.415946    1.865632
             5 most deprived  |   1.728794   .1262229     7.50   0.000     1.498288    1.994763
                              |
                tot_adults_hh |
                           2  |   .9023262   .0497007    -1.87   0.062     .8099885     1.00519
                           3  |   1.187826   .0636089     3.21   0.001     1.069475    1.319275
                              |
           1.htdiag_or_highbp |     1.6205   .0763798    10.24   0.000     1.477505    1.777334
1.chronic_respiratory_disease |   2.328752   .1610907    12.22   0.000     2.033488    2.666888
                     1.asthma |   1.233052   .0642191     4.02   0.000     1.113396    1.365567
    1.chronic_cardiac_disease |   1.418665     .09171     5.41   0.000     1.249838    1.610297
                              |
                      diabcat |
            T1DM, controlled  |   1.635612   .5528384     1.46   0.145     .8432833    3.172395
          T1DM, uncontrolled  |   2.608941    .443253     5.64   0.000     1.870024    3.639832
            T2DM, controlled  |   2.395658    .158128    13.24   0.000     2.104943    2.726523
          T2DM, uncontrolled  |   3.729162    .232947    21.07   0.000     3.299437    4.214855
          Diabetes, no HbA1c  |   3.619931   1.380348     3.37   0.001     1.714435    7.643275
                              |
            cancer_exhaem_cat |
                   Last year  |   3.282325   .5359291     7.28   0.000     2.383415     4.52026
               2-5 years ago  |   1.963326    .245151     5.40   0.000     1.537117    2.507713
                    5+ years  |   1.155765   .1492269     1.12   0.262     .8973598    1.488582
                              |
              cancer_haem_cat |
                   Last year  |    5.71044   1.937708     5.13   0.000     2.936524    11.10467
               2-5 years ago  |   5.370844   1.086986     8.31   0.000     3.612192    7.985722
                    5+ years  |   2.104706   .4519715     3.47   0.001     1.381662    3.206131
                              |
      1.chronic_liver_disease |   2.361036   .2675741     7.58   0.000     1.890761    2.948278
            1.stroke_dementia |   1.769205   .1675258     6.03   0.000     1.469529    2.129994
                1.other_neuro |   3.233342   .3557713    10.67   0.000     2.606106     4.01154
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.355584   .1905579    10.59   0.000     2.010202    2.760309
           Stage 4/5 egfr<30  |   4.014142   .6903846     8.08   0.000     2.865473    5.623274
                              |
                       1.esrd |   3.215931   .5549798     6.77   0.000     2.293048    4.510247
           1.other_transplant |   .5686363   .2646888    -1.21   0.225     .2283586    1.415963
                   1.asplenia |   2.266787   .5826397     3.18   0.001     1.369694    3.751439
           1.ra_sle_psoriasis |   1.166065   .0903065     1.98   0.047     1.001846    1.357202
               1.other_immuno |   2.232561   .4060204     4.42   0.000     1.563152     3.18864
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_0.ster saved
   1:   1556.95 /        1 =    1556.9500

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   3,329,528
No. of failures      =        8,460
Time at risk         =    606783707
                                                Wald chi2(37)    =    16248.27
Log pseudolikelihood =   -93949.531             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9151181   .0771293    -1.05   0.293     .7757734    1.079492
               Kids under 18  |   .8971764   .1037626    -0.94   0.348     .7152081    1.125442
                              |
                         age1 |   1.027647   .0143247     1.96   0.050     .9999515     1.05611
                         age2 |   1.255624   .0683125     4.18   0.000     1.128626    1.396913
                         age3 |   .5807068   .0798439    -3.95   0.000     .4435285    .7603128
                       1.male |   1.766615   .0411059    24.46   0.000     1.687858    1.849046
                              |
                          imd |
                           2  |    1.11132   .0394285     2.97   0.003     1.036667    1.191349
                           3  |   1.226652   .0434676     5.76   0.000     1.144348    1.314875
                           4  |    1.41484   .0506438     9.69   0.000     1.318982    1.517665
             5 most deprived  |    1.64336   .0620052    13.17   0.000     1.526216    1.769494
                              |
                tot_adults_hh |
                           2  |   .7979049   .0203297    -8.86   0.000     .7590379    .8387621
                           3  |   .9908582    .037409    -0.24   0.808     .9201849    1.066959
                              |
           1.htdiag_or_highbp |   .9404261   .0254774    -2.27   0.023     .8917939    .9917103
1.chronic_respiratory_disease |    1.83096    .048532    22.82   0.000     1.738268    1.928595
                     1.asthma |    1.11198   .0344835     3.42   0.001     1.046406    1.181663
    1.chronic_cardiac_disease |   1.370588   .0327828    13.18   0.000     1.307818    1.436371
                              |
                      diabcat |
            T1DM, controlled  |   1.752454   .3791846     2.59   0.010     1.146751    2.678083
          T1DM, uncontrolled  |   2.929448   .3651521     8.62   0.000     2.294481    3.740133
            T2DM, controlled  |   1.479239   .0412423    14.04   0.000     1.400575    1.562322
          T2DM, uncontrolled  |   2.077118    .071641    21.19   0.000     1.941345    2.222386
          Diabetes, no HbA1c  |    2.36094   .5599689     3.62   0.000     1.483189    3.758143
                              |
            cancer_exhaem_cat |
                   Last year  |   2.138146   .1465071    11.09   0.000     1.869444    2.445469
               2-5 years ago  |   1.193226    .062967     3.35   0.001     1.075981    1.323248
                    5+ years  |   1.058688   .0359967     1.68   0.093     .9904351    1.131644
                              |
              cancer_haem_cat |
                   Last year  |    3.41196   .5091278     8.22   0.000     2.546765    4.571082
               2-5 years ago  |   2.467354   .2439607     9.13   0.000     2.032678    2.994984
                    5+ years  |   1.565263   .1334366     5.26   0.000     1.324413    1.849912
                              |
      1.chronic_liver_disease |   1.998673    .159107     8.70   0.000      1.70994    2.336161
            1.stroke_dementia |   1.730123   .0497328    19.07   0.000     1.635344    1.830396
                1.other_neuro |   2.450434   .1173386    18.72   0.000     2.230917    2.691552
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.313132   .0338079    10.58   0.000     1.248514    1.381095
           Stage 4/5 egfr<30  |    2.43685   .1106434    19.62   0.000     2.229362    2.663649
                              |
                       1.esrd |   3.207813   .2811336    13.30   0.000     2.701528    3.808979
           1.other_transplant |   1.799252   .5504731     1.92   0.055     .9878042    3.277278
                   1.asplenia |   1.036359   .2087033     0.18   0.859     .6983835    1.537893
           1.ra_sle_psoriasis |    1.27176   .0466856     6.55   0.000     1.183472    1.366634
               1.other_immuno |   1.778282   .3070071     3.33   0.001     1.267789    2.494332
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |     -0.00737         0.48        1         0.4893
      2.kids_cat3 |     -0.00693         0.43        1         0.5123
      age1        |      0.00616         0.33        1         0.5655
      age2        |      0.01152         1.15        1         0.2846
      age3        |     -0.01283         1.41        1         0.2344
      0b.male     |            .            .        1             .
      1.male      |     -0.05934        32.37        1         0.0000
      1b.imd      |            .            .        1             .
      2.imd       |      0.00188         0.03        1         0.8591
      3.imd       |      0.00373         0.12        1         0.7279
      4.imd       |     -0.00386         0.13        1         0.7174
      5.imd       |      0.01487         1.98        1         0.1595
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.00397         0.15        1         0.7019
      3.tot_adul~h|      0.01876         3.55        1         0.0597
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.01290         1.49        1         0.2225
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.00113         0.01        1         0.9137
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01868         3.04        1         0.0815
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.02146         4.27        1         0.0389
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01308         1.53        1         0.2163
      3.diabcat   |     -0.00574         0.29        1         0.5893
      4.diabcat   |     -0.02412         5.08        1         0.0242
      5.diabcat   |     -0.02415         5.15        1         0.0233
      6.diabcat   |     -0.01185         1.21        1         0.2712
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00659         0.38        1         0.5360
      3.cancer_e~t|      0.00787         0.53        1         0.4646
      4.cancer_e~t|      0.01618         2.27        1         0.1321
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.00392         0.14        1         0.7103
      3.cancer_h~t|     -0.01409         1.74        1         0.1866
      4.cancer_h~t|     -0.00528         0.24        1         0.6224
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.01404         1.75        1         0.1864
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01741         2.89        1         0.0889
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.01882         3.32        1         0.0684
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.04057        15.68        1         0.0001
      3.reduced_~t|     -0.02527         6.34        1         0.0118
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00161         0.02        1         0.8815
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.01241         1.36        1         0.2441
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.02315         4.64        1         0.0313
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00493         0.21        1         0.6471
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.01580         2.23        1         0.1350
      ------------+---------------------------------------------------
      global test |                    244.57       37         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   3011.34 /        1 =    3011.3410
(80,442 observations deleted)
   1:   1533.49 /        1 =    1533.4900

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,252,860             Number of obs    =   3,252,860
No. of failures      =        8,133
Time at risk         =    592852064
                                                Wald chi2(37)    =    15609.40
Log pseudolikelihood =   -90154.363             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,464,680 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9442537   .0815579    -0.66   0.507     .7972014    1.118431
               Kids under 18  |   .8792773   .1064767    -1.06   0.288     .6935041    1.114815
                              |
                         age1 |   1.025336   .0145557     1.76   0.078     .9972008    1.054266
                         age2 |   1.258311   .0697453     4.15   0.000     1.128777    1.402711
                         age3 |   .5802974      .0813    -3.88   0.000     .4409576    .7636676
                       1.male |   1.773034   .0420247    24.16   0.000     1.692551    1.857343
                              |
                          imd |
                           2  |   1.112687   .0401564     2.96   0.003     1.036701    1.194242
                           3  |   1.211503   .0438025     5.31   0.000     1.128623    1.300469
                           4  |    1.41417   .0514822     9.52   0.000     1.316783     1.51876
             5 most deprived  |   1.627728   .0624906    12.69   0.000     1.509743    1.754933
                              |
                tot_adults_hh |
                           2  |   .8076785   .0209129    -8.25   0.000     .7677127    .8497249
                           3  |   .9735935   .0375654    -0.69   0.488     .9026818    1.050076
                              |
           1.htdiag_or_highbp |   .9457937   .0261584    -2.02   0.044      .895889    .9984782
1.chronic_respiratory_disease |   1.848004   .0498986    22.74   0.000     1.752747    1.948437
                     1.asthma |   1.108877   .0351043     3.26   0.001     1.042164    1.179859
    1.chronic_cardiac_disease |   1.376181   .0335567    13.10   0.000     1.311958    1.443548
                              |
                      diabcat |
            T1DM, controlled  |   1.825535   .3946968     2.78   0.005     1.194958    2.788865
          T1DM, uncontrolled  |   2.811031   .3638148     7.99   0.000     2.181221    3.622693
            T2DM, controlled  |   1.481653   .0420754    13.84   0.000      1.40144    1.566457
          T2DM, uncontrolled  |   2.080444   .0731561    20.83   0.000      1.94189    2.228884
          Diabetes, no HbA1c  |   2.599696   .6173689     4.02   0.000      1.63223    4.140603
                              |
            cancer_exhaem_cat |
                   Last year  |    2.12379   .1491452    10.73   0.000     1.850696    2.437182
               2-5 years ago  |   1.210138   .0645622     3.58   0.000      1.08999    1.343531
                    5+ years  |   1.046114   .0363964     1.30   0.195     .9771559    1.119938
                              |
              cancer_haem_cat |
                   Last year  |   3.336348   .5141468     7.82   0.000     2.466591    4.512794
               2-5 years ago  |   2.546101   .2518576     9.45   0.000     2.097373    3.090833
                    5+ years  |   1.582998   .1368504     5.31   0.000     1.336269    1.875283
                              |
      1.chronic_liver_disease |    1.93049   .1592615     7.97   0.000     1.642272     2.26929
            1.stroke_dementia |   1.716283    .050458    18.37   0.000     1.620182    1.818084
                1.other_neuro |   2.430135   .1195756    18.05   0.000     2.206718    2.676172
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.323595   .0347427    10.68   0.000     1.257222    1.393471
           Stage 4/5 egfr<30  |   2.472977    .114245    19.60   0.000       2.2589    2.707344
                              |
                       1.esrd |    3.24954   .2887504    13.26   0.000     2.730141    3.867753
           1.other_transplant |    1.72033   .5500952     1.70   0.090     .9192434    3.219536
                   1.asplenia |   .9954385   .2088675    -0.02   0.983     .6597987    1.501819
           1.ra_sle_psoriasis |   1.273611    .047665     6.46   0.000     1.183534    1.370545
               1.other_immuno |   1.791523   .3139965     3.33   0.001     1.270674    2.525869
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_1.ster saved
   1:   1564.52 /        1 =    1564.5180

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,252,860             Number of obs    =   3,252,860
No. of failures      =        8,133
Time at risk         =    592852064
                                                Wald chi2(39)    =    15613.08
Log pseudolikelihood =    -90154.06             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,464,680 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |    .879399   .1064926    -1.06   0.289     .6935983    1.114972
                 1 child <12  |    .933605   .1011579    -0.63   0.526     .7549771    1.154496
              2 children <12  |    .906038   .1415549    -0.63   0.528     .6670509    1.230648
             3+ children <12  |   1.124818   .2686615     0.49   0.622     .7043257    1.796349
                              |
                         age1 |   1.025351    .014556     1.76   0.078     .9972153    1.054281
                         age2 |   1.258203   .0697391     4.14   0.000      1.12868     1.40259
                         age3 |   .5804189   .0813163    -3.88   0.000     .4410509    .7638259
                       1.male |   1.773041   .0420252    24.16   0.000     1.692557    1.857352
                              |
                          imd |
                           2  |   1.112683   .0401562     2.96   0.003     1.036697    1.194238
                           3  |   1.211392   .0437993     5.30   0.000     1.128519    1.300352
                           4  |   1.414052   .0514788     9.52   0.000     1.316671    1.518636
             5 most deprived  |   1.627351   .0624791    12.68   0.000     1.509388    1.754533
                              |
                tot_adults_hh |
                           2  |   .8076529   .0209124    -8.25   0.000      .767688    .8496984
                           3  |   .9734284   .0375687    -0.70   0.485     .9025112    1.049918
                              |
           1.htdiag_or_highbp |    .945818   .0261589    -2.01   0.044     .8959123    .9985037
1.chronic_respiratory_disease |   1.848034   .0498994    22.74   0.000     1.752775    1.948469
                     1.asthma |   1.108816   .0351031     3.26   0.001     1.042107    1.179796
    1.chronic_cardiac_disease |   1.376122   .0335566    13.09   0.000     1.311899    1.443488
                              |
                      diabcat |
            T1DM, controlled  |   1.824674   .3945456     2.78   0.005      1.19435    2.787654
          T1DM, uncontrolled  |   2.810631   .3637796     7.98   0.000     2.180886     3.62222
            T2DM, controlled  |    1.48167   .0420744    13.85   0.000     1.401458    1.566472
          T2DM, uncontrolled  |   2.080069   .0731518    20.83   0.000     1.941524    2.228501
          Diabetes, no HbA1c  |   2.601563   .6178151     4.03   0.000     1.633399    4.143586
                              |
            cancer_exhaem_cat |
                   Last year  |   2.123646   .1491436    10.72   0.000     1.850556    2.437036
               2-5 years ago  |   1.210191   .0645639     3.58   0.000     1.090039    1.343587
                    5+ years  |   1.046223   .0363985     1.30   0.194     .9772616    1.120052
                              |
              cancer_haem_cat |
                   Last year  |   3.336963   .5142424     7.82   0.000     2.467045    4.513628
               2-5 years ago  |   2.546437   .2518905     9.45   0.000      2.09765     3.09124
                    5+ years  |   1.582425   .1368258     5.31   0.000     1.335744    1.874662
                              |
      1.chronic_liver_disease |   1.929193   .1591396     7.97   0.000     1.641194    2.267731
            1.stroke_dementia |   1.716213   .0504574    18.37   0.000     1.620114    1.818013
                1.other_neuro |   2.430095   .1195713    18.05   0.000     2.206685    2.676123
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.323685   .0347457    10.68   0.000     1.257307    1.393568
           Stage 4/5 egfr<30  |   2.473162   .1142592    19.60   0.000     2.259058    2.707558
                              |
                       1.esrd |   3.248155   .2886757    13.26   0.000     2.728898    3.866217
           1.other_transplant |   1.722907   .5509338     1.70   0.089     .9206043    3.224411
                   1.asplenia |   .9956533   .2089131    -0.02   0.983     .6599403    1.502144
           1.ra_sle_psoriasis |   1.273597   .0476649     6.46   0.000      1.18352     1.37053
               1.other_immuno |   1.791601   .3139988     3.33   0.001     1.270745    2.525947
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_icu_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_covid_death_icu.log
  log type:  text
 closed on:  27 Aug 2020, 02:46:32
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
