------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_shield_covid_death_icu.log
  log type:  text
 opened on:  26 Aug 2020, 18:36:56

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6. stcox   `exposure'                                                              ///
>                         $demogadjlist                                                   ///
>                         $comordidadjlist                                                ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3.         
. 
. 
. foreach int_type in shield {
  4. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  5. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  6. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
  7. if _rc==0{
  8. testparm 1.`int_type'#i.`exposure_type'
  9. di _n "`exposure_type' <66" _n "****************"
 10. lincom 2.`exposure_type', eform
 11. di "`exposure_type' 66+" _n "****************"
 12. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 13. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 14. }
 15. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. 
. }
 18. }

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -33915.463
Iteration 1:   log pseudolikelihood = -32703.171
Iteration 2:   log pseudolikelihood =  -31565.19
Iteration 3:   log pseudolikelihood = -31209.466
Iteration 4:   log pseudolikelihood = -31197.055
Iteration 5:   log pseudolikelihood = -31196.978
Iteration 6:   log pseudolikelihood = -31196.978
Refining estimates:
Iteration 0:   log pseudolikelihood = -31196.978

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  11,870,825
No. of failures      =        2,587
Time at risk         =   2182954615
                                                Wald chi2(37)    =     8788.66
Log pseudolikelihood =   -31196.978             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9861469   .0611351    -0.23   0.822     .8733177    1.113553
               Kids under 18  |   1.077788   .0780625     1.03   0.301      .935152     1.24218
                              |
                         age1 |   1.140292   .0245223     6.10   0.000     1.093228    1.189382
                         age2 |   .9210695   .0456379    -1.66   0.097      .835827    1.015006
                         age3 |   1.096849    .132297     0.77   0.443     .8659216     1.38936
                       1.male |   1.674619   .0699093    12.35   0.000     1.543055    1.817401
                              |
                          imd |
                           2  |    1.12891   .0829692     1.65   0.099     .9774633    1.303822
                           3  |   1.261261   .0906552     3.23   0.001     1.095528    1.452066
                           4  |   1.601459    .109711     6.87   0.000      1.40024    1.831593
             5 most deprived  |   1.709512   .1212794     7.56   0.000     1.487595    1.964535
                              |
                tot_adults_hh |
                           2  |   .8894845   .0472581    -2.20   0.028     .8015197    .9871032
                           3  |   1.158971   .0600256     2.85   0.004     1.047097    1.282797
                              |
           1.htdiag_or_highbp |      1.613     .07409    10.41   0.000     1.474131    1.764951
1.chronic_respiratory_disease |   2.354875   .1581954    12.75   0.000     2.064362     2.68627
                     1.asthma |    1.23254   .0625376     4.12   0.000     1.115866    1.361413
    1.chronic_cardiac_disease |   1.417989   .0894136     5.54   0.000     1.253138    1.604526
                              |
                      diabcat |
            T1DM, controlled  |   1.897609    .579812     2.10   0.036     1.042613    3.453745
          T1DM, uncontrolled  |   2.753484   .4444486     6.27   0.000     2.006723    3.778137
            T2DM, controlled  |   2.410611   .1553696    13.65   0.000     2.124542      2.7352
          T2DM, uncontrolled  |   3.789158    .230748    21.88   0.000     3.362848    4.269512
          Diabetes, no HbA1c  |   3.648048   1.300354     3.63   0.000     1.814046     7.33623
                              |
            cancer_exhaem_cat |
                   Last year  |   3.647276   .5488294     8.60   0.000     2.715706    4.898402
               2-5 years ago  |   1.908273   .2364225     5.22   0.000     1.496863    2.432757
                    5+ years  |   1.141378   .1451251     1.04   0.298     .8896104    1.464397
                              |
              cancer_haem_cat |
                   Last year  |   5.276419   1.789122     4.91   0.000     2.714656    10.25566
               2-5 years ago  |   5.345798   1.060974     8.45   0.000     3.623061    7.887684
                    5+ years  |   2.018697   .4323359     3.28   0.001       1.3267    3.071634
                              |
      1.chronic_liver_disease |   2.309824   .2560741     7.55   0.000     1.858712    2.870421
            1.stroke_dementia |   1.761065   .1618987     6.16   0.000     1.470695    2.108765
                1.other_neuro |   3.138752   .3403412    10.55   0.000     2.537813    3.881991
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |      2.327   .1837944    10.69   0.000     1.993267    2.716609
           Stage 4/5 egfr<30  |   3.859223   .6428836     8.11   0.000     2.784221    5.349291
                              |
                       1.esrd |   3.392424   .5644104     7.34   0.000     2.448457    4.700323
           1.other_transplant |   .6269637   .2688935    -1.09   0.276     .2705063     1.45314
                   1.asplenia |    2.16739   .5554643     3.02   0.003     1.311562    3.581667
           1.ra_sle_psoriasis |   1.193711   .0893593     2.37   0.018     1.030812    1.382352
               1.other_immuno |   2.352035   .4035351     4.99   0.000     1.680368    3.292177
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   5267.91 /        1 =    5267.9120

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -33915.463
Iteration 1:   log pseudolikelihood = -32702.904
Iteration 2:   log pseudolikelihood = -31561.781
Iteration 3:   log pseudolikelihood = -31208.744
Iteration 4:   log pseudolikelihood = -31196.424
Iteration 5:   log pseudolikelihood = -31196.352
Iteration 6:   log pseudolikelihood = -31196.352
Refining estimates:
Iteration 0:   log pseudolikelihood = -31196.352

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  11,870,825
No. of failures      =        2,587
Time at risk         =   2182954615
                                                Wald chi2(39)    =     8774.18
Log pseudolikelihood =   -31196.352             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |     .94605   .0690415    -0.76   0.447     .8199635    1.091525
               Kids under 18  |    1.06233   .0916521     0.70   0.483     .8970621    1.258046
                              |
                         age1 |   1.140865    .024583     6.12   0.000     1.093687    1.190079
                         age2 |   .9198272   .0456524    -1.68   0.092     .8345643    1.013801
                         age3 |    1.10035    .132911     0.79   0.429     .8683895    1.394271
                       1.male |   1.674257   .0699072    12.34   0.000     1.542698    1.817035
                              |
                          imd |
                           2  |   1.128875   .0829669     1.65   0.099     .9774321    1.303782
                           3  |   1.261456   .0906775     3.23   0.001     1.095683    1.452309
                           4  |   1.602226    .109764     6.88   0.000      1.40091    1.832471
             5 most deprived  |   1.710263   .1213704     7.56   0.000     1.488184    1.965482
                              |
                tot_adults_hh |
                           2  |   .8898895   .0472708    -2.20   0.028     .8019003    .9875334
                           3  |   1.158111   .0599834     2.83   0.005     1.046316    1.281851
                              |
           1.htdiag_or_highbp |   1.612275   .0740545    10.40   0.000     1.473473    1.764153
1.chronic_respiratory_disease |   2.342426   .1568578    12.71   0.000     2.054311    2.670949
                     1.asthma |   1.209239   .0662581     3.47   0.001     1.086106    1.346332
    1.chronic_cardiac_disease |   1.417784   .0894076     5.54   0.000     1.252945     1.60431
                              |
                      diabcat |
            T1DM, controlled  |   1.900386    .580505     2.10   0.036     1.044307    3.458245
          T1DM, uncontrolled  |   2.752183   .4442089     6.27   0.000     2.005818    3.776272
            T2DM, controlled  |   2.410653   .1553991    13.65   0.000     2.124532    2.735307
          T2DM, uncontrolled  |   3.789891   .2308145    21.88   0.000      3.36346    4.270386
          Diabetes, no HbA1c  |   3.641294   1.297871     3.63   0.000      1.81076    7.322351
                              |
            cancer_exhaem_cat |
                   Last year  |   3.614014   .5439789     8.54   0.000     2.690714    4.854138
               2-5 years ago  |   1.891251   .2356813     5.11   0.000      1.48141    2.414477
                    5+ years  |   1.132301   .1445028     0.97   0.330     .8817242     1.45409
                              |
              cancer_haem_cat |
                   Last year  |   5.236258   1.775731     4.88   0.000     2.693765    10.17846
               2-5 years ago  |    5.30314   1.050804     8.42   0.000     3.596414    7.819815
                    5+ years  |   2.003735   .4284033     3.25   0.001     1.317806    3.046697
                              |
      1.chronic_liver_disease |    2.30974   .2560721     7.55   0.000     1.858633    2.870335
            1.stroke_dementia |   1.760677   .1618691     6.15   0.000      1.47036    2.108315
                1.other_neuro |   3.138218   .3402607    10.55   0.000     2.537416    3.881276
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.327241   .1837852    10.70   0.000     1.993522    2.716827
           Stage 4/5 egfr<30  |   3.859205   .6424418     8.11   0.000     2.784828    5.348073
                              |
                       1.esrd |   3.354187   .5568498     7.29   0.000     2.422556     4.64409
           1.other_transplant |   .6272469   .2689054    -1.09   0.277     .2707211    1.453299
                   1.asplenia |    2.15324   .5519526     2.99   0.003     1.302864    3.558656
           1.ra_sle_psoriasis |   1.193327   .0893281     2.36   0.018     1.030485    1.381902
               1.other_immuno |   2.326874   .3992564     4.92   0.000     1.662339    3.257063
                              |
             shield#kids_cat3 |
             1#Kids under 12  |   1.139414   .1359171     1.09   0.274     .9018708    1.439523
             1#Kids under 18  |   1.042534   .1511904     0.29   0.774     .7845977    1.385266
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   4935.30 /        1 =    4935.3000

 ( 1)  1.shield#1.kids_cat3 = 0
 ( 2)  1.shield#2.kids_cat3 = 0

           chi2(  2) =    1.23
         Prob > chi2 =    0.5412

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.06233   .0916521     0.70   0.483     .8970621    1.258046
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.shield#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.107515   .1350587     0.84   0.402     .8720626    1.406538
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster not found)
file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster saved

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -99539.034
Iteration 1:   log pseudolikelihood = -94954.571
Iteration 2:   log pseudolikelihood =  -93985.59
Iteration 3:   log pseudolikelihood = -93950.835
Iteration 4:   log pseudolikelihood = -93949.535
Iteration 5:   log pseudolikelihood = -93949.531
Refining estimates:
Iteration 0:   log pseudolikelihood = -93949.531

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   3,329,528
No. of failures      =        8,460
Time at risk         =    606783707
                                                Wald chi2(37)    =    16248.27
Log pseudolikelihood =   -93949.531             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9151181   .0771293    -1.05   0.293     .7757734    1.079492
               Kids under 18  |   .8971764   .1037626    -0.94   0.348     .7152081    1.125442
                              |
                         age1 |   1.027647   .0143247     1.96   0.050     .9999515     1.05611
                         age2 |   1.255624   .0683125     4.18   0.000     1.128626    1.396913
                         age3 |   .5807068   .0798439    -3.95   0.000     .4435285    .7603128
                       1.male |   1.766615   .0411059    24.46   0.000     1.687858    1.849046
                              |
                          imd |
                           2  |    1.11132   .0394285     2.97   0.003     1.036667    1.191349
                           3  |   1.226652   .0434676     5.76   0.000     1.144348    1.314875
                           4  |    1.41484   .0506438     9.69   0.000     1.318982    1.517665
             5 most deprived  |    1.64336   .0620052    13.17   0.000     1.526216    1.769494
                              |
                tot_adults_hh |
                           2  |   .7979049   .0203297    -8.86   0.000     .7590379    .8387621
                           3  |   .9908582    .037409    -0.24   0.808     .9201849    1.066959
                              |
           1.htdiag_or_highbp |   .9404261   .0254774    -2.27   0.023     .8917939    .9917103
1.chronic_respiratory_disease |    1.83096    .048532    22.82   0.000     1.738268    1.928595
                     1.asthma |    1.11198   .0344835     3.42   0.001     1.046406    1.181663
    1.chronic_cardiac_disease |   1.370588   .0327828    13.18   0.000     1.307818    1.436371
                              |
                      diabcat |
            T1DM, controlled  |   1.752454   .3791846     2.59   0.010     1.146751    2.678083
          T1DM, uncontrolled  |   2.929448   .3651521     8.62   0.000     2.294481    3.740133
            T2DM, controlled  |   1.479239   .0412423    14.04   0.000     1.400575    1.562322
          T2DM, uncontrolled  |   2.077118    .071641    21.19   0.000     1.941345    2.222386
          Diabetes, no HbA1c  |    2.36094   .5599689     3.62   0.000     1.483189    3.758143
                              |
            cancer_exhaem_cat |
                   Last year  |   2.138146   .1465071    11.09   0.000     1.869444    2.445469
               2-5 years ago  |   1.193226    .062967     3.35   0.001     1.075981    1.323248
                    5+ years  |   1.058688   .0359967     1.68   0.093     .9904351    1.131644
                              |
              cancer_haem_cat |
                   Last year  |    3.41196   .5091278     8.22   0.000     2.546765    4.571082
               2-5 years ago  |   2.467354   .2439607     9.13   0.000     2.032678    2.994984
                    5+ years  |   1.565263   .1334366     5.26   0.000     1.324413    1.849912
                              |
      1.chronic_liver_disease |   1.998673    .159107     8.70   0.000      1.70994    2.336161
            1.stroke_dementia |   1.730123   .0497328    19.07   0.000     1.635344    1.830396
                1.other_neuro |   2.450434   .1173386    18.72   0.000     2.230917    2.691552
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.313132   .0338079    10.58   0.000     1.248514    1.381095
           Stage 4/5 egfr<30  |    2.43685   .1106434    19.62   0.000     2.229362    2.663649
                              |
                       1.esrd |   3.207813   .2811336    13.30   0.000     2.701528    3.808979
           1.other_transplant |   1.799252   .5504731     1.92   0.055     .9878042    3.277278
                   1.asplenia |   1.036359   .2087033     0.18   0.859     .6983835    1.537893
           1.ra_sle_psoriasis |    1.27176   .0466856     6.55   0.000     1.183472    1.366634
               1.other_immuno |   1.778282   .3070071     3.33   0.001     1.267789    2.494332
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   1627.70 /        1 =    1627.6970

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -99539.034
Iteration 1:   log pseudolikelihood = -94954.311
Iteration 2:   log pseudolikelihood = -93985.058
Iteration 3:   log pseudolikelihood = -93950.325
Iteration 4:   log pseudolikelihood = -93949.027
Iteration 5:   log pseudolikelihood = -93949.023
Refining estimates:
Iteration 0:   log pseudolikelihood = -93949.023

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   3,329,528
No. of failures      =        8,460
Time at risk         =    606783707
                                                Wald chi2(39)    =    16247.75
Log pseudolikelihood =   -93949.023             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9343488   .1028376    -0.62   0.537     .7530484    1.159298
               Kids under 18  |   .8073128   .1312531    -1.32   0.188     .5870206    1.110274
                              |
                         age1 |   1.027626   .0143245     1.96   0.051     .9999308    1.056089
                         age2 |   1.255754    .068319     4.19   0.000     1.128743    1.397057
                         age3 |   .5805489   .0798213    -3.95   0.000     .4434093    .7601037
                       1.male |   1.766585   .0411062    24.46   0.000     1.687828    1.849018
                              |
                          imd |
                           2  |   1.111354   .0394306     2.98   0.003     1.036698    1.191387
                           3  |   1.226733   .0434727     5.77   0.000      1.14442    1.314967
                           4  |   1.414845   .0506446     9.69   0.000     1.318985    1.517671
             5 most deprived  |   1.643428   .0620088    13.17   0.000     1.526278     1.76957
                              |
                tot_adults_hh |
                           2  |   .7979007   .0203293    -8.86   0.000     .7590344    .8387571
                           3  |    .990871   .0374081    -0.24   0.808     .9201993     1.06697
                              |
           1.htdiag_or_highbp |   .9403895   .0254778    -2.27   0.023     .8917566    .9916746
1.chronic_respiratory_disease |   1.829814   .0486216    22.74   0.000     1.736956    1.927636
                     1.asthma |   1.111179   .0345554     3.39   0.001     1.045475    1.181013
    1.chronic_cardiac_disease |   1.370521    .032783    13.18   0.000      1.30775    1.436304
                              |
                      diabcat |
            T1DM, controlled  |   1.749526   .3788289     2.58   0.010     1.144479    2.674441
          T1DM, uncontrolled  |   2.930182   .3652668     8.62   0.000     2.295021    3.741128
            T2DM, controlled  |   1.479258   .0412425    14.04   0.000     1.400593    1.562341
          T2DM, uncontrolled  |    2.07723   .0716463    21.19   0.000     1.941447     2.22251
          Diabetes, no HbA1c  |   2.361205   .5600187     3.62   0.000     1.483371    3.758524
                              |
            cancer_exhaem_cat |
                   Last year  |   2.136851   .1464735    11.08   0.000     1.868217    2.444112
               2-5 years ago  |   1.192464   .0629637     3.33   0.001     1.075228    1.322482
                    5+ years  |   1.058121   .0360127     1.66   0.097     .9898399    1.131112
                              |
              cancer_haem_cat |
                   Last year  |   3.411128    .508988     8.22   0.000     2.546167    4.569926
               2-5 years ago  |   2.466159   .2439213     9.13   0.000     2.031566     2.99372
                    5+ years  |   1.564275   .1334234     5.25   0.000     1.323459    1.848909
                              |
      1.chronic_liver_disease |   1.998056   .1591122     8.69   0.000      1.70932    2.335564
            1.stroke_dementia |   1.730133   .0497333    19.07   0.000     1.635352    1.830406
                1.other_neuro |   2.449946   .1173318    18.71   0.000     2.230443    2.691051
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.313059   .0338042    10.58   0.000     1.248447    1.381014
           Stage 4/5 egfr<30  |   2.436954    .110642    19.62   0.000     2.229468     2.66375
                              |
                       1.esrd |    3.20571   .2811314    13.28   0.000     2.699457    3.806906
           1.other_transplant |   1.799294   .5505161     1.92   0.055     .9877946    3.277462
                   1.asplenia |   1.036043   .2086422     0.18   0.860     .6981679    1.537432
           1.ra_sle_psoriasis |   1.271672   .0466834     6.55   0.000     1.183388    1.366542
               1.other_immuno |   1.777902   .3069235     3.33   0.001     1.267543    2.493749
                              |
             shield#kids_cat3 |
             1#Kids under 12  |   .9544333   .1535734    -0.29   0.772      .696278    1.308303
             1#Kids under 18  |   1.239347   .2736423     0.97   0.331     .8039912    1.910444
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   1699.67 /        1 =    1699.6750

 ( 1)  1.shield#1.kids_cat3 = 0
 ( 2)  1.shield#2.kids_cat3 = 0

           chi2(  2) =    1.03
         Prob > chi2 =    0.5961

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8073128   .1312531    -1.32   0.188     .5870206    1.110274
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.shield#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.00054    .157361     0.00   0.997     .7351249    1.361784
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster not found)
file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_shield_covid_death_icu.log
  log type:  text
 closed on:  26 Aug 2020, 22:23:55
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
