------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\WORMS_01_cr_analysis_dataset.log
  log type:  text
 opened on:  26 Aug 2020, 18:46:32

. 
. /* CONVERT STRINGS TO DATE====================================================*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                                                                                       */
. 
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(22,812,292 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(1,327,430 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(412,484 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes  ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 permanent_immunodeficiency  ///
>                                                 temporary_immunodeficiency  ///
>                                                 dialysis                                        ///
>                                                 kidney_transplant                       ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 dereg_date ///
>                                                 worms ///
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(22,916,296 real changes made)
(22,107,004 real changes made)
(22,107,004 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(22,916,296 real changes made)
(21,553,200 real changes made)
(21,553,200 missing values generated)
variable diabetes was str7 now str10
(22,916,296 real changes made)
(21,072,378 real changes made)
(21,072,378 missing values generated)
variable cancer_haem was str7 now str10
(22,916,296 real changes made)
(22,796,884 real changes made)
(22,796,884 missing values generated)
variable cancer_nonhaem was str7 now str10
(22,916,296 real changes made)
(21,914,172 real changes made)
(21,914,172 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(22,916,296 real changes made)
(22,865,200 real changes made)
(22,865,200 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(22,916,296 real changes made)
(22,910,757 real changes made)
(22,910,757 missing values generated)
variable dialysis was str7 now str10
(22,916,296 real changes made)
(22,892,169 real changes made)
(22,892,169 missing values generated)
variable kidney_transplant was str7 now str10
(22,916,296 real changes made)
(22,900,528 real changes made)
(22,900,528 missing values generated)
variable other_transplant was str7 now str10
(22,916,296 real changes made)
(22,911,281 real changes made)
(22,911,281 missing values generated)
variable asplenia was str7 now str10
(22,916,296 real changes made)
(22,888,555 real changes made)
(22,888,555 missing values generated)
variable chronic_liver_disease was str7 now str10
(22,916,296 real changes made)
(22,797,604 real changes made)
(22,797,604 missing values generated)
variable other_neuro was str7 now str10
(22,916,296 real changes made)
(22,709,882 real changes made)
(22,709,882 missing values generated)
variable stroke_dementia was str7 now str10
(22,916,296 real changes made)
(22,438,602 real changes made)
(22,438,602 missing values generated)
variable esrf was str7 now str10
(22,916,296 real changes made)
(22,886,958 real changes made)
(22,886,958 missing values generated)
variable hypertension was str7 now str10
(22,916,296 real changes made)
(18,910,613 real changes made)
(18,910,613 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(22,916,296 real changes made)
(21,942,852 real changes made)
(21,942,852 missing values generated)
variable bmi_date_measured was str7 now str10
(22,916,296 real changes made)
(7,990,472 real changes made)
(7,990,472 missing values generated)
variable bp_sys_date_measured was str7 now str10
(22,916,296 real changes made)
(6,037,383 real changes made)
(6,037,383 missing values generated)
variable bp_dias_date_measured was str7 now str10
(22,916,296 real changes made)
(6,040,678 real changes made)
(6,040,678 missing values generated)
variable creatinine_date was str7 now str10
(22,916,296 real changes made)
(8,995,639 real changes made)
(8,995,639 missing values generated)
variable smoking_status_date was str7 now str10
(22,916,296 real changes made)
(4,593,769 real changes made)
(4,593,769 missing values generated)
variable dereg_date was str7 now str10
(22,916,296 real changes made)
(22,565,085 real changes made)
(22,565,085 missing values generated)
variable worms was str7 now str10
(22,916,296 real changes made)
(22,504,811 real changes made)
(22,504,811 missing values generated)

. 
. * Recode to dates from the strings 
. foreach var of varlist  died_date_ons                           {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td 
  7.         
. }
(22,611,512 missing values generated)

. 
. /*Tab all variables in initial extract*/
. sum, d f

                         patient_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%       416373           2878
 5%      1987119           7276
10%      4091059           9969       Obs          22,916,296
25%     1.02e+07           9970       Sum of Wgt.    22916296

50%     2.11e+07                      Mean           2.23e+07
                        Largest       Std. Dev.      1.41e+07
75%     3.37e+07       5.34e+07
90%     4.33e+07       5.34e+07       Variance       1.99e+14
95%     4.65e+07       5.34e+07       Skewness       .2482148
99%     4.96e+07       5.34e+07       Kurtosis       1.946638

                       dereg_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2020      15feb2020
 5%    15feb2020      15feb2020
10%    15feb2020      15feb2020       Obs             351,211
25%    15mar2020      15feb2020       Sum of Wgt.     351,211

50%    15may2020                      Mean          06may2020
                        Largest       Std. Dev.      74.42472
75%    15jun2020      15aug2020
90%    15jul2020      15aug2020       Variance       5539.039
95%    15aug2020      15aug2020       Skewness       125.3913
99%    15aug2020      15apr2092       Kurtosis       44243.68

                         worms_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15dec1985      15dec1899
 5%    15jun1991      15dec1899
10%    15nov1993      15dec1899       Obs             411,485
25%    15dec2001      15dec1899       Sum of Wgt.     411,485

50%    15apr2008                      Mean          05sep2006
                        Largest       Std. Dev.      3183.525
75%    15oct2012      15aug2020
90%    15may2016      15aug2020       Variance       1.01e+07
95%    15dec2017      15aug2020       Skewness      -1.660786
99%    15nov2019      15aug2020       Kurtosis       13.92783

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              0
 5%            4              0
10%            9              0       Obs          22,916,296
25%           22              0       Sum of Wgt.    22916296

50%           40                      Mean           40.91502
                        Largest       Std. Dev.      23.41906
75%           59            119
90%           73            119       Variance       548.4523
95%           80            119       Skewness       .1113665
99%           89            120       Kurtosis       2.063502

                             sex
-------------------------------------------------------------
no observations

                             imd
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%         1200             -1
10%         2800             -1       Obs          22,916,296
25%         7700             -1       Sum of Wgt.    22916296

50%        16000                      Mean           15922.43
                        Largest       Std. Dev.      9469.469
75%        24000          32800
90%        29100          32800       Variance       8.97e+07
95%        30900          32800       Skewness       .0144456
99%        32400          32800       Kurtosis       1.820129

                             stp
-------------------------------------------------------------
no observations

                          ethnicity
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs          16,509,966
25%            1              1       Sum of Wgt.    16509966

50%            1                      Mean           1.373538
                        Largest       Std. Dev.      .9383894
75%            1              5
90%            3              5       Variance       .8805746
95%            4              5       Skewness       2.493443
99%            5              5       Kurtosis       8.247959

                       ethnicity_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%         2003           1888
 5%         2007           1899
10%         2008           1899       Obs          16,509,966
25%         2010           1899       Sum of Wgt.    16509966

50%         2013                      Mean           2012.622
                        Largest       Std. Dev.      8.199319
75%         2016           2075
90%         2018           2081       Variance       67.22884
95%         2019           2092       Skewness      -10.27342
99%         2020           2095       Kurtosis        140.089

                        household_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          22,916,296
25%      1020154              0       Sum of Wgt.    22916296

50%      3869335                      Mean            4004969
                        Largest       Std. Dev.       3079297
75%      6656013        9678972
90%      8434930        9678973       Variance       9.48e+12
95%      9043142        9678975       Skewness       .1782337
99%      9561159        9678975       Kurtosis        1.72165

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          22,916,296
25%            1              0       Sum of Wgt.    22916296

50%            2                      Mean           4.287273
                        Largest       Std. Dev.      40.91073
75%            4           2590
90%            5           2590       Variance       1673.688
95%            6           2590       Skewness       37.70499
99%           12           2590       Kurtosis       1796.327

                       care_home_type
-------------------------------------------------------------
no observations

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0        -3460.2
 5%            0         -277.8
10%            0           -2.1       Obs          22,916,296
25%            0           -1.8       Sum of Wgt.    22916296

50%         22.9                      Mean           58.87309
                        Largest       Std. Dev.      8065.493
75%         28.1        1520000
90%         33.1        1805556       Variance       6.51e+07
95%         36.6       1.95e+07       Skewness       2550.823
99%         44.9       2.85e+07       Kurtosis        8286123

                   bmi_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug2010      15feb2010
 5%    15apr2012      15feb2010
10%    15oct2013      15feb2010       Obs          14,925,824
25%    15may2016      15feb2010       Sum of Wgt.    14925824

50%    15sep2018                      Mean          10oct2017
                        Largest       Std. Dev.      1822.899
75%    15oct2019      15mar9909
90%    15feb2020      15apr9909       Variance        3322960
95%    15jun2020      15apr9912       Skewness       1129.914
99%    15aug2020      15jul9935       Kurtosis        1749226

                           bp_sys
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs          22,916,296
25%            0             -1       Sum of Wgt.    22916296

50%          120                      Mean           93.14858
                        Largest       Std. Dev.      66.39086
75%          132          14090
90%          142          14292       Variance       4407.746
95%          149          15090       Skewness       343.2612
99%          167         130170       Kurtosis         645914

                  bp_sys_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan2003      15jan1860
 5%    15mar2010      15sep1899
10%    15mar2013      15dec1899       Obs          16,878,913
25%    15apr2016      15dec1899       Sum of Wgt.    16878913

50%    15feb2018                      Mean          24oct2016
                        Largest       Std. Dev.      1257.545
75%    15sep2018      15feb2019
90%    15dec2018      15feb2019       Variance        1581420
95%    15jan2019      15feb2019       Skewness      -5.428459
99%    15jan2019      15feb2019       Kurtosis       107.1774

                           bp_dias
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs          22,916,296
25%            0             -1       Sum of Wgt.    22916296

50%           70                      Mean           55.94954
                        Largest       Std. Dev.      48.94462
75%           80          10070
90%           86          83135       Variance       2395.576
95%           90          89147       Skewness       973.6248
99%          100         110080       Kurtosis        1955830

                 bp_dias_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2003      15jan1860
 5%    15mar2010      15sep1899
10%    15mar2013      15dec1899       Obs          16,875,618
25%    15apr2016      15dec1899       Sum of Wgt.    16875618

50%    15feb2018                      Mean          25oct2016
                        Largest       Std. Dev.      1228.612
75%    15sep2018      15feb2019
90%    15dec2018      15feb2019       Variance        1509488
95%    15jan2019      15feb2019       Skewness      -4.192253
99%    15jan2019      15feb2019       Kurtosis        61.1051

                         creatinine
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0            -40
 5%            0             -1
10%            0             -1       Obs          22,916,296
25%            0             -1       Sum of Wgt.    22916296

50%           59                      Mean           1412.534
                        Largest       Std. Dev.      336373.8
75%           77       1.19e+08
90%           92       1.20e+08       Variance       1.13e+11
95%          101       1.21e+08       Skewness        258.435
99%          130       1.58e+08       Kurtosis       69290.04

                    creatinine_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun2004      15dec1899
 5%    15mar2010      15dec1899
10%    15oct2012      15dec1899       Obs          13,920,657
25%    15jan2016      15jan1900       Sum of Wgt.    13920657

50%    15jan2018                      Mean          04oct2016
                        Largest       Std. Dev.      1149.849
75%    15sep2018      15feb2019
90%    15dec2018      15feb2019       Variance        1322152
95%    15jan2019      15feb2019       Skewness      -3.937157
99%    15jan2019      15feb2019       Kurtosis        72.5936

                       smoking_status
-------------------------------------------------------------
no observations

                  smoking_status_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul2004      15sep1899
 5%    15jul2009      15sep1899
10%    15feb2012      15sep1899       Obs          18,322,527
25%    15nov2014      15sep1899       Sum of Wgt.    18322527

50%    15jun2017                      Mean          21mar2016
                        Largest       Std. Dev.       1277.52
75%    15jul2018      15feb2019
90%    15nov2018      15feb2019       Variance        1632057
95%    15dec2018      15feb2019       Skewness      -5.332697
99%    15jan2019      15feb2019       Kurtosis       120.8582

              chronic_respiratory_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jul1991      15jan1840
10%    15mar2001      15jan1860       Obs             809,292
25%    15aug2007      15dec1899       Sum of Wgt.     809,292

50%    15mar2013                      Mean          18mar2009
                        Largest       Std. Dev.      6368.656
75%    15feb2017      15aug2020
90%    15feb2019      15aug2020       Variance       4.06e+07
95%    15oct2019      15aug2020       Skewness      -4.806211
99%    15apr2020      15aug2020       Kurtosis       29.14623

                chronic_cardiac_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1840
 5%    15jul1986      15dec1840
10%    15may1994      15jan1850       Obs           1,363,096
25%    15may2003      15jan1850       Sum of Wgt.   1,363,096

50%    15mar2011                      Mean          21nov2006
                        Largest       Std. Dev.      6596.076
75%    15aug2016      15aug2020
90%    15jan2019      15aug2020       Variance       4.35e+07
95%    15oct2019      15aug2020       Skewness      -4.229083
99%    15jun2020      15aug2020       Kurtosis       24.65933

                        diabetes_type
-------------------------------------------------------------
no observations

                     diabetes_exeter_os
-------------------------------------------------------------
no observations

                       diabetes_exeter
-------------------------------------------------------------
no observations

                     hba1c_mmol_per_mol
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0           -782
 5%            0             -2
10%            0             -1       Obs          22,916,296
25%            0             -1       Sum of Wgt.    22916296

50%            0                      Mean           18.46798
                        Largest       Std. Dev.      1828.616
75%           37         107000
90%           42         111000       Variance        3343838
95%           47         759550       Skewness       4683.302
99%           73        8688000       Kurtosis       2.22e+07

                   hba1c_mmol_per_mol_date
-------------------------------------------------------------
no observations

                      hba1c_percentage
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -1
10%            0             -1       Obs          22,916,296
25%            0             -1       Sum of Wgt.    22916296

50%            0                      Mean           1.579944
                        Largest       Std. Dev.      3997.427
75%            0            935
90%          5.1         231855       Variance       1.60e+07
95%          5.8         930709       Skewness       4769.625
99%          7.7       1.91e+07       Kurtosis       2.28e+07

                    hba1c_percentage_date
-------------------------------------------------------------
no observations

                      cancer_haem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1840
 5%    15mar1986      15jan1860
10%    15jan1995      15dec1899       Obs             119,412
25%    15jul2005      15dec1899       Sum of Wgt.     119,412

50%    15feb2013                      Mean          01nov2008
                        Largest       Std. Dev.      5674.557
75%    15jul2017      15aug2020
90%    15jun2019      15aug2020       Variance       3.22e+07
95%    15dec2019      15aug2020       Skewness      -4.355581
99%    15jun2020      15aug2020       Kurtosis       29.04515

                     cancer_nonhaem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15may1970      15dec1840
 5%    15jan1991      15jan1860
10%    15sep1997      15jan1860       Obs           1,002,124
25%    15feb2006      15jan1860       Sum of Wgt.   1,002,124

50%    15feb2013                      Mean          01dec2009
                        Largest       Std. Dev.      4637.592
75%    15aug2017      15aug2020
90%    15jun2019      15aug2020       Variance       2.15e+07
95%    15dec2019      15nov2020       Skewness      -4.553452
99%    15jun2020      15dec2100       Kurtosis       36.28802

               permanent_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1900
 5%    15jan1993      15jan1900
10%    15dec1999      15jan1900       Obs              51,096
25%    15sep2006      15jan1900       Sum of Wgt.      51,096

50%    15jun2012                      Mean          05sep2008
                        Largest       Std. Dev.      6040.788
75%    15apr2016      15jan2019
90%    15feb2018      15jan2019       Variance       3.65e+07
95%    15sep2018      15jan2019       Skewness      -5.185571
99%    15jan2019      15jan2019       Kurtosis       33.68288

                        asplenia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15may1956      15dec1899
10%    15jan1967      15dec1899       Obs              27,741
25%    15oct1980      15dec1899       Sum of Wgt.      27,741

50%    15jan1999                      Mean          13may1993
                        Largest       Std. Dev.      9049.686
75%    15feb2012      15aug2020
90%    15oct2017      15aug2020       Variance       8.19e+07
95%    15mar2019      15aug2020       Skewness      -1.772977
99%    15apr2020      15aug2020       Kurtosis       7.234227

               temporary_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2018      15feb2018
 5%    15feb2018      15feb2018
10%    15mar2018      15feb2018       Obs               5,539
25%    15jun2018      15feb2018       Sum of Wgt.       5,539

50%    15sep2018                      Mean          04sep2018
                        Largest       Std. Dev.      102.1155
75%    15nov2018      15jan2019
90%    15jan2019      15jan2019       Variance       10427.58
95%    15jan2019      15jan2019       Skewness      -.4807684
99%    15jan2019      15jan2019       Kurtosis       2.099813

                 chronic_liver_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1840
 5%    15jan1992      15dec1899
10%    15sep1999      15dec1899       Obs             118,692
25%    15jun2007      15dec1899       Sum of Wgt.     118,692

50%    15mar2014                      Mean          02oct2009
                        Largest       Std. Dev.      6304.847
75%    15dec2017      15aug2020
90%    15jul2019      15aug2020       Variance       3.98e+07
95%    15jan2020      15nov2020       Skewness      -4.924215
99%    15jun2020      15oct2021       Kurtosis        30.9266

                    stroke_dementia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1899
 5%    15dec1994      15dec1899
10%    15sep2000      15dec1899       Obs             477,694
25%    15jan2008      15dec1899       Sum of Wgt.     477,694

50%    15apr2014                      Mean          08aug2010
                        Largest       Std. Dev.      5505.445
75%    15dec2017      15sep2020
90%    15jul2019      15oct2020       Variance       3.03e+07
95%    15jan2020      15nov2020       Skewness      -5.431687
99%    15jun2020      15jul2096       Kurtosis        39.0519

                      other_neuro_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jan1965      15jan1800
10%    15jun1980      15dec1899       Obs             206,414
25%    15jan1998      15dec1899       Sum of Wgt.     206,414

50%    15may2009                      Mean          05aug2002
                        Largest       Std. Dev.      8080.948
75%    15feb2016      15aug2020
90%    15oct2018      15aug2020       Variance       6.53e+07
95%    15aug2019      15aug2020       Skewness      -2.891631
99%    15may2020      15aug2020       Kurtosis       13.01573

                          esrf_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15jan1987      15dec1899
10%    15jan1996      15dec1899       Obs              29,338
25%    15apr2006      15dec1899       Sum of Wgt.      29,338

50%    15dec2013                      Mean          26sep2008
                        Largest       Std. Dev.      6724.353
75%    15dec2017      15aug2020
90%    15jul2019      15aug2020       Variance       4.52e+07
95%    15jan2020      15aug2020       Skewness      -4.405474
99%    15jul2020      15aug2020       Kurtosis       25.61048

                        dialysis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15aug1990      15dec1899
10%    15aug1998      15dec1899       Obs              24,127
25%    15jul2007      15dec1899       Sum of Wgt.      24,127

50%    15sep2014                      Mean          19nov2009
                        Largest       Std. Dev.      6304.396
75%    15apr2018      15aug2020
90%    15sep2019      15aug2020       Variance       3.97e+07
95%    15feb2020      15aug2020       Skewness      -4.804022
99%    15jul2020      15aug2020       Kurtosis       30.05462

                   kidney_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15mar1987      15dec1899
10%    15jan1994      15dec1899       Obs              15,768
25%    15jan2004      15jan1900       Sum of Wgt.      15,768

50%    15jul2011                      Mean          06oct2007
                        Largest       Std. Dev.      5585.999
75%    15jun2016      15aug2020
90%    15nov2018      15aug2020       Variance       3.12e+07
95%    15aug2019      15aug2020       Skewness      -4.431337
99%    15may2020      15aug2020       Kurtosis       30.24383

                    other_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15mar1965      15jan1900
 5%    15dec1992      15jan1900
10%    15jan1997      15jan1900       Obs               5,015
25%    15jan2004      15jan1900       Sum of Wgt.       5,015

50%    15sep2010                      Mean          11apr2008
                        Largest       Std. Dev.      4766.278
75%    15nov2015      15aug2020
90%    15aug2018      15aug2020       Variance       2.27e+07
95%    15jul2019      15aug2020       Skewness      -4.946474
99%    15apr2020      15aug2020       Kurtosis       39.73641

                      hypertension_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jan1986      15jan1800
10%    15dec1993      15jan1800       Obs           4,005,683
25%    15oct2001      15jan1800       Sum of Wgt.   4,005,683

50%    15dec2007                      Mean          01jul2004
                        Largest       Std. Dev.      7219.319
75%    15jul2014      15sep2037
90%    15feb2018      15jun2055       Variance       5.21e+07
95%    15apr2019      15nov2056       Skewness      -4.091784
99%    15mar2020      15feb2058       Kurtosis       21.82897

                    ra_sle_psoriasis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jan1972      15jan1800
10%    15jul1984      15jan1840       Obs             973,444
25%    15jan1998      15jan1840       Sum of Wgt.     973,444

50%    15jul2007                      Mean          10jul2002
                        Largest       Std. Dev.      7303.762
75%    15mar2014      15aug2020
90%    15nov2017      15aug2020       Variance       5.33e+07
95%    15feb2019      15mar2082       Skewness      -3.098595
99%    15feb2020      15mar3000       Kurtosis       22.59449

                           asthma
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          22,916,296
25%            0              0       Sum of Wgt.    22916296

50%            0                      Mean           .1610699
                        Largest       Std. Dev.      .4041328
75%            0              2
90%            1              2       Variance       .1633233
95%            1              2       Skewness       2.462909
99%            2              2       Kurtosis       8.533116

                        diabetes_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1860
 5%    15jan1995      15jan1860
10%    15nov2000      15jan1885       Obs           1,843,918
25%    15sep2006      15aug1888       Sum of Wgt.   1,843,918

50%    15mar2013                      Mean          30dec2009
                        Largest       Std. Dev.      5236.473
75%    15jun2017      15feb2020
90%    15jan2019      15feb2020       Variance       2.74e+07
95%    15jul2019      15feb2020       Skewness      -5.472355
99%    15dec2019      15feb2020       Kurtosis        40.9946

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    06feb2019      01feb2019
 5%    26feb2019      01feb2019
10%    27mar2019      01feb2019       Obs             304,784
25%    25jun2019      01feb2019       Sum of Wgt.     304,784

50%    22nov2019                      Mean          07nov2019
                        Largest       Std. Dev.      155.6177
75%    29mar2020      01aug2020
90%    23may2020      01aug2020       Variance       24216.87
95%    23jun2020      01aug2020       Skewness      -.1618526
99%    21jul2020      01aug2020       Kurtosis       1.801312

. 
. /* CREATE VARIABLES===========================================================*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(11,455,433 missing values generated)

. replace male = 0 if sex == "F"
(11,455,044 real changes made)

. 
. * Ethnicity 
. replace ethnicity = .u if ethnicity == .
(6,406,330 real changes made, 6,406,330 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                                       ///
>                                                 3 "Asian or Asian British"      ///
>                                                 4 "Black"                                       ///
>                                                 5 "Other"                                       ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(22,916,264 missing values generated)

. replace stp = sum(stp)
(22,916,295 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(22,916,296 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(146,164 real changes made, 146,164 to missing)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 18168898 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age 18/29.9999 = 1 /// 
>                    30/39.9999 = 2 /// 
>            40/49.9999 = 3 ///
>                    50/59.9999 = 4 ///
>                60/69.9999 = 5 ///
>                    70/79.9999 = 6 ///
>                    80/max = 7, gen(agegroup) 
(18311369 differences between age and agegroup)

. 
. label define agegroup   1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Create binary age (for age stratification)
. recode age min/65.999999999 = 0 ///
>            66/max = 1, gen(age66)
(22775022 differences between age and age66)

. 
. * Check there are no missing ages
. assert age < .

. assert agegroup < .

. assert age66 < .

. 
. 
. 
. 
. 
. 
. 
. /* APPLY HH level INCLUSION/EXCLUIONS==================================================*/ 
. *tab care_home_type household_size
. drop if care_home_type!="U"
(245,402 observations deleted)

. 
. count
  22,670,894

. noi di "DROP if HH ID==0"
DROP if HH ID==0

. count if household_id==0
  3,522,143

. drop if household_id==0
(3,522,143 observations deleted)

. count
  19,148,751

. 
. noi di "DROP HH>=10 persons:"
DROP HH>=10 persons:

. sum household_size, d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs          19,148,751
25%            2              1       Sum of Wgt.    19148751

50%            3                      Mean           5.011483
                        Largest       Std. Dev.        44.614
75%            4           2590
90%            5           2590       Variance       1990.409
95%            7           2590       Skewness       34.71092
99%           11           2590       Kurtosis       1517.375

. drop if household_size>=10
(300,663 observations deleted)

. count
  18,848,088

. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. recode male .=9
(male: 315 changes made)

. recode male .u=9
(male: 0 changes made)

. bysort household_id: egen male_drop=max(male)

. drop if male_drop==9
(891 observations deleted)

. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. recode age .=9
(age: 0 changes made)

. recode age .u=9
(age: 0 changes made)

. bysort household_id: egen age_drop=max(age)

. drop if age_drop==9
(13,686 observations deleted)

. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. recode imd .=9
(imd: 0 changes made)

. recode imd .u=9
(imd: 128926 changes made)

. bysort household_id: egen imd_drop=max(imd)

. drop if imd_drop==9
(162,562 observations deleted)

. 
. **************************** HOUSEHOLD VARS*******************************************
. 
. *No kids/kids under 12/up to 18
. *Identify kids under 12, or kids under 18
. gen nokids=1 if age<12
(16,014,543 missing values generated)

. recode nokids .=2 if age<18 
(nokids: 1244578 changes made)

. bysort household_id: egen min_kids=min(nokids) 
(10569271 missing values generated)

. gen kids_cat3=min_kids
(10,569,271 missing values generated)

. recode kids_cat3 .=0 
(kids_cat3: 10569271 changes made)

. lab define kids_cat3  0 "No kids" 1 "Kids under 12" 2 "Kids under 18"

. lab val kids_cat3 kids_cat3

. drop min_kids

. 
. *Dose-response exposure
. recode nokids 2=.
(nokids: 1244578 changes made)

. bysort household_id: egen number_kids=count(nokids)

. gen gp_number_kids=number_kids

. recode gp_number_kids 3/max=3
(gp_number_kids: 205618 changes made)

. recode gp_number_kids 1=2 2=3 3=4
(gp_number_kids: 6242916 changes made)

. replace gp_number_kids=0 if kids_cat3==0 
(0 real changes made)

. replace gp_number_kids=1 if kids_cat3==2 
(1,858,762 real changes made)

. 
. lab var gp_number_kids "Number kids under 12 years in hh"

. drop nokids

. lab define   gp_number_kids 0 none  1 "only >12 years" ///
> 2 "1 child <12" ///
> 3 "2 children <12" ///
> 4 "3+ children <12"

. lab val gp_number_kids gp_number_kids

. 
. tab kids_cat3 gp_number_kids, miss

              |            Number kids under 12 years in hh
    kids_cat3 |      none  only >12   1 child <  2 childre  3+ childr |     Total
--------------+-------------------------------------------------------+----------
      No kids |10,569,271          0          0          0          0 |10,569,271 
Kids under 12 |         0          0  2,996,800  2,351,757    894,359 | 6,242,916 
Kids under 18 |         0  1,858,762          0          0          0 | 1,858,762 
--------------+-------------------------------------------------------+----------
        Total |10,569,271  1,858,762  2,996,800  2,351,757    894,359 |18,670,949 

.  
. /* DROP ALL KIDS, AS HH COMPOSITION VARS ARE NOW MADE */
. drop if age<18
(3,900,984 observations deleted)

. 
. *Total number adults in household (to check hh size)
. bysort household_id: gen tot_adults_hh=_N

. recode tot_adults_hh 3/max=3
(tot_adults_hh: 1808389 changes made)

. 
. 
. /* SET FU DATES===============================================================*/ 
. * Censoring dates for each outcome (largely, last date outcome data available)
. *****NEEDS UPDATING WHEN INFO AVAILABLE*******************
. global tpp_infec_censor                 = "01/02/2020" 

. 
. *Start dates
. global indexdate                            = "01/02/2019"

. 
. 
. 
. 
. 
. 
. 
. 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. rename dereg_date_date                                          dereg_date

. 
. /* CREATE BINARY VARIABLES====================================================*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes_date  ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 dialysis                                        ///
>                                                 kidney_transplant                       ///
>                                                 other_transplant                        ///                     /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         
. }

. 
. 
. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(2,790,487 real changes made, 2,790,487 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(112,510 real changes made, 112,510 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(2,739,132 missing values generated)

. gen bmi_age = age - bmi_time
(2,739,132 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(32,116 real changes made, 32,116 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(195,981 real changes made, 195,981 to missing)

. replace bmi_measured = . if bmi == . 
(2,935,113 real changes made, 2,935,113 to missing)

. 
. gen     bmicat = .
(14,769,965 missing values generated)

. recode  bmicat . = 1 if bmi < 18.5
(bmicat: 260347 changes made)

. recode  bmicat . = 2 if bmi < 25
(bmicat: 4154736 changes made)

. recode  bmicat . = 3 if bmi < 30
(bmicat: 4099399 changes made)

. recode  bmicat . = 4 if bmi < 35
(bmicat: 2092815 changes made)

. recode  bmicat . = 5 if bmi < 40
(bmicat: 814735 changes made)

. recode  bmicat . = 6 if bmi < .
(bmicat: 412820 changes made)

. replace bmicat = .u if bmi >= .
(2,935,113 real changes made, 2,935,113 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Create less  granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(14509618 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(7,976,955 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(4,831,986 real changes made)

. replace smoke = 3  if smoking_status == "S"
(2,622,949 real changes made)

. replace smoke = .u if smoking_status == "M"
(522,020 real changes made, 522,020 to missing)

. replace smoke = .u if smoking_status == "" 
(0 real changes made)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(522020 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(cancer_haem_date, d(1/1/1900), d(1/2/2015))
(14,714,568 missing values generated)

. replace cancer_haem_cat = 3 if inrange(cancer_haem_date, d(1/2/2015), d(1/2/2019))
(24,457 real changes made)

. replace cancer_haem_cat = 2 if inrange(cancer_haem_date, d(1/2/2019), d(1/2/2020))
(7,757 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 14682354 changes made)

. label values cancer_haem_cat cancer

. 
. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(cancer_nonhaem_date,  d(1/1/1900), d(1/2/2015)) 
(14,296,011 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(cancer_nonhaem_date,  d(1/2/2015), d(1/2/2019))
(204,165 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(cancer_nonhaem_date,  d(1/2/2019), d(1/2/2020)) 
(68,905 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 14022941 changes made)

. label values cancer_exhaem_cat cancer

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(14,731,882 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), date("$indexdate", "DMY"))

. 
. egen other_immuno = rowmax(temp1 temp2)

. drop temp1 temp2 

. order other_immuno, after(temp_immunodef)

. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(10,027,494 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(2,568,102 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(6,799,784 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(3,219,273 real changes made)

. replace bpcat = .u if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(1,446,762 real changes made, 1,446,762 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" .u "Unknown"

. label values bpcat bpcat

. 
. recode bpcat .u=1, gen(bpcat_nomiss)
(1446762 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 1858120 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(3,906,371 real changes made, 3,906,371 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(3,906,371 missing values generated)

. 
. gen min=.
(14,769,965 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(5,942,010 real changes made)

. replace min = SCr_adj/0.9 if male==1
(4,921,584 real changes made)

. replace min = min^-0.329  if male==0
(5,942,010 real changes made)

. replace min = min^-0.411  if male==1
(4,921,584 real changes made)

. replace min = 1 if min<1
(7,196,153 real changes made)

. 
. gen max=.
(14,769,965 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(5,942,010 real changes made)

. replace max=SCr_adj/0.9 if male==1
(4,921,584 real changes made)

. replace max=max^-1.209
(10,863,594 real changes made)

. replace max=1 if max>1
(7,573,812 real changes made)

. 
. gen egfr=min*max*141
(3,906,371 missing values generated)

. replace egfr=egfr*(0.993^age)
(10,863,594 real changes made)

. replace egfr=egfr*1.018 if male==0
(5,942,010 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(3906371 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(10863594 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. *label var ckd "CKD stage calc without eth"
. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
.         
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(10247424 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(3,906,371 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. lab var  reduced "Reduced kidney function"

. 
. 
. 
. /*ESDR: dialysis or kidney transplant*/
. gen esrd=1 if dialysis==1 | kidney_transplant==1
(14,747,426 missing values generated)

. recode esrd .=0
(esrd: 14747426 changes made)

. 
. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(12,701,339 real changes made, 12,701,339 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(6,717,602 real changes made, 6,717,602 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |  2,068,626    15.99522     13304.9        .01   1.91e+07
hba1c_mmol~l |  8,052,363    42.27049    3080.106         .4    8688000

. gen     hba1c_pct = hba1c_percentage 
(12,701,339 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(8,052,361 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(600 real changes made, 600 to missing)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(8,052,436 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(14,692,247 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(1,086,197 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(336,418 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(13,269,632 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |13,269,632          0          0          0 |13,269,632 
         1 |         0     77,718          0          0 |    77,718 
         2 |         0          0  1,086,197          0 | 1,086,197 
         3 |         0          0          0    336,418 |   336,418 
-----------+--------------------------------------------+----------
     Total |13,269,632     77,718  1,086,197    336,418 |14,769,965 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(14,702,073 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(1,084,569 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(13,617,504 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(7,641,514 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(521,721 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(137,995 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(150,657 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(172,431 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |  7,128,451       87.88       87.88
  >=6.5-7.4 |    521,721        6.43       94.32
  >=7.5-7.9 |    137,995        1.70       96.02
    >=8-8.9 |    150,657        1.86       97.87
        >=9 |    172,431        2.13      100.00
------------+-----------------------------------
      Total |  8,111,255      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(7,119,793 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(461,083 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,650,172       51.80       51.80
          1 |    461,083        3.12       54.92
          . |  6,658,710       45.08      100.00
------------+-----------------------------------
      Total | 14,769,965      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(1,500,333 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(20,171 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(56,424 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(681,970 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(398,412 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(6,938 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"            ///
>                                                 3 "T1DM, uncontrolled"          ///
>                                                 4 "T2DM, controlled"            ///
>                                                 5 "T2DM, uncontrolled"          ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 13,269,632       89.84       89.84
  T1DM, controlled |     20,171        0.14       89.98
T1DM, uncontrolled |     56,424        0.38       90.36
  T2DM, controlled |    681,970        4.62       94.98
T2DM, uncontrolled |    398,412        2.70       97.68
Diabetes, no HbA1c |      6,938        0.05       97.72
                 . |    336,418        2.28      100.00
-------------------+-----------------------------------
             Total | 14,769,965      100.00

. 
. 
. 
. /*  Asthma  */
. 
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3
(asthmacat: 14769965 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. /*  Probable shielding  */
. gen shield=1 if esrd==1 | other_transplant==1 | asthmacat==2 | asthmacat==3 | ///
> chronic_respiratory_disease==1 | cancer_haem==1 | cancer_nonhaem==1 | ///
> asplenia==1 | other_immuno==1
(11,199,572 missing values generated)

. recode shield .=0
(shield: 11199572 changes made)

. 
. 
. /* OUTCOME AND SURVIVAL TIME==================================================*/
. 
. /*  Cohort entry and censor dates  */
. * Date of cohort entry, 1 Feb 2019
. gen enter_date = date("$indexdate", "DMY")

. 
. * Date of study end (typically: last date of outcome data available)
. **** NOTE!! NEEDS UPDATING!!!!
. gen tpp_infec_censor_date           = date("$tpp_infec_censor",         "DMY")

.         
. * Format the dates
. format  enter_date                                      ///
>                 tpp_infec_censor_date   %td

.                         
.                 
.                         /****   Outcome definitions   ****/
. 
. 
. * Binary indicator for outcomes
. gen worms = (worms_date < .)

. 
.                                         /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: end study, death, or that outcome)
. gen stime_worms = min(tpp_infec_censor_date, died_date_ons, worms_date, dereg_date)

. 
. * If outcome was after censoring occurred, set to zero
. replace worms   = 0 if (worms_date      > tpp_infec_censor_date) 
(693 real changes made)

. 
. * Format date variables
. format  stime* %td 

. 
. 
. /* LABEL VARIABLES============================================================*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var kids_cat3 "Presence of children or young people in the household"

. label var  number_kids "Number of children aged 1-<12 years in household"

. label var  household_size "Number people in household"

. label var  household_id "Household ID"

. 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age66                                         "66 years and older"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI, kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date measured"

. label var obese4cat                                     "Evidence of obesity (4 categories)"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set to non)"

. label var imd                                           "Index of Multiple Deprivation (IMD)"

. label var ethnicity                                     "Ethnicity"

. label var stp                                           "Sustainability and Transformation Partnership"

. lab var tot_adults_hh                           "Total number adults in hh"

. 
. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma category"

. label var egfr_cat                                              "Calculated eGFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                               "Haematological cancer"

. label var cancer_exhaem_cat                             "Non-haematological cancer"

. label var kidney_transplant                             "Kidney transplant"     

. label var other_transplant                              "Other solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (combination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease"                  

. label var stroke_dementia                           "Stroke or dementia"                                                        

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosuppression"

. lab var temp_immunodef                                  "Temporary immunosuppression"

. lab var esrd                                                    "End-stage renal disease"

. 
. label var hypertension_date                                     "Diagnosed hypertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases Date"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Date"

. label var cancer_haem_date                                      "Haem cancer Date"

. label var cancer_nonhaem_date                           "Non-haem cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological disease  Date"

. label var stroke_dementia_date                      "Stroke or dementia date"                                                   

. label var ra_sle_psoriasis_date                         "Autoimmune disease  Date"

. lab var perm_immunodef_date                             "Permanent immunosuppression date"

. lab var temp_immunodef_date                             "Temporary immunosuppression date"

. label var kidney_transplant_date                                                "Kidney transplant"     

. label var other_transplant_date                                         "Other solid organ transplant"

. label var asplenia_date                                                 "Asplenia date"

. lab var  bphigh "non-missing indicator of known high blood pressure"

. lab var bpcat "Blood pressure four levels, non-missing"

. lab var htdiag_or_highbp "High blood pressure or hypertension diagnosis"

. lab var shield "Probable shielding"

. 
. *Key DATES
. label var   died_date_ons                               "Date death ONS"

. label var enter_date                                    "Date of study entry"

. lab var  dereg_date                                             "Date deregistration from practice"

. 
. 
. *Control outcome
. label var   worms                               "Failure/censoring indicator for outcome: worms"

. label var   worms_date                  "Date of worms"

. label var  stime_worms                  "Survival time (date); outcome worms"

. 
. 
. 
. /* TIDY DATA==================================================================*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
ethnicity_~e  bp_sys_dat~e  bp_dias_da~d  smoki~e_date  diabetes_e~r  hba1c_per~te  esrf          diabetes      bmi_time      max           hba1ccat
care_home_~e  bp_sys_dat~d  creatinine    smoki~s_date  hba1c_mmol~l  cancer_haem   dialysis_d~e  male_drop     bmi_age       hba1c_pct     hba1c75
bmi_measured  bp_dias       crea~te_date  diabetes_t~e  hba1c_mmol~e  cancer_non~m  dialysis      age_drop      SCr_adj       dm_type       tpp_infec_~e
bp_sys        bp_dias_da~e  crea~ne_date  diabetes_e~s  hba1c_per~ge  esrf_date     asthmacat     imd_drop      min           dm_type_ex~s

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS==================================================*/ 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(10 observations deleted)

. 
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if died_date_ons <= date("$indexdate", "DMY")
(0 observations deleted)

.         
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if died_date_ons <= date("$indexdate", "DMY")
(0 observations deleted)

.         
. ***************
. *  Save data  *
. ***************
. sort patient_id

. save $tempdir\analysis_dataset_worms, replace
(note: file tempdata\analysis_dataset_worms.dta not found)
file tempdata\analysis_dataset_worms.dta saved

. 
. 
. 
. use  $tempdir\analysis_dataset_worms, clear

. keep if age66==0
(3,054,487 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir\analysis_dataset_worms_ageband_0, replace
(note: file tempdata\analysis_dataset_worms_ageband_0.dta not found)
file tempdata\analysis_dataset_worms_ageband_0.dta saved

. 
. 
. use  $tempdir\analysis_dataset_worms, clear

. keep if age66==1
(11,715,468 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir\analysis_dataset_worms_ageband_1, replace
(note: file tempdata\analysis_dataset_worms_ageband_1.dta not found)
file tempdata\analysis_dataset_worms_ageband_1.dta saved

. 
. 
. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_worms_ageband_`x', clear
  3. * Save a version set on NON ONS covid death outcome
. stset stime_worms, fail(worms)                          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  4. *WEIGHTING - TO REDUCE TIME 
. set seed 30459820
  5. keep if _d==1|uniform()<.03
  6. gen pw = 1
  7. replace pw = (1/0.03) if _d==0
  8. stset stime_worms [pweight = pw],  fail(worms)                          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  9. save "$tempdir\cr_create_analysis_dataset_STSET_worms_ageband_`x'.dta", replace
 10.         
. }

                id:  patient_id
     failure event:  worms != 0 & worms < .
obs. time interval:  (stime_worms[_n-1], stime_worms]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   11715468  total observations
    198,312  observations end on or before enter()
------------------------------------------------------------------------------
   11517156  observations remaining, representing
   11517156  subjects
      1,433  failures in single-failure-per-subject data
 4.2035e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       365
(11,362,451 observations deleted)
(345,692 real changes made)

                id:  patient_id
     failure event:  worms != 0 & worms < .
obs. time interval:  (stime_worms[_n-1], stime_worms]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
    353,017  total observations
      5,892  observations end on or before enter()
------------------------------------------------------------------------------
    347,125  observations remaining, representing
    347,125  subjects
      1,433  failures in single-failure-per-subject data
  126428882  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       365
(note: file tempdata\cr_create_analysis_dataset_STSET_worms_ageband_0.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_worms_ageband_0.dta saved

                id:  patient_id
     failure event:  worms != 0 & worms < .
obs. time interval:  (stime_worms[_n-1], stime_worms]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
  3,054,487  total observations
      9,568  observations end on or before enter()
------------------------------------------------------------------------------
  3,044,919  observations remaining, representing
  3,044,919  subjects
        106  failures in single-failure-per-subject data
 1.1114e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       365
(2,962,748 observations deleted)
(91,333 real changes made)

                id:  patient_id
     failure event:  worms != 0 & worms < .
obs. time interval:  (stime_worms[_n-1], stime_worms]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=pw]

------------------------------------------------------------------------------
     91,739  total observations
        300  observations end on or before enter()
------------------------------------------------------------------------------
     91,439  observations remaining, representing
     91,439  subjects
        106  failures in single-failure-per-subject data
   33356848  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       365
(note: file tempdata\cr_create_analysis_dataset_STSET_worms_ageband_1.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_worms_ageband_1.dta saved

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\WORMS_01_cr_analysis_dataset.log
  log type:  text
 closed on:  26 Aug 2020, 19:56:13
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
