--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_co
> vid_icu.log
  log type:  text
 opened on:  12 Sep 2020, 08:56:51

. 
. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. foreach exposure_type in        kids_cat3  {
  4. 
. *Complete case ethnicity model
.         capture stcox   i.`exposure_type'                       ///
>                         $demogadjlist                           ///
>                         $comordidadjlist                ///
>                         , strata(stp) vce(cluster household_id)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_sense_`outcome'_CCeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 10. 
.  }
 11. }

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,004,061             Number of obs    =   9,004,061
No. of failures      =        1,392
Time at risk         =   1644728553
                                                Wald chi2(46)    =     4175.55
Log pseudolikelihood =   -16410.358             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 5,683,154 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9752334   .0768477    -0.32   0.750     .8356695    1.138106
               Kids under 18  |   1.050755   .0984349     0.53   0.597     .8745022    1.262532
                              |
                         age1 |   1.087414   .0268817     3.39   0.001     1.035982    1.141398
                         age2 |   1.016937   .0599073     0.29   0.776      .906046      1.1414
                         age3 |   .8692448    .126888    -0.96   0.337     .6529621    1.157167
                       1.male |   2.292012   .1360448    13.97   0.000     2.040295    2.574785
                              |
                    ethnicity |
                       Mixed  |   3.323519   .5329435     7.49   0.000     2.427189    4.550853
      Asian or Asian British  |   2.961445   .2629304    12.23   0.000     2.488457    3.524335
                       Black  |   3.154305   .3347255    10.83   0.000     2.561986    3.883566
                       Other  |    3.05512   .4185071     8.15   0.000     2.335748    3.996046
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.836911   .1262488     8.85   0.000     1.605411    2.101795
          Obese II (35-39.9)  |   2.567758   .2206702    10.97   0.000     2.169716    3.038823
             Obese III (40+)  |   3.669036   .3718723    12.83   0.000     3.008008    4.475328
                              |
                 smoke_nomiss |
                      Former  |   1.031193   .0604078     0.52   0.600     .9193399    1.156655
                     Current  |   .3002806   .0335789   -10.76   0.000     .2411802    .3738635
                              |
                          imd |
                           2  |   1.158697   .1166456     1.46   0.143     .9512177    1.411433
                           3  |   1.263741    .124426     2.38   0.017     1.041958    1.532732
                           4  |   1.422129   .1361156     3.68   0.000     1.178877    1.715575
             5 most deprived  |   1.546943   .1536498     4.39   0.000     1.273295    1.879402
                              |
                tot_adults_hh |
                           2  |   .9503811    .071233    -0.68   0.497     .8205376    1.100771
                           3  |   1.198078   .0885208     2.45   0.014     1.036557    1.384766
                              |
           1.htdiag_or_highbp |   1.431598   .0904586     5.68   0.000     1.264842     1.62034
1.chronic_respiratory_disease |   2.363074   .2537184     8.01   0.000     1.914633    2.916547
                     1.asthma |   1.263225   .0868379     3.40   0.001     1.103994    1.445423
    1.chronic_cardiac_disease |   1.089834   .1055056     0.89   0.374     .9014812    1.317542
                              |
                      diabcat |
            T1DM, controlled  |   1.935993   .8805833     1.45   0.146     .7938458    4.721407
          T1DM, uncontrolled  |   2.987365   .7067896     4.63   0.000     1.878884    4.749814
            T2DM, controlled  |   1.780067    .159863     6.42   0.000     1.492768     2.12266
          T2DM, uncontrolled  |   2.702673   .2384989    11.27   0.000     2.273415    3.212981
          Diabetes, no HbA1c  |   3.540356   1.585543     2.82   0.005     1.471762    8.516404
                              |
            cancer_exhaem_cat |
                   Last year  |   1.168825   .4448028     0.41   0.682     .5543958    2.464217
               2-5 years ago  |   .9613103     .23708    -0.16   0.873     .5928419    1.558793
                    5+ years  |   .5899585   .1496921    -2.08   0.038     .3587925    .9700622
                              |
              cancer_haem_cat |
                   Last year  |   4.970145   2.532096     3.15   0.002     1.831112    13.49035
               2-5 years ago  |   3.945261   1.332863     4.06   0.000      2.03473    7.649705
                    5+ years  |   2.261859    .671913     2.75   0.006     1.263589    4.048792
                              |
      1.chronic_liver_disease |   1.136376   .2547272     0.57   0.568     .7323499    1.763296
            1.stroke_dementia |   1.608477   .2366429     3.23   0.001     1.205547    2.146079
                1.other_neuro |   1.172167   .2901749     0.64   0.521     .7215578     1.90418
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.575726   .2003623     3.58   0.000     1.228134    2.021696
           Stage 4/5 egfr<30  |   1.309028   .3829916     0.92   0.357     .7377457    2.322689
                              |
                       1.esrd |   5.289832   1.298119     6.79   0.000     3.270077    8.557084
           1.other_transplant |   .6934579   .5148014    -0.49   0.622     .1618507    2.971156
                   1.asplenia |   3.041658    1.04383     3.24   0.001     1.552375    5.959696
           1.ra_sle_psoriasis |   1.288046   .1330935     2.45   0.014     1.051906    1.577197
               1.other_immuno |   1.449364   .3957144     1.36   0.174      .848745    2.475015
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_icu_CCeth_ageband_0.ster not found)
file ./output/an_sense_covid_icu_CCeth_ageband_0.ster saved

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,444,497             Number of obs    =   2,444,497
No. of failures      =          631
Time at risk         =    444437655
                                                Wald chi2(45)    =      575.01
Log pseudolikelihood =   -6978.5605             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 1,934,677 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9821272   .2189634    -0.08   0.936     .6344449    1.520343
               Kids under 18  |   1.371375   .3899482     1.11   0.267     .7854502    2.394385
                              |
                         age1 |   .9420651   .0303113    -1.85   0.064     .8844906    1.003387
                         age2 |   1.199098   .2018091     1.08   0.281     .8621779    1.667679
                         age3 |   .3944098   .2024382    -1.81   0.070      .144229    1.078556
                       1.male |   2.687944   .2422844    10.97   0.000     2.252658    3.207343
                              |
                    ethnicity |
                       Mixed  |   2.950662   1.146588     2.78   0.005     1.377697    6.319533
      Asian or Asian British  |   2.268505   .3880996     4.79   0.000     1.622239     3.17223
                       Black  |   3.754198   .8117885     6.12   0.000     2.457297    5.735571
                       Other  |   3.095502   .8358028     4.18   0.000     1.823483    5.254849
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.412348   .1391957     3.50   0.000     1.164261    1.713298
          Obese II (35-39.9)  |   2.027429   .2686398     5.33   0.000     1.563721    2.628647
             Obese III (40+)  |   1.573018   .3444552     2.07   0.039     1.024094     2.41617
                              |
                 smoke_nomiss |
                      Former  |   1.442828   .1330095     3.98   0.000     1.204329    1.728558
                     Current  |   .4749358   .1044323    -3.39   0.001     .3086502    .7308079
                              |
                          imd |
                           2  |   .9685157   .1239073    -0.25   0.803     .7537165     1.24453
                           3  |   1.177632   .1472221     1.31   0.191     .9217142    1.504606
                           4  |   1.222465   .1606753     1.53   0.126     .9448401    1.581665
             5 most deprived  |   1.153201    .165519     0.99   0.321     .8704267    1.527841
                              |
                tot_adults_hh |
                           2  |   1.174346   .1159259     1.63   0.104     .9677644    1.425026
                           3  |   1.057536   .1382392     0.43   0.669     .8185168    1.366352
                              |
           1.htdiag_or_highbp |   1.148103   .1080983     1.47   0.142     .9546343    1.380781
1.chronic_respiratory_disease |   1.324296    .151441     2.46   0.014     1.058389    1.657009
                     1.asthma |     1.1746   .1282658     1.47   0.141     .9482858    1.454926
    1.chronic_cardiac_disease |   .9033812   .0914576    -1.00   0.316     .7407917    1.101656
                              |
                      diabcat |
            T1DM, controlled  |   .8238973   .8315481    -0.19   0.848     .1139639    5.956333
          T1DM, uncontrolled  |   1.464456   .8583165     0.65   0.515     .4642884     4.61918
            T2DM, controlled  |    1.16169   .1347192     1.29   0.196     .9255035    1.458152
          T2DM, uncontrolled  |   1.650614   .2131802     3.88   0.000     1.281478    2.126082
          Diabetes, no HbA1c  |   1.12e-19          .        .       .            .           .
                              |
            cancer_exhaem_cat |
                   Last year  |   .7360361   .3031424    -0.74   0.457     .3283409    1.649959
               2-5 years ago  |   .7172898   .1728462    -1.38   0.168     .4472801    1.150296
                    5+ years  |   .9703759   .1454837    -0.20   0.841     .7233084    1.301837
                              |
              cancer_haem_cat |
                   Last year  |   4.583922   2.309682     3.02   0.003     1.707441    12.30633
               2-5 years ago  |   4.411753   1.290283     5.08   0.000     2.486936    7.826322
                    5+ years  |    1.28128   .4919797     0.65   0.519     .6036754     2.71947
                              |
      1.chronic_liver_disease |   .7194721     .28836    -0.82   0.411     .3279878     1.57823
            1.stroke_dementia |   1.196471   .1829223     1.17   0.241     .8866785      1.6145
                1.other_neuro |   .8699376   .2662249    -0.46   0.649     .4775259    1.584818
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.376442   .1444112     3.05   0.002     1.120606    1.690686
           Stage 4/5 egfr<30  |   1.233778   .3866438     0.67   0.503     .6675532    2.280281
                              |
                       1.esrd |   3.999769   1.491202     3.72   0.000     1.926142    8.305802
           1.other_transplant |   1.897567   1.957834     0.62   0.535     .2511663    14.33616
                   1.asplenia |   1.750259    1.02208     0.96   0.338     .5572311    5.497553
           1.ra_sle_psoriasis |    1.29525   .1729972     1.94   0.053     .9969307    1.682839
               1.other_immuno |   .4999029   .5000183    -0.69   0.488     .0703862    3.550452
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_icu_CCeth_ageband_1.ster not found)
file ./output/an_sense_covid_icu_CCeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_co
> vid_icu.log
  log type:  text
 closed on:  12 Sep 2020, 10:38:04
--------------------------------------------------------------------------------------------------------------
