--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_co
> vid_tpp_prob.log
  log type:  text
 opened on:  12 Sep 2020, 08:56:50

. 
. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. foreach exposure_type in        kids_cat3  {
  4. 
. *Complete case ethnicity model
.         capture stcox   i.`exposure_type'                       ///
>                         $demogadjlist                           ///
>                         $comordidadjlist                ///
>                         , strata(stp) vce(cluster household_id)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_sense_`outcome'_CCeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 10. 
.  }
 11. }

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,004,061             Number of obs    =   9,004,061
No. of failures      =       29,083
Time at risk         =   1642633178
                                                Wald chi2(46)    =    12506.84
Log pseudolikelihood =    -369788.2             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 5,683,154 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.026513   .0167016     1.61   0.108     .9942953    1.059775
               Kids under 18  |   1.083915    .024218     3.61   0.000     1.037473    1.132436
                              |
                         age1 |   1.013611    .002716     5.05   0.000     1.008302    1.018949
                         age2 |   1.007942   .0080307     0.99   0.321     .9923241    1.023805
                         age3 |   .9359498   .0206462    -3.00   0.003     .8963463    .9773032
                       1.male |   .7672829   .0089187   -22.79   0.000     .7500001    .7849639
                              |
                    ethnicity |
                       Mixed  |   1.504146   .0665459     9.23   0.000     1.379213    1.640395
      Asian or Asian British  |   2.777895   .0522443    54.32   0.000     2.677363    2.882203
                       Black  |   1.725487   .0517096    18.20   0.000     1.627057    1.829872
                       Other  |   1.321355   .0501015     7.35   0.000     1.226718    1.423293
                              |
                    obese4cat |
           Obese I (30-34.9)  |    1.29006   .0209361    15.69   0.000     1.249672    1.331753
          Obese II (35-39.9)  |   1.411748   .0319074    15.26   0.000     1.350575    1.475691
             Obese III (40+)  |   1.693836    .046397    19.24   0.000     1.605298    1.787258
                              |
                 smoke_nomiss |
                      Former  |   1.081753   .0150781     5.64   0.000     1.052601    1.111713
                     Current  |   .6385281   .0122487   -23.39   0.000     .6149668     .662992
                              |
                          imd |
                           2  |   1.133662   .0261124     5.45   0.000     1.083621    1.186014
                           3  |   1.219254   .0279518     8.65   0.000     1.165682    1.275288
                           4  |   1.338816   .0297682    13.12   0.000     1.281725    1.398451
             5 most deprived  |    1.46975   .0334179    16.94   0.000      1.40569    1.536729
                              |
                tot_adults_hh |
                           2  |   1.072882   .0182434     4.14   0.000     1.037714    1.109241
                           3  |    1.21159   .0209115    11.12   0.000     1.171289    1.253277
                              |
           1.htdiag_or_highbp |   1.147129   .0169364     9.30   0.000      1.11441    1.180808
1.chronic_respiratory_disease |   1.656126    .053553    15.60   0.000     1.554421    1.764485
                     1.asthma |   1.175692   .0179536    10.60   0.000     1.141025    1.211412
    1.chronic_cardiac_disease |    1.31423   .0373806     9.61   0.000      1.24297    1.389576
                              |
                      diabcat |
            T1DM, controlled  |   1.123111   .1602078     0.81   0.416     .8491842    1.485401
          T1DM, uncontrolled  |   1.589051   .1152849     6.38   0.000     1.378426    1.831859
            T2DM, controlled  |   1.268577   .0362466     8.33   0.000     1.199487    1.341645
          T2DM, uncontrolled  |   1.538973   .0452298    14.67   0.000      1.45283    1.630225
          Diabetes, no HbA1c  |   1.199654   .2566519     0.85   0.395     .7887719     1.82457
                              |
            cancer_exhaem_cat |
                   Last year  |   1.880914   .1580563     7.52   0.000     1.595296     2.21767
               2-5 years ago  |   1.150574   .0721361     2.24   0.025     1.017532    1.301012
                    5+ years  |   1.064487   .0530347     1.25   0.210      .965455    1.173678
                              |
              cancer_haem_cat |
                   Last year  |   3.369791   .6214903     6.59   0.000     2.347556    4.837155
               2-5 years ago  |   2.341847   .2972488     6.70   0.000     1.826065    3.003315
                    5+ years  |   1.474236   .1472138     3.89   0.000     1.212183    1.792942
                              |
      1.chronic_liver_disease |   1.536374   .0883593     7.47   0.000     1.372597    1.719693
            1.stroke_dementia |   1.363852   .0679391     6.23   0.000     1.236988    1.503728
                1.other_neuro |   1.248999   .0758067     3.66   0.000     1.108918    1.406776
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.211083   .0561696     4.13   0.000     1.105848    1.326332
           Stage 4/5 egfr<30  |   2.022468   .1908971     7.46   0.000     1.680886    2.433464
                              |
                       1.esrd |   2.570139   .2332067    10.40   0.000     2.151399    3.070379
           1.other_transplant |   1.388275    .263572     1.73   0.084     .9569071      2.0141
                   1.asplenia |   2.192816   .2425559     7.10   0.000     1.765418    2.723685
           1.ra_sle_psoriasis |   1.135511   .0296223     4.87   0.000     1.078912     1.19508
               1.other_immuno |   1.757697   .1173721     8.45   0.000      1.54207    2.003475
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_tpp_prob_CCeth_ageband_0.ster not found)
file ./output/an_sense_covid_tpp_prob_CCeth_ageband_0.ster saved

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,444,497             Number of obs    =   2,444,497
No. of failures      =       11,133
Time at risk         =    443680249
                                                Wald chi2(46)    =    11363.63
Log pseudolikelihood =   -124234.16             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 1,934,677 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.076766   .0680011     1.17   0.242     .9514048    1.218645
               Kids under 18  |   .9184841   .0844592    -0.92   0.355     .7670071    1.099876
                              |
                         age1 |   .9699507   .0092508    -3.20   0.001     .9519879    .9882523
                         age2 |    1.25867   .0506233     5.72   0.000      1.16326    1.361906
                         age3 |   .6181168   .0646886    -4.60   0.000     .5034874    .7588438
                       1.male |   1.177963   .0233791     8.25   0.000     1.133021    1.224688
                              |
                    ethnicity |
                       Mixed  |    1.03016   .1483028     0.21   0.836     .7768997     1.36598
      Asian or Asian British  |   1.401717   .0637479     7.43   0.000      1.28218    1.532398
                       Black  |   1.220434      .0917     2.65   0.008     1.053313    1.414071
                       Other  |   1.160679   .1183613     1.46   0.144     .9504078    1.417471
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.068822   .0267978     2.65   0.008     1.017569    1.122657
          Obese II (35-39.9)  |   1.198203   .0456233     4.75   0.000     1.112038    1.291044
             Obese III (40+)  |   1.473515   .0795945     7.18   0.000     1.325487    1.638075
                              |
                 smoke_nomiss |
                      Former  |    1.12759   .0246485     5.49   0.000       1.0803     1.17695
                     Current  |   .8880351   .0365872    -2.88   0.004     .8191445    .9627194
                              |
                          imd |
                           2  |    1.10831   .0351317     3.24   0.001     1.041548     1.17935
                           3  |   1.170868   .0373676     4.94   0.000     1.099873    1.246446
                           4  |   1.339875   .0428561     9.15   0.000     1.258458    1.426561
             5 most deprived  |   1.496107   .0505864    11.91   0.000     1.400173    1.598613
                              |
                tot_adults_hh |
                           2  |   .8137382   .0182165    -9.21   0.000     .7788065    .8502367
                           3  |   1.002962   .0328047     0.09   0.928     .9406837    1.069364
                              |
           1.htdiag_or_highbp |   .9970737   .0232512    -0.13   0.900      .952528    1.043703
1.chronic_respiratory_disease |   1.865405   .0439934    26.44   0.000     1.781142    1.953654
                     1.asthma |   1.192391   .0304048     6.90   0.000     1.134263    1.253498
    1.chronic_cardiac_disease |   1.434793   .0309336    16.75   0.000     1.375427    1.496721
                              |
                      diabcat |
            T1DM, controlled  |   1.687814   .3170323     2.79   0.005     1.167988    2.438995
          T1DM, uncontrolled  |   2.285712   .2675882     7.06   0.000     1.817069    2.875224
            T2DM, controlled  |   1.357786   .0345557    12.02   0.000      1.29172    1.427232
          T2DM, uncontrolled  |   1.717614   .0545171    17.04   0.000     1.614018    1.827859
          Diabetes, no HbA1c  |   1.520108   .3837193     1.66   0.097     .9268441    2.493116
                              |
            cancer_exhaem_cat |
                   Last year  |   1.794255   .1190519     8.81   0.000     1.575453    2.043445
               2-5 years ago  |   1.227626   .0574205     4.38   0.000     1.120088    1.345488
                    5+ years  |   1.184004   .0351798     5.68   0.000     1.117022    1.255002
                              |
              cancer_haem_cat |
                   Last year  |   2.991345    .433759     7.56   0.000     2.251326    3.974612
               2-5 years ago  |   2.165959    .207333     8.07   0.000     1.795438    2.612945
                    5+ years  |   1.663075   .1242995     6.81   0.000     1.436456    1.925446
                              |
      1.chronic_liver_disease |   1.832341   .1247084     8.90   0.000     1.603518    2.093817
            1.stroke_dementia |   1.729304   .0462777    20.47   0.000     1.640939    1.822428
                1.other_neuro |   2.138081   .0962606    16.88   0.000     1.957498    2.335323
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.133534    .026272     5.41   0.000     1.083194    1.186214
           Stage 4/5 egfr<30  |   1.714974   .0811231    11.40   0.000     1.563123    1.881576
                              |
                       1.esrd |     3.2569   .2744893    14.01   0.000     2.760996    3.841874
           1.other_transplant |   1.329376   .3910423     0.97   0.333     .7469005    2.366099
                   1.asplenia |   1.218184   .1938886     1.24   0.215     .8917313    1.664148
           1.ra_sle_psoriasis |   1.281787   .0400534     7.94   0.000      1.20564    1.362744
               1.other_immuno |   1.787105   .2568583     4.04   0.000     1.348367    2.368603
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_tpp_prob_CCeth_ageband_1.ster not found)
file ./output/an_sense_covid_tpp_prob_CCeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_co
> vid_tpp_prob.log
  log type:  text
 closed on:  12 Sep 2020, 11:34:05
--------------------------------------------------------------------------------------------------------------
