--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_co
> vid_death.log
  log type:  text
 opened on:  12 Sep 2020, 08:56:51

. 
. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. foreach exposure_type in        kids_cat3  {
  4. 
. *Complete case ethnicity model
.         capture stcox   i.`exposure_type'                       ///
>                         $demogadjlist                           ///
>                         $comordidadjlist                ///
>                         , strata(stp) vce(cluster household_id)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_sense_`outcome'_CCeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 10. 
.  }
 11. }

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,004,061             Number of obs    =   9,004,061
No. of failures      =        1,106
Time at risk         =   1644837885
                                                Wald chi2(46)    =     6270.95
Log pseudolikelihood =   -12550.575             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 5,683,154 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |    .750212    .077678    -2.78   0.006     .6124201    .9190064
               Kids under 18  |   .8293346   .1031007    -1.51   0.132     .6499959    1.058154
                              |
                         age1 |   1.160769   .0563293     3.07   0.002     1.055454    1.276593
                         age2 |   .9263842   .0967818    -0.73   0.464     .7548555     1.13689
                         age3 |   1.105647   .2717195     0.41   0.683     .6830126      1.7898
                       1.male |   1.773407   .1158854     8.77   0.000     1.560219    2.015725
                              |
                    ethnicity |
                       Mixed  |   2.362294   .4771601     4.26   0.000     1.590009    3.509686
      Asian or Asian British  |   2.141298   .2070114     7.88   0.000     1.771686     2.58802
                       Black  |   2.254698   .2823056     6.49   0.000     1.764052    2.881811
                       Other  |   1.988316   .3566557     3.83   0.000     1.398945    2.825989
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.100201   .0901725     1.17   0.244     .9369311    1.291923
          Obese II (35-39.9)  |   1.884065   .1784611     6.69   0.000     1.564837    2.268417
             Obese III (40+)  |   2.412667   .2743718     7.74   0.000     1.930624    3.015069
                              |
                 smoke_nomiss |
                      Former  |   1.080192   .0740325     1.13   0.260     .9444147     1.23549
                     Current  |   .7326945   .0676903    -3.37   0.001     .6113421    .8781356
                              |
                          imd |
                           2  |    1.27215   .1567628     1.95   0.051     .9991893     1.61968
                           3  |   1.400074   .1672309     2.82   0.005     1.107847    1.769385
                           4  |   1.827826   .2066212     5.34   0.000      1.46458    2.281163
             5 most deprived  |   1.824513   .2149371     5.10   0.000     1.448341    2.298385
                              |
                tot_adults_hh |
                           2  |   .8112136   .0650767    -2.61   0.009     .6931873    .9493358
                           3  |   1.043038   .0811067     0.54   0.588     .8955934    1.214758
                              |
           1.htdiag_or_highbp |   1.274169   .0893341     3.46   0.001     1.110575    1.461862
1.chronic_respiratory_disease |   2.593418   .2477851     9.97   0.000      2.15053    3.127516
                     1.asthma |   1.137314   .0888707     1.65   0.100     .9758137    1.325544
    1.chronic_cardiac_disease |   1.500406   .1338211     4.55   0.000     1.259767    1.787012
                              |
                      diabcat |
            T1DM, controlled  |   2.226342   .9243877     1.93   0.054     .9866636    5.023597
          T1DM, uncontrolled  |   3.039333   .7153422     4.72   0.000     1.916188    4.820792
            T2DM, controlled  |   1.834484    .177329     6.28   0.000     1.517865    2.217148
          T2DM, uncontrolled  |   2.842657   .2678077    11.09   0.000     2.363374    3.419137
          Diabetes, no HbA1c  |   4.858468   2.039769     3.77   0.000     2.133696    11.06282
                              |
            cancer_exhaem_cat |
                   Last year  |   5.854985   1.062386     9.74   0.000     4.102753    8.355572
               2-5 years ago  |   2.699785   .4228261     6.34   0.000      1.98618    3.669779
                    5+ years  |   1.746256   .2717803     3.58   0.000     1.287153    2.369111
                              |
              cancer_haem_cat |
                   Last year  |   8.177178   3.165145     5.43   0.000      3.82938    17.46138
               2-5 years ago  |   5.598441   1.553381     6.21   0.000     3.250027    9.643778
                    5+ years  |   2.368043   .6781274     3.01   0.003     1.350935    4.150925
                              |
      1.chronic_liver_disease |   2.872629   .4254821     7.12   0.000     2.148835     3.84022
            1.stroke_dementia |   1.728461   .2221668     4.26   0.000     1.343541     2.22366
                1.other_neuro |   4.308898   .6078047    10.36   0.000     3.268115    5.681134
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.795707   .2871819    10.01   0.000     2.285884    3.419237
           Stage 4/5 egfr<30  |   5.384489   1.167959     7.76   0.000     3.519727    8.237209
                              |
                       1.esrd |   2.313201   .5459645     3.55   0.000     1.456505    3.673796
           1.other_transplant |    .923116   .4957258    -0.15   0.882     .3222178    2.644618
                   1.asplenia |   1.389747   .6366964     0.72   0.473     .5661973    3.411173
           1.ra_sle_psoriasis |   1.220566   .1351606     1.80   0.072     .9824325    1.516422
               1.other_immuno |   2.110592   .5090077     3.10   0.002     1.315593    3.386001
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_death_CCeth_ageband_0.ster not found)
file ./output/an_sense_covid_death_CCeth_ageband_0.ster saved

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,444,497             Number of obs    =   2,444,497
No. of failures      =        6,008
Time at risk         =    444468313
                                                Wald chi2(46)    =    13382.62
Log pseudolikelihood =    -64556.22             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 1,934,677 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8855254   .0839049    -1.28   0.199     .7354419    1.066237
               Kids under 18  |   .8320224   .1111161    -1.38   0.169     .6404092    1.080967
                              |
                         age1 |   1.064666    .018432     3.62   0.000     1.029146    1.101412
                         age2 |   1.171576   .0780861     2.38   0.018     1.028105    1.335069
                         age3 |   .6742702   .1130848    -2.35   0.019     .4853727     .936683
                       1.male |    1.68237   .0473353    18.49   0.000     1.592106    1.777751
                              |
                    ethnicity |
                       Mixed  |   1.231997   .2224032     1.16   0.248     .8648655    1.754974
      Asian or Asian British  |   1.500532   .0901955     6.75   0.000     1.333769    1.688147
                       Black  |   1.208054   .1122897     2.03   0.042     1.006854     1.44946
                       Other  |   .9860048   .1473911    -0.09   0.925      .735595    1.321659
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.121861   .0388479     3.32   0.001     1.048246    1.200644
          Obese II (35-39.9)  |   1.509686   .0773381     8.04   0.000     1.365467    1.669137
             Obese III (40+)  |   2.003835   .1471347     9.47   0.000     1.735246    2.313997
                              |
                 smoke_nomiss |
                      Former  |   1.261486   .0383765     7.64   0.000     1.188468     1.33899
                     Current  |   1.201344   .0678373     3.25   0.001     1.075479     1.34194
                              |
                          imd |
                           2  |   1.136898   .0490482     2.97   0.003     1.044718    1.237212
                           3  |   1.198331   .0521431     4.16   0.000     1.100369    1.305014
                           4  |   1.396103   .0605797     7.69   0.000     1.282278    1.520032
             5 most deprived  |   1.569565   .0718723     9.84   0.000     1.434834    1.716947
                              |
                tot_adults_hh |
                           2  |   .7688369   .0235239    -8.59   0.000     .7240862    .8163533
                           3  |   .9823913   .0442487    -0.39   0.693     .8993833    1.073061
                              |
           1.htdiag_or_highbp |   .9092695   .0298275    -2.90   0.004     .8526484    .9696506
1.chronic_respiratory_disease |   1.741284   .0549196    17.58   0.000     1.636904    1.852321
                     1.asthma |   1.027985   .0377978     0.75   0.453     .9565089    1.104802
    1.chronic_cardiac_disease |   1.355795   .0385178    10.71   0.000     1.282365     1.43343
                              |
                      diabcat |
            T1DM, controlled  |   1.864718   .4507975     2.58   0.010     1.161006    2.994967
          T1DM, uncontrolled  |   2.595083   .3951257     6.26   0.000     1.925519    3.497476
            T2DM, controlled  |   1.426038   .0471081    10.74   0.000     1.336633    1.521422
          T2DM, uncontrolled  |   1.904211   .0785101    15.62   0.000     1.756388    2.064477
          Diabetes, no HbA1c  |   1.969663   .6007165     2.22   0.026       1.0834    3.580924
                              |
            cancer_exhaem_cat |
                   Last year  |   2.308635   .1823432    10.59   0.000     1.977537    2.695168
               2-5 years ago  |   1.277153    .077992     4.01   0.000     1.133085    1.439538
                    5+ years  |   1.073207   .0432517     1.75   0.080     .9916967    1.161416
                              |
              cancer_haem_cat |
                   Last year  |   2.940763   .5583858     5.68   0.000     2.026916    4.266624
               2-5 years ago  |   2.538378   .2952196     8.01   0.000     2.020968    3.188256
                    5+ years  |   1.527583   .1560495     4.15   0.000     1.250405    1.866203
                              |
      1.chronic_liver_disease |   2.100431   .1893541     8.23   0.000     1.760242    2.506365
            1.stroke_dementia |   1.749287   .0588303    16.63   0.000       1.6377    1.868477
                1.other_neuro |   2.512776   .1409167    16.43   0.000     2.251222    2.804718
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.305809   .0400651     8.70   0.000     1.229597    1.386745
           Stage 4/5 egfr<30  |   2.361502   .1261555    16.09   0.000     2.126747    2.622171
                              |
                       1.esrd |   3.183614    .328043    11.24   0.000     2.601427    3.896092
           1.other_transplant |   1.642056   .6293121     1.29   0.196     .7747614     3.48023
                   1.asplenia |   .9464195   .2380772    -0.22   0.827     .5780416    1.549559
           1.ra_sle_psoriasis |   1.210987   .0532637     4.35   0.000     1.110965    1.320013
               1.other_immuno |   1.937048   .3745872     3.42   0.001     1.325973    2.829738
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_death_CCeth_ageband_1.ster not found)
file ./output/an_sense_covid_death_CCeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_co
> vid_death.log
  log type:  text
 closed on:  12 Sep 2020, 10:19:49
--------------------------------------------------------------------------------------------------------------
