--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_covid_death.lo
> g
  log type:  text
 opened on:  12 Sep 2020, 04:56:45

. 
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string)] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in        kids_cat3  {
  4. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.sm
> oke_nomiss)
  5. if _rc==0{
  6. estimates
  7. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth_age
> band_`x'", replace
  8. *estat concordance /*c-statistic*/
.         /*  Proportional Hazards test  */
.         * Based on Schoenfeld residuals
.         timer clear 
  9.         timer on 1
 10.         if e(N_fail)>0 estat phtest, d
 11.         timer off 1
 12.         timer list
 13. }
 14. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 15. 
. }
 16. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. keep if has_12_m_follow_up == 1
 17. foreach exposure_type in kids_cat3   {
 18. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(0) bmi(i.obese4cat) smoking(i.s
> moke_nomiss)
 19. if _rc==0{
 20. estimates
 21. estimates save ./output/an_sense_`outcome'_noeth_12mo_ageband_`x', replace
 22. *estat concordance /*c-statistic*/
. }
 23. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
 24. 
. 
. }       
 25. 
.  
.  
.  foreach exposure_type in       gp_number_kids {
 26. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0) bmi(i.obese4cat) smoking(i.sm
> oke_nomiss)
 27. if _rc==0{
 28. estimates
 29. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_noeth_ageb
> and_`x', replace
 30. }
 31. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 32. }
 33. 
. }
   1:   3470.30 /        1 =    3470.3050

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,872,324             Number of obs    =  11,872,324
No. of failures      =        1,386
Time at risk         =   2169724103
                                                Wald chi2(37)    =     7375.48
Log pseudolikelihood =   -16142.383             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,753,520 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8526909   .0806856    -1.68   0.092     .7083486    1.026446
               Kids under 18  |   .9596065   .1034002    -0.38   0.702     .7769157    1.185257
                              |
                         age1 |   1.179329   .0493469     3.94   0.000     1.086471    1.280124
                         age2 |    .899938    .081542    -1.16   0.245     .7535056    1.074827
                         age3 |   1.166324   .2493396     0.72   0.472     .7670916    1.773336
                       1.male |   1.628641   .0928042     8.56   0.000     1.456538    1.821081
                              |
                          imd |
                           2  |   1.176125    .122885     1.55   0.121     .9583349    1.443409
                           3  |   1.319338   .1344589     2.72   0.007     1.080455    1.611036
                           4  |   1.777923   .1707378     5.99   0.000      1.47289    2.146128
             5 most deprived  |   1.877899   .1860842     6.36   0.000     1.546412    2.280443
                              |
                tot_adults_hh |
                           2  |   .8332769   .0599185    -2.54   0.011      .723739    .9593935
                           3  |     1.1205   .0771023     1.65   0.098     .9791295    1.282282
                              |
           1.htdiag_or_highbp |    1.44532   .0901092     5.91   0.000     1.279074    1.633175
1.chronic_respiratory_disease |   2.386471   .2000092    10.38   0.000     2.024964    2.812517
                     1.asthma |    1.16875    .081982     2.22   0.026     1.018624    1.341001
    1.chronic_cardiac_disease |   1.601767   .1269244     5.95   0.000     1.371355    1.870892
                              |
                      diabcat |
            T1DM, controlled  |   2.052691   .7905338     1.87   0.062     .9649578    4.366555
          T1DM, uncontrolled  |   2.707447   .5902629     4.57   0.000      1.76598    4.150824
            T2DM, controlled  |    2.31795   .1956383     9.96   0.000     1.964543    2.734933
          T2DM, uncontrolled  |   3.684708   .2936258    16.37   0.000     3.151903     4.30758
          Diabetes, no HbA1c  |   4.454008   1.858109     3.58   0.000     1.966298     10.0891
                              |
            cancer_exhaem_cat |
                   Last year  |   5.526495   .8935319    10.57   0.000      4.02556    7.587057
               2-5 years ago  |   2.743071   .3752619     7.38   0.000     2.097924    3.586613
                    5+ years  |   1.611533   .2279149     3.37   0.001     1.221394    2.126289
                              |
              cancer_haem_cat |
                   Last year  |   6.634478   2.556439     4.91   0.000     3.117571    14.11878
               2-5 years ago  |    6.22554   1.448814     7.86   0.000     3.945341    9.823574
                    5+ years  |   2.144694   .5710677     2.87   0.004     1.272671    3.614222
                              |
      1.chronic_liver_disease |   3.143866   .3979016     9.05   0.000     2.453196    4.028987
            1.stroke_dementia |   1.724525   .1980214     4.75   0.000     1.376984    2.159783
                1.other_neuro |   4.567372   .5582708    12.43   0.000     3.594378    5.803753
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.760339   .2581872    10.86   0.000     2.297977    3.315731
           Stage 4/5 egfr<30  |   6.478311   1.163071    10.41   0.000     4.556622    9.210447
                              |
                       1.esrd |   2.222573   .4414078     4.02   0.000     1.505932    3.280246
           1.other_transplant |   .8000218   .3800156    -0.47   0.639     .3153375    2.029682
                   1.asplenia |   1.478698   .5709917     1.01   0.311     .6937327    3.151858
           1.ra_sle_psoriasis |    1.19405   .1185118     1.79   0.074     .9829674    1.450461
               1.other_immuno |   2.686605   .5633754     4.71   0.000     1.781183    4.052276
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_0.ster n
> ot found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.03615         2.18        1         0.1402
      2.kids_cat3 |     -0.01260         0.25        1         0.6163
      age1        |      0.01318         0.26        1         0.6070
      age2        |     -0.01179         0.21        1         0.6429
      age3        |      0.01066         0.18        1         0.6755
      0b.male     |            .            .        1             .
      1.male      |     -0.01897         0.56        1         0.4525
      1b.imd      |            .            .        1             .
      2.imd       |      0.04511         2.96        1         0.0856
      3.imd       |      0.02781         1.16        1         0.2808
      4.imd       |      0.05373         4.26        1         0.0389
      5.imd       |      0.07486         8.53        1         0.0035
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.04705         3.44        1         0.0637
      3.tot_adul~h|     -0.00869         0.11        1         0.7420
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.01196         0.25        1         0.6157
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.00558         0.06        1         0.8133
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.00805         0.11        1         0.7432
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.01125         0.24        1         0.6262
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01826         0.51        1         0.4764
      3.diabcat   |      0.00713         0.08        1         0.7746
      4.diabcat   |     -0.07625         9.70        1         0.0018
      5.diabcat   |     -0.08119        11.82        1         0.0006
      6.diabcat   |      0.00935         0.14        1         0.7113
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.05398         4.56        1         0.0327
      3.cancer_e~t|      0.04642         3.42        1         0.0644
      4.cancer_e~t|      0.06316         6.07        1         0.0137
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.02682         1.12        1         0.2900
      3.cancer_h~t|      0.00457         0.03        1         0.8538
      4.cancer_h~t|      0.00341         0.02        1         0.8927
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.03992         2.89        1         0.0891
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.02951         1.67        1         0.1962
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.01333         0.31        1         0.5747
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.03321         1.77        1         0.1831
      3.reduced_~t|     -0.01641         0.58        1         0.4459
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.01757         0.65        1         0.4218
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00898         0.15        1         0.7029
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.00420         0.03        1         0.8680
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.00759         0.09        1         0.7672
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.02731         1.29        1         0.2569
      ------------+---------------------------------------------------
      global test |                     58.02       37         0.0151
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   5048.06 /        1 =    5048.0610
(843,126 observations deleted)
   1:   3136.54 /        1 =    3136.5360

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,038,873             Number of obs    =  11,038,873
No. of failures      =        1,319
Time at risk         =   2018359765
                                                Wald chi2(37)    =     7114.99
Log pseudolikelihood =   -15307.278             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,354,460 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8740059   .0842168    -1.40   0.162      .723594    1.055684
               Kids under 18  |   .9757005   .1066031    -0.23   0.822     .7876185    1.208696
                              |
                         age1 |    1.17105   .0491788     3.76   0.000     1.078522    1.271517
                         age2 |   .9077659   .0830679    -1.06   0.290     .7587209     1.08609
                         age3 |   1.146447   .2482943     0.63   0.528     .7498999    1.752689
                       1.male |   1.636366   .0954875     8.44   0.000     1.459519     1.83464
                              |
                          imd |
                           2  |   1.197274   .1282285     1.68   0.093     .9705757    1.476922
                           3  |   1.332632   .1397874     2.74   0.006     1.084983    1.636808
                           4  |   1.820057   .1797963     6.06   0.000     1.499678    2.208879
             5 most deprived  |   1.936625   .1976127     6.48   0.000     1.585584    2.365386
                              |
                tot_adults_hh |
                           2  |   .8573921   .0639656    -2.06   0.039     .7407568     .992392
                           3  |   1.163288   .0829046     2.12   0.034     1.011636    1.337674
                              |
           1.htdiag_or_highbp |   1.461029   .0934337     5.93   0.000     1.288914    1.656128
1.chronic_respiratory_disease |      2.351   .2033901     9.88   0.000     1.984327    2.785428
                     1.asthma |   1.164323   .0837372     2.12   0.034     1.011244    1.340576
    1.chronic_cardiac_disease |   1.614835   .1310167     5.91   0.000     1.377423    1.893166
                              |
                      diabcat |
            T1DM, controlled  |   1.852657   .7725193     1.48   0.139     .8182044    4.194964
          T1DM, uncontrolled  |   2.714482   .6066783     4.47   0.000     1.751645    4.206567
            T2DM, controlled  |   2.370162   .2037908    10.04   0.000     2.002581    2.805213
          T2DM, uncontrolled  |   3.626082   .2968608    15.73   0.000     3.088526    4.257199
          Diabetes, no HbA1c  |   4.117642   1.881388     3.10   0.002     1.681616    10.08255
                              |
            cancer_exhaem_cat |
                   Last year  |   4.996794   .8736467     9.20   0.000     3.547041    7.039094
               2-5 years ago  |   2.826622   .3901811     7.53   0.000       2.1566     3.70481
                    5+ years  |   1.690377    .239334     3.71   0.000     1.280753    2.231012
                              |
              cancer_haem_cat |
                   Last year  |   7.194826   2.773469     5.12   0.000     3.379856     15.3159
               2-5 years ago  |   6.167935   1.472598     7.62   0.000     3.862913    9.848376
                    5+ years  |   2.215537   .5918206     2.98   0.003     1.312513    3.739852
                              |
      1.chronic_liver_disease |    3.26664   .4186963     9.24   0.000     2.540972    4.199549
            1.stroke_dementia |    1.73525    .204808     4.67   0.000     1.376881    2.186893
                1.other_neuro |   4.670714   .5811553    12.39   0.000     3.659925     5.96066
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.778889   .2670447    10.64   0.000     2.301828    3.354824
           Stage 4/5 egfr<30  |   6.780744   1.233048    10.53   0.000     4.747775    9.684217
                              |
                       1.esrd |    2.07104   .4203706     3.59   0.000     1.391283    3.082915
           1.other_transplant |   .6701944   .3517157    -0.76   0.446     .2396035    1.874599
                   1.asplenia |   1.529527   .5919809     1.10   0.272     .7163284    3.265895
           1.ra_sle_psoriasis |   1.179388   .1202962     1.62   0.106     .9656842    1.440384
               1.other_immuno |   2.626432   .5739032     4.42   0.000     1.711472    4.030535
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_death_noeth_12mo_ageband_0.ster not found)
file ./output/an_sense_covid_death_noeth_12mo_ageband_0.ster saved
   1:   3318.09 /        1 =    3318.0900

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,038,873             Number of obs    =  11,038,873
No. of failures      =        1,319
Time at risk         =   2018359765
                                                Wald chi2(39)    =     7116.53
Log pseudolikelihood =   -15306.628             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,354,460 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |   .9755113   .1065853    -0.23   0.820     .7874612    1.208469
                 1 child <12  |   .9312091   .1040652    -0.64   0.524     .7480369    1.159235
              2 children <12  |   .7520091   .1286722    -1.67   0.096     .5377479    1.051641
             3+ children <12  |   .8838689   .2434384    -0.45   0.654     .5151655    1.516453
                              |
                         age1 |   1.172869   .0494597     3.78   0.000     1.079828    1.273927
                         age2 |   .9036226   .0831345    -1.10   0.271      .754528    1.082178
                         age3 |   1.159881      .2526     0.68   0.496     .7568987    1.777415
                       1.male |   1.636946   .0955323     8.44   0.000     1.460017    1.835314
                              |
                          imd |
                           2  |   1.196999   .1282029     1.68   0.093     .9703465    1.476592
                           3  |   1.331709   .1397254     2.73   0.006     1.084176    1.635758
                           4  |   1.818979   .1796609     6.06   0.000     1.498837    2.207502
             5 most deprived  |   1.935146     .19747     6.47   0.000      1.58436    2.363599
                              |
                tot_adults_hh |
                           2  |   .8583995   .0640322    -2.05   0.041     .7416418    .9935386
                           3  |   1.163554   .0829221     2.13   0.034      1.01187    1.337976
                              |
           1.htdiag_or_highbp |   1.460831   .0934062     5.93   0.000     1.288765     1.65587
1.chronic_respiratory_disease |    2.35075   .2033564     9.88   0.000     1.984137    2.785104
                     1.asthma |   1.164335   .0837257     2.12   0.034     1.011275    1.340561
    1.chronic_cardiac_disease |   1.614943   .1310166     5.91   0.000      1.37753    1.893273
                              |
                      diabcat |
            T1DM, controlled  |   1.853925   .7730677     1.48   0.139     .8187471    4.197923
          T1DM, uncontrolled  |    2.71467   .6067116     4.47   0.000     1.751777    4.206832
            T2DM, controlled  |   2.370359   .2037998    10.04   0.000     2.002761    2.805428
          T2DM, uncontrolled  |   3.626533   .2968146    15.74   0.000     3.089049    4.257537
          Diabetes, no HbA1c  |   4.118373   1.881916     3.10   0.002     1.681759    10.08527
                              |
            cancer_exhaem_cat |
                   Last year  |    5.00301   .8744759     9.21   0.000     3.551811    7.047139
               2-5 years ago  |   2.825622   .3900292     7.53   0.000     2.155858    3.703463
                    5+ years  |    1.69055   .2393034     3.71   0.000     1.280965    2.231098
                              |
              cancer_haem_cat |
                   Last year  |   7.179837   2.768549     5.11   0.000     3.372025    15.28757
               2-5 years ago  |   6.159384   1.470642     7.61   0.000     3.857453    9.834992
                    5+ years  |   2.218981   .5925238     2.98   0.003     1.314805    3.744949
                              |
      1.chronic_liver_disease |   3.267012   .4186851     9.24   0.000     2.541351    4.199879
            1.stroke_dementia |   1.735414   .2048404     4.67   0.000     1.376991    2.187132
                1.other_neuro |   4.671392   .5812712    12.39   0.000     3.660408    5.961604
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.779548   .2671249    10.64   0.000     2.302346    3.355659
           Stage 4/5 egfr<30  |   6.794692   1.236497    10.53   0.000      4.75629    9.706693
                              |
                       1.esrd |    2.06732   .4197664     3.58   0.000     1.388585    3.077818
           1.other_transplant |   .6703867   .3518248    -0.76   0.446     .2396666    1.875182
                   1.asplenia |   1.526367   .5909325     1.09   0.275     .7146879    3.259878
           1.ra_sle_psoriasis |   1.178813   .1202267     1.61   0.107      .965231    1.439656
               1.other_immuno |   2.627757   .5742162     4.42   0.000     1.712304    4.032639
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_0.s
> ter not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_0.ster sav
> ed
   1:   1318.07 /        1 =    1318.0680

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,816             Number of obs    =   3,329,816
No. of failures      =        8,119
Time at risk         =    605245329
                                                Wald chi2(37)    =    16998.32
Log pseudolikelihood =   -89686.323             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,351 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9110519   .0796356    -1.07   0.287     .7676073    1.081302
               Kids under 18  |   .8626505   .1042956    -1.22   0.222     .6806493    1.093318
                              |
                         age1 |   1.047367   .0157434     3.08   0.002     1.016961    1.078683
                         age2 |   1.239671    .071724     3.71   0.000     1.106772    1.388528
                         age3 |   .5802124   .0844516    -3.74   0.000     .4362065    .7717593
                       1.male |   1.755142    .041738    23.66   0.000     1.675214    1.838883
                              |
                          imd |
                           2  |   1.114028   .0404007     2.98   0.003     1.037593    1.196094
                           3  |   1.228184   .0445216     5.67   0.000     1.143951    1.318619
                           4  |   1.417691   .0518052     9.55   0.000     1.319705    1.522951
             5 most deprived  |   1.661993   .0639211    13.21   0.000     1.541315    1.792119
                              |
                tot_adults_hh |
                           2  |   .7829753   .0204279    -9.38   0.000     .7439438    .8240547
                           3  |   .9863777   .0382048    -0.35   0.723     .9142693    1.064173
                              |
           1.htdiag_or_highbp |   .9281566   .0256964    -2.69   0.007     .8791346    .9799122
1.chronic_respiratory_disease |   1.845718   .0497519    22.74   0.000     1.750738    1.945852
                     1.asthma |   1.108178   .0350977     3.24   0.001     1.041479    1.179148
    1.chronic_cardiac_disease |   1.389175   .0338216    13.50   0.000     1.324443    1.457072
                              |
                      diabcat |
            T1DM, controlled  |   1.850939   .4007016     2.84   0.004      1.21093    2.829208
          T1DM, uncontrolled  |   2.902864   .3732356     8.29   0.000     2.256231    3.734822
            T2DM, controlled  |   1.488539   .0421877    14.04   0.000     1.408108    1.573565
          T2DM, uncontrolled  |   2.081715   .0731634    20.86   0.000     1.943145    2.230167
          Diabetes, no HbA1c  |    2.45532   .5821451     3.79   0.000     1.542738    3.907726
                              |
            cancer_exhaem_cat |
                   Last year  |   2.164368   .1507774    11.08   0.000     1.888137    2.481012
               2-5 years ago  |   1.223901   .0651694     3.79   0.000      1.10261    1.358534
                    5+ years  |   1.062034   .0366444     1.74   0.081     .9925869     1.13634
                              |
              cancer_haem_cat |
                   Last year  |   3.470673   .5238508     8.24   0.000     2.581882    4.665422
               2-5 years ago  |   2.456655    .247732     8.91   0.000     2.016081    2.993507
                    5+ years  |   1.570959   .1358459     5.22   0.000     1.326047    1.861106
                              |
      1.chronic_liver_disease |   2.063115   .1665391     8.97   0.000     1.761216    2.416765
            1.stroke_dementia |   1.736386   .0505349    18.96   0.000     1.640112    1.838312
                1.other_neuro |   2.500627    .120972    18.95   0.000      2.27442    2.749332
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.312607   .0344225    10.37   0.000     1.246844    1.381837
           Stage 4/5 egfr<30  |   2.460123   .1125539    19.68   0.000     2.249123    2.690918
                              |
                       1.esrd |   3.254196   .2882193    13.32   0.000     2.735609    3.871091
           1.other_transplant |   1.738081    .556666     1.73   0.084     .9277915    3.256039
                   1.asplenia |   1.041499    .214027     0.20   0.843     .6962058    1.558044
           1.ra_sle_psoriasis |   1.267903   .0475815     6.33   0.000     1.177992    1.364677
               1.other_immuno |   1.753992   .3121155     3.16   0.002     1.237542    2.485967
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_1.ster n
> ot found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |     -0.01082         1.00        1         0.3176
      2.kids_cat3 |      0.00442         0.17        1         0.6826
      age1        |     -0.00204         0.03        1         0.8525
      age2        |      0.00899         0.67        1         0.4146
      age3        |     -0.00836         0.57        1         0.4493
      0b.male     |            .            .        1             .
      1.male      |     -0.04922        21.50        1         0.0000
      1b.imd      |            .            .        1             .
      2.imd       |      0.00079         0.01        1         0.9416
      3.imd       |      0.01101         1.01        1         0.3139
      4.imd       |      0.00264         0.06        1         0.8089
      5.imd       |      0.01556         2.09        1         0.1484
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01232         1.37        1         0.2419
      3.tot_adul~h|      0.01922         3.60        1         0.0578
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.02487         5.29        1         0.0215
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.00274         0.07        1         0.7969
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01020         0.87        1         0.3512
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00699         0.44        1         0.5081
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.00821         0.58        1         0.4466
      3.diabcat   |     -0.00723         0.45        1         0.5042
      4.diabcat   |     -0.02455         5.05        1         0.0246
      5.diabcat   |     -0.02342         4.63        1         0.0314
      6.diabcat   |     -0.01037         0.89        1         0.3457
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00712         0.43        1         0.5115
      3.cancer_e~t|      0.00776         0.50        1         0.4796
      4.cancer_e~t|      0.01602         2.14        1         0.1437
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.00183         0.03        1         0.8647
      3.cancer_h~t|     -0.01085         0.99        1         0.3188
      4.cancer_h~t|     -0.00124         0.01        1         0.9101
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.01275         1.40        1         0.2368
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01567         2.26        1         0.1324
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.01301         1.54        1         0.2148
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.03919        14.18        1         0.0002
      3.reduced_~t|     -0.02241         4.85        1         0.0277
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00500         0.21        1         0.6497
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.01226         1.28        1         0.2570
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.01948         3.15        1         0.0758
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00664         0.36        1         0.5459
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.01734         2.59        1         0.1076
      ------------+---------------------------------------------------
      global test |                    127.17       37         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   2335.89 /        1 =    2335.8910
(80,436 observations deleted)
   1:   1243.22 /        1 =    1243.2170

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,253,154             Number of obs    =   3,253,154
No. of failures      =        7,803
Time at risk         =    591407756
                                                Wald chi2(37)    =    16303.35
Log pseudolikelihood =   -86039.963             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,464,925 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9449493   .0845296    -0.63   0.527     .7929851    1.126035
               Kids under 18  |   .8399012   .1067975    -1.37   0.170     .6546269    1.077612
                              |
                         age1 |   1.045422   .0159929     2.90   0.004     1.014542    1.077243
                         age2 |   1.240608   .0730783     3.66   0.000     1.105336    1.392435
                         age3 |   .5816912   .0862171    -3.66   0.000       .43504    .7777783
                       1.male |   1.760164   .0426319    23.34   0.000      1.67856    1.845736
                              |
                          imd |
                           2  |   1.116182    .041185     2.98   0.003     1.038311    1.199894
                           3  |   1.213717   .0449021     5.24   0.000     1.128825    1.304993
                           4  |   1.417598   .0526977     9.39   0.000     1.317985    1.524739
             5 most deprived  |   1.648704   .0645238    12.78   0.000     1.526968    1.780145
                              |
                tot_adults_hh |
                           2  |   .7916571   .0209853    -8.81   0.000     .7515768    .8338747
                           3  |   .9658874   .0382701    -0.88   0.381     .8937179    1.043885
                              |
           1.htdiag_or_highbp |   .9343846   .0264239    -2.40   0.016     .8840037    .9876367
1.chronic_respiratory_disease |   1.861119   .0511237    22.61   0.000     1.763568    1.964066
                     1.asthma |   1.105571   .0357503     3.10   0.002     1.037676    1.177908
    1.chronic_cardiac_disease |   1.395399   .0346384    13.42   0.000     1.329134    1.464968
                              |
                      diabcat |
            T1DM, controlled  |   1.931062   .4176398     3.04   0.002     1.263872    2.950459
          T1DM, uncontrolled  |   2.771763    .370959     7.62   0.000     2.132237    3.603103
            T2DM, controlled  |   1.492122    .043067    13.87   0.000     1.410056    1.578965
          T2DM, uncontrolled  |   2.082029   .0746421    20.46   0.000     1.940755    2.233587
          Diabetes, no HbA1c  |   2.699889   .6409557     4.18   0.000     1.695391    4.299538
                              |
            cancer_exhaem_cat |
                   Last year  |   2.146808   .1533902    10.69   0.000     1.866271    2.469516
               2-5 years ago  |   1.241737   .0668571     4.02   0.000     1.117376    1.379938
                    5+ years  |   1.050507   .0370787     1.40   0.163     .9802911    1.125753
                              |
              cancer_haem_cat |
                   Last year  |   3.389866   .5287412     7.83   0.000     2.496977     4.60204
               2-5 years ago  |   2.535998   .2558421     9.22   0.000      2.08102     3.09045
                    5+ years  |   1.587542   .1392673     5.27   0.000      1.33676    1.885372
                              |
      1.chronic_liver_disease |   1.990123   .1666343     8.22   0.000     1.688917    2.345047
            1.stroke_dementia |   1.722118   .0512621    18.26   0.000     1.624521    1.825579
                1.other_neuro |   2.478318   .1232435    18.25   0.000     2.248164    2.732035
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.323778   .0354058    10.49   0.000     1.256171    1.395023
           Stage 4/5 egfr<30  |   2.496707   .1162347    19.65   0.000     2.278975     2.73524
                              |
                       1.esrd |   3.296965   .2960773    13.28   0.000     2.764864    3.931468
           1.other_transplant |   1.649491    .554758     1.49   0.137     .8532437    3.188795
                   1.asplenia |    .997487   .2139494    -0.01   0.991     .6551403    1.518728
           1.ra_sle_psoriasis |   1.267959   .0485475     6.20   0.000      1.17629    1.366772
               1.other_immuno |   1.764813   .3190926     3.14   0.002     1.238211    2.515376
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covid_death_noeth_12mo_ageband_1.ster not found)
file ./output/an_sense_covid_death_noeth_12mo_ageband_1.ster saved
   1:   1278.68 /        1 =    1278.6820

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,253,154             Number of obs    =   3,253,154
No. of failures      =        7,803
Time at risk         =    591407756
                                                Wald chi2(39)    =    16306.96
Log pseudolikelihood =   -86039.445             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,464,925 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |    .840084   .1068221    -1.37   0.171     .6547672     1.07785
                 1 child <12  |   .9234692    .104162    -0.71   0.480     .7403069    1.151948
              2 children <12  |   .9053832   .1467874    -0.61   0.540     .6589149    1.244043
             3+ children <12  |   1.194768   .2857811     0.74   0.457     .7476207    1.909351
                              |
                         age1 |   1.045428   .0159928     2.90   0.004     1.014548    1.077248
                         age2 |   1.240521   .0730729     3.66   0.000      1.10526    1.392337
                         age3 |   .5817906   .0862313    -3.65   0.000     .4351151    .7779098
                       1.male |   1.760167   .0426323    23.34   0.000     1.678562     1.84574
                              |
                          imd |
                           2  |    1.11618    .041185     2.98   0.003     1.038308    1.199891
                           3  |   1.213559   .0448978     5.23   0.000     1.128675    1.304826
                           4  |   1.417429   .0526928     9.38   0.000     1.317826    1.524561
             5 most deprived  |    1.64818   .0645077    12.77   0.000     1.526475    1.779588
                              |
                tot_adults_hh |
                           2  |   .7916228   .0209846    -8.81   0.000     .7515439    .8338391
                           3  |   .9656246   .0382738    -0.88   0.377     .8934492    1.043631
                              |
           1.htdiag_or_highbp |   .9344249   .0264248    -2.40   0.016     .8840424    .9876788
1.chronic_respiratory_disease |   1.861179   .0511252    22.61   0.000     1.763625    1.964129
                     1.asthma |   1.105506   .0357488     3.10   0.002     1.037614    1.177841
    1.chronic_cardiac_disease |    1.39532    .034638    13.42   0.000     1.329056    1.464888
                              |
                      diabcat |
            T1DM, controlled  |   1.931759   .4177866     3.04   0.002     1.264332    2.951511
          T1DM, uncontrolled  |    2.77115   .3709007     7.62   0.000     2.131729    3.602366
            T2DM, controlled  |   1.492136   .0430658    13.87   0.000     1.410071    1.578976
          T2DM, uncontrolled  |   2.081491   .0746326    20.45   0.000     1.940236    2.233031
          Diabetes, no HbA1c  |   2.702693   .6416266     4.19   0.000     1.697146     4.30402
                              |
            cancer_exhaem_cat |
                   Last year  |   2.146678   .1533895    10.69   0.000     1.866142    2.469386
               2-5 years ago  |   1.241815    .066859     4.02   0.000     1.117451     1.38002
                    5+ years  |    1.05068    .037083     1.40   0.161     .9804553    1.125934
                              |
              cancer_haem_cat |
                   Last year  |   3.390703   .5288735     7.83   0.000     2.497592    4.603181
               2-5 years ago  |    2.53651   .2558925     9.23   0.000     2.081441     3.09107
                    5+ years  |   1.586673   .1392284     5.26   0.000     1.335966    1.884426
                              |
      1.chronic_liver_disease |   1.988456   .1664846     8.21   0.000     1.687519    2.343059
            1.stroke_dementia |   1.722026    .051261    18.26   0.000     1.624431    1.825484
                1.other_neuro |   2.478288   .1232374    18.25   0.000     2.248145    2.731992
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.323912   .0354097    10.49   0.000     1.256298    1.395165
           Stage 4/5 egfr<30  |    2.49694   .1162526    19.65   0.000     2.279176    2.735511
                              |
                       1.esrd |   3.295114   .2959757    13.28   0.000     2.763206    3.929412
           1.other_transplant |   1.652347     .55573     1.49   0.135     .8547096     3.19436
                   1.asplenia |   .9977383   .2140034    -0.01   0.992     .6553054    1.519111
           1.ra_sle_psoriasis |   1.267924   .0485468     6.20   0.000     1.176256    1.366735
               1.other_immuno |   1.764892   .3190929     3.14   0.002     1.238286     2.51545
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_1.s
> ter not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_1.ster sav
> ed

. 
. log close
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_covid_death.lo
> g
  log type:  text
 closed on:  12 Sep 2020, 10:49:48
--------------------------------------------------------------------------------------------------------------
