--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_co
> vidadmission.log
  log type:  text
 opened on:  12 Sep 2020, 08:56:51

. 
. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. foreach exposure_type in        kids_cat3  {
  4. 
. *Complete case ethnicity model
.         capture stcox   i.`exposure_type'                       ///
>                         $demogadjlist                           ///
>                         $comordidadjlist                ///
>                         , strata(stp) vce(cluster household_id)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_sense_`outcome'_CCeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 10. 
.  }
 11. }

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,004,061             Number of obs    =   9,004,061
No. of failures      =        4,533
Time at risk         =    806947440
                                                Wald chi2(46)    =     9566.01
Log pseudolikelihood =   -55013.591             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 5,683,154 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9635417   .0399751    -0.90   0.371     .8882928    1.045165
               Kids under 18  |   1.083634   .0559034     1.56   0.119     .9794222    1.198933
                              |
                         age1 |   1.077875    .010992     7.35   0.000     1.056545    1.099636
                         age2 |   .9729613   .0253183    -1.05   0.292     .9245825    1.023872
                         age3 |   .9874292   .0660007    -0.19   0.850     .8661853    1.125644
                       1.male |   1.504389   .0467907    13.13   0.000      1.41542     1.59895
                              |
                    ethnicity |
                       Mixed  |   2.421566    .230815     9.28   0.000      2.00892    2.918971
      Asian or Asian British  |   2.305024   .1139186    16.90   0.000     2.092221    2.539472
                       Black  |   2.863218   .1696337    17.76   0.000      2.54932    3.215767
                       Other  |   2.439897   .1891128    11.51   0.000     2.096024    2.840187
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.657142   .0644805    12.98   0.000     1.535461    1.788465
          Obese II (35-39.9)  |   2.202817     .10932    15.91   0.000     1.998644    2.427847
             Obese III (40+)  |   2.854775   .1675863    17.87   0.000     2.544503     3.20288
                              |
                 smoke_nomiss |
                      Former  |   .9754232   .0323025    -0.75   0.452     .9141225    1.040835
                     Current  |    .345002   .0199692   -18.39   0.000     .3080016    .3864473
                              |
                          imd |
                           2  |   1.047085   .0567673     0.85   0.396     .9415299    1.164473
                           3  |   1.087021   .0583534     1.55   0.120     .9784612    1.207625
                           4  |   1.194163   .0623297     3.40   0.001      1.07804    1.322794
             5 most deprived  |   1.300336   .0701912     4.87   0.000     1.169791    1.445449
                              |
                tot_adults_hh |
                           2  |   .9293186   .0376951    -1.81   0.071      .858298    1.006216
                           3  |   1.049085     .04282     1.17   0.240     .9684284    1.136459
                              |
           1.htdiag_or_highbp |   1.257653   .0448211     6.43   0.000     1.172804    1.348642
1.chronic_respiratory_disease |   2.356832   .1415638    14.27   0.000     2.095082    2.651284
                     1.asthma |   1.370758   .0506048     8.54   0.000     1.275077    1.473618
    1.chronic_cardiac_disease |   1.503655   .0794976     7.72   0.000     1.355644    1.667827
                              |
                      diabcat |
            T1DM, controlled  |   1.848567    .449745     2.53   0.012     1.147475    2.978018
          T1DM, uncontrolled  |   2.409423   .3347901     6.33   0.000     1.835009    3.163645
            T2DM, controlled  |   1.571857   .0859446     8.27   0.000     1.412121    1.749663
          T2DM, uncontrolled  |   2.347552   .1235594    16.21   0.000     2.117452    2.602656
          Diabetes, no HbA1c  |   2.121974    .709583     2.25   0.024     1.101794    4.086767
                              |
            cancer_exhaem_cat |
                   Last year  |   2.406542   .3767867     5.61   0.000      1.77061    3.270876
               2-5 years ago  |   1.277596   .1596761     1.96   0.050      1.00002    1.632217
                    5+ years  |   1.136143   .1198166     1.21   0.226     .9239872    1.397011
                              |
              cancer_haem_cat |
                   Last year  |   3.769943   1.281359     3.90   0.000     1.936518    7.339189
               2-5 years ago  |    4.87633   .8658902     8.92   0.000     3.443064    6.906229
                    5+ years  |   1.438124    .304863     1.71   0.087     .9491895    2.178912
                              |
      1.chronic_liver_disease |   1.903715   .1989586     6.16   0.000     1.551109    2.336478
            1.stroke_dementia |   1.466523   .1295474     4.33   0.000      1.23338    1.743737
                1.other_neuro |   2.585283   .2540672     9.67   0.000     2.132341    3.134436
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.570484   .1177641     6.02   0.000      1.35583    1.819121
           Stage 4/5 egfr<30  |   2.510837   .3907749     5.92   0.000     1.850723    3.406399
                              |
                       1.esrd |   3.869883   .5799283     9.03   0.000     2.884958    5.191062
           1.other_transplant |    1.10233   .3669678     0.29   0.770     .5740436    2.116792
                   1.asplenia |   1.755548   .4452405     2.22   0.026     1.067902    2.885982
           1.ra_sle_psoriasis |   1.255708    .074221     3.85   0.000     1.118348     1.40994
               1.other_immuno |   1.159986   .1929618     0.89   0.372     .8372534    1.607122
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covidadmission_CCeth_ageband_0.ster not found)
file ./output/an_sense_covidadmission_CCeth_ageband_0.ster saved

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,444,497             Number of obs    =   2,444,497
No. of failures      =        6,083
Time at risk         =    218606779
                                                Wald chi2(46)    =     8710.82
Log pseudolikelihood =   -66817.581             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 1,934,677 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9954811   .0843049    -0.05   0.957     .8432315     1.17522
               Kids under 18  |   .9802599   .1140658    -0.17   0.864     .7803564    1.231373
                              |
                         age1 |   1.006082   .0142619     0.43   0.669     .9785139    1.034427
                         age2 |   1.284906   .0741991     4.34   0.000     1.147407    1.438883
                         age3 |   .5238734   .0779352    -4.35   0.000     .3913771    .7012248
                       1.male |   1.652298   .0453608    18.29   0.000     1.565742    1.743639
                              |
                    ethnicity |
                       Mixed  |    1.41544   .2230086     2.21   0.027     1.039396    1.927533
      Asian or Asian British  |   1.455595   .0842427     6.49   0.000     1.299503    1.630437
                       Black  |   1.649114   .1285018     6.42   0.000     1.415544    1.921223
                       Other  |   1.351222   .1605694     2.53   0.011     1.070474      1.7056
                              |
                    obese4cat |
           Obese I (30-34.9)  |    1.22471   .0407043     6.10   0.000     1.147473    1.307144
          Obese II (35-39.9)  |   1.582386   .0761518     9.54   0.000     1.439954    1.738906
             Obese III (40+)  |    1.86035    .130004     8.88   0.000     1.622226    2.133427
                              |
                 smoke_nomiss |
                      Former  |   1.201842   .0360695     6.13   0.000     1.133186    1.274657
                     Current  |   .7955247   .0481671    -3.78   0.000     .7065054    .8957604
                              |
                          imd |
                           2  |   1.115634    .049085     2.49   0.013      1.02346    1.216109
                           3  |    1.18982   .0524209     3.94   0.000     1.091388     1.29713
                           4  |   1.356412   .0594334     6.96   0.000     1.244787    1.478048
             5 most deprived  |   1.487848   .0683941     8.64   0.000      1.35966    1.628122
                              |
                tot_adults_hh |
                           2  |   .7930016   .0239875    -7.67   0.000     .7473535    .8414379
                           3  |   .9274995   .0400043    -1.74   0.081     .8523151    1.009316
                              |
           1.htdiag_or_highbp |   .9581789   .0310763    -1.32   0.188     .8991659    1.021065
1.chronic_respiratory_disease |   1.859634   .0583714    19.76   0.000     1.748676    1.977632
                     1.asthma |   1.136509   .0397556     3.66   0.000     1.061201    1.217162
    1.chronic_cardiac_disease |   1.290651   .0369804     8.90   0.000     1.220169    1.365206
                              |
                      diabcat |
            T1DM, controlled  |   1.821544   .4275348     2.56   0.011     1.149884    2.885528
          T1DM, uncontrolled  |   1.901779   .3186464     3.84   0.000      1.36943    2.641073
            T2DM, controlled  |   1.372601   .0460602     9.44   0.000     1.285229    1.465912
          T2DM, uncontrolled  |   1.946995   .0776506    16.71   0.000     1.800599    2.105294
          Diabetes, no HbA1c  |   2.200507   .6127029     2.83   0.005     1.275019    3.797772
                              |
            cancer_exhaem_cat |
                   Last year  |   1.878053   .1609103     7.36   0.000     1.587733    2.221459
               2-5 years ago  |   1.166287   .0736645     2.44   0.015     1.030487    1.319984
                    5+ years  |   1.125262   .0452206     2.94   0.003     1.040032    1.217477
                              |
              cancer_haem_cat |
                   Last year  |     2.6381   .5243534     4.88   0.000      1.78692    3.894732
               2-5 years ago  |   2.536065    .292859     8.06   0.000     2.022393    3.180206
                    5+ years  |   1.491582   .1545835     3.86   0.000     1.217394    1.827525
                              |
      1.chronic_liver_disease |   1.703965   .1572841     5.77   0.000     1.421971    2.041882
            1.stroke_dementia |   1.647013   .0584313    14.06   0.000     1.536381    1.765612
                1.other_neuro |     2.0346    .124699    11.59   0.000     1.804303    2.294291
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.295694    .039694     8.46   0.000     1.220185    1.375876
           Stage 4/5 egfr<30  |   2.138527   .1212298    13.41   0.000     1.913645    2.389835
                              |
                       1.esrd |   3.619075   .3463768    13.44   0.000     3.000062    4.365811
           1.other_transplant |   1.340465   .5151733     0.76   0.446     .6311287    2.847036
                   1.asplenia |   1.775432   .3224295     3.16   0.002     1.243714    2.534472
           1.ra_sle_psoriasis |   1.306664     .05512     6.34   0.000     1.202977    1.419289
               1.other_immuno |   1.541297    .307135     2.17   0.030     1.042959    2.277748
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_covidadmission_CCeth_ageband_1.ster not found)
file ./output/an_sense_covidadmission_CCeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_co
> vidadmission.log
  log type:  text
 closed on:  12 Sep 2020, 10:22:07
--------------------------------------------------------------------------------------------------------------
