--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_no
> n_covid_death.log
  log type:  text
 opened on:  12 Sep 2020, 08:56:50

. 
. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. foreach exposure_type in        kids_cat3  {
  4. 
. *Complete case ethnicity model
.         capture stcox   i.`exposure_type'                       ///
>                         $demogadjlist                           ///
>                         $comordidadjlist                ///
>                         , strata(stp) vce(cluster household_id)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_sense_`outcome'_CCeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `outcome')"
 10. 
.  }
 11. }

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    9,004,061             Number of obs    =   9,004,061
No. of failures      =        7,565
Time at risk         =   1644837885
                                                Wald chi2(46)    =    46219.85
Log pseudolikelihood =   -83567.557             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 5,683,154 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .6768949   .0314741    -8.39   0.000     .6179342    .7414814
               Kids under 18  |    .740732   .0386269    -5.76   0.000      .668765    .8204436
                              |
                         age1 |   1.102049   .0168345     6.36   0.000     1.069543    1.135543
                         age2 |    .996489    .034382    -0.10   0.919     .9313295    1.066207
                         age3 |    .910493   .0754051    -1.13   0.258     .7740729    1.070955
                       1.male |   1.349562   .0331836    12.19   0.000     1.286066    1.416194
                              |
                    ethnicity |
                       Mixed  |   .6788552   .0932673    -2.82   0.005     .5185987     .888634
      Asian or Asian British  |   .8589006    .049853    -2.62   0.009     .7665435    .9623854
                       Black  |   .8985966   .0688551    -1.40   0.163     .7732881    1.044211
                       Other  |   .5840576   .0699691    -4.49   0.000     .4618311    .7386322
                              |
                    obese4cat |
           Obese I (30-34.9)  |   .7350702   .0252424    -8.96   0.000     .6872243    .7862473
          Obese II (35-39.9)  |   .8058727   .0385762    -4.51   0.000     .7337032     .885141
             Obese III (40+)  |   1.149268    .062772     2.55   0.011     1.032594    1.279126
                              |
                 smoke_nomiss |
                      Former  |   1.221081   .0373423     6.53   0.000     1.150042    1.296509
                     Current  |   2.142846   .0692143    23.60   0.000     2.011394     2.28289
                              |
                          imd |
                           2  |   1.095173    .047546     2.09   0.036     1.005839    1.192441
                           3  |   1.224144   .0523409     4.73   0.000     1.125739    1.331151
                           4  |   1.361481   .0571205     7.35   0.000     1.254006    1.478167
             5 most deprived  |   1.646181   .0693876    11.83   0.000      1.51565    1.787954
                              |
                tot_adults_hh |
                           2  |   .7708578   .0220917    -9.08   0.000     .7287524    .8153959
                           3  |    .764799   .0237204    -8.65   0.000     .7196927    .8127322
                              |
           1.htdiag_or_highbp |   1.192909   .0316468     6.65   0.000     1.132468    1.256577
1.chronic_respiratory_disease |   2.237993   .0827512    21.79   0.000     2.081541    2.406204
                     1.asthma |   1.048525   .0326739     1.52   0.128     .9864016    1.114561
    1.chronic_cardiac_disease |   1.897957   .0673958    18.05   0.000     1.770355    2.034755
                              |
                      diabcat |
            T1DM, controlled  |   2.183964   .3663922     4.66   0.000     1.571969    3.034221
          T1DM, uncontrolled  |   2.538478   .2718356     8.70   0.000     2.057887    3.131304
            T2DM, controlled  |   1.423865   .0628882     8.00   0.000     1.305791    1.552616
          T2DM, uncontrolled  |   1.789724   .0815321    12.78   0.000     1.636851    1.956876
          Diabetes, no HbA1c  |   3.538824   .8011123     5.58   0.000      2.27073    5.515087
                              |
            cancer_exhaem_cat |
                   Last year  |    36.3348   1.469305    88.85   0.000     33.56618    39.33178
               2-5 years ago  |   14.42172   .5503887    69.93   0.000     13.38233    15.54183
                    5+ years  |   4.841638   .2216024    34.46   0.000     4.426217    5.296048
                              |
              cancer_haem_cat |
                   Last year  |   7.905393   1.235931    13.22   0.000     5.818974    10.73991
               2-5 years ago  |   4.425069   .5506764    11.95   0.000     3.467309    5.647388
                    5+ years  |   1.821129   .2239444     4.87   0.000     1.431095    2.317464
                              |
      1.chronic_liver_disease |   5.318405   .2519993    35.27   0.000     4.846736    5.835976
            1.stroke_dementia |   1.858048   .0996475    11.55   0.000     1.672657    2.063987
                1.other_neuro |   3.053635   .1992327    17.11   0.000     2.687082     3.47019
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.892462   .0950641    12.70   0.000     1.715018    2.088265
           Stage 4/5 egfr<30  |   5.437468   .5558551    16.56   0.000     4.450216    6.643736
                              |
                       1.esrd |   1.593229   .1974382     3.76   0.000     1.249668    2.031243
           1.other_transplant |   .7606897   .1864157    -1.12   0.264     .4705555    1.229714
                   1.asplenia |   2.075098   .2744122     5.52   0.000     1.601309     2.68907
           1.ra_sle_psoriasis |   1.102988   .0500496     2.16   0.031     1.009128    1.205578
               1.other_immuno |   1.859294   .2084745     5.53   0.000     1.492473    2.316272
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_non_covid_death_CCeth_ageband_0.ster not found)
file ./output/an_sense_non_covid_death_CCeth_ageband_0.ster saved

--------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,444,497             Number of obs    =   2,444,497
No. of failures      =       35,642
Time at risk         =    444468313
                                                Wald chi2(46)    =    80195.77
Log pseudolikelihood =   -382923.15             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 1,934,677 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9811683   .0439255    -0.42   0.671     .8987449    1.071151
               Kids under 18  |   .9784441   .0571752    -0.37   0.709     .8725618    1.097175
                              |
                         age1 |   1.087244     .00754    12.06   0.000     1.072566    1.102123
                         age2 |   .9717361    .025989    -1.07   0.284     .9221107    1.024032
                         age3 |   1.162807   .0784579     2.24   0.025     1.018767    1.327213
                       1.male |   1.147328   .0131924    11.95   0.000      1.12176    1.173478
                              |
                    ethnicity |
                       Mixed  |   .8461894   .0847372    -1.67   0.095       .69539    1.029691
      Asian or Asian British  |   .9045183   .0314555    -2.89   0.004     .8449208    .9683196
                       Black  |   .7871203   .0449722    -4.19   0.000     .7037325    .8803891
                       Other  |   .7157578   .0579581    -4.13   0.000     .6107178    .8388641
                              |
                    obese4cat |
           Obese I (30-34.9)  |   .7666375   .0123482   -16.50   0.000     .7428135    .7912257
          Obese II (35-39.9)  |   .9233558   .0233223    -3.16   0.002     .8787579    .9702171
             Obese III (40+)  |   1.187791   .0440516     4.64   0.000     1.104515    1.277346
                              |
                 smoke_nomiss |
                      Former  |   1.153261   .0144985    11.34   0.000     1.125192     1.18203
                     Current  |   1.907159   .0376776    32.68   0.000     1.834724    1.982454
                              |
                          imd |
                           2  |   1.107961   .0186766     6.08   0.000     1.071954    1.145178
                           3  |   1.155906   .0197649     8.47   0.000     1.117809    1.195301
                           4  |   1.244808   .0219195    12.44   0.000      1.20258     1.28852
             5 most deprived  |   1.386368   .0260351    17.40   0.000     1.336268    1.438347
                              |
                tot_adults_hh |
                           2  |   .8991968   .0111733    -8.55   0.000     .8775621    .9213649
                           3  |   1.066615   .0202361     3.40   0.001     1.027681    1.107024
                              |
           1.htdiag_or_highbp |   .9523483   .0125444    -3.71   0.000     .9280763     .977255
1.chronic_respiratory_disease |   1.850788   .0244569    46.59   0.000     1.803469    1.899349
                     1.asthma |   .9264019   .0149127    -4.75   0.000     .8976298    .9560962
    1.chronic_cardiac_disease |   1.529209   .0180213    36.04   0.000     1.494293    1.564942
                              |
                      diabcat |
            T1DM, controlled  |   1.957169   .2125616     6.18   0.000     1.581911    2.421444
          T1DM, uncontrolled  |   2.205463   .1519422    11.48   0.000     1.926893    2.524307
            T2DM, controlled  |   1.282142   .0183592    17.36   0.000     1.246659    1.318635
          T2DM, uncontrolled  |   1.443079   .0284351    18.61   0.000      1.38841    1.499901
          Diabetes, no HbA1c  |   1.673608   .2425595     3.55   0.000     1.259758    2.223413
                              |
            cancer_exhaem_cat |
                   Last year  |   7.953768   .1688422    97.68   0.000     7.629633    8.291673
               2-5 years ago  |   3.032928   .0580796    57.94   0.000     2.921204    3.148925
                    5+ years  |   1.570021   .0243647    29.07   0.000     1.522986    1.618509
                              |
              cancer_haem_cat |
                   Last year  |   4.123563   .2821807    20.70   0.000     3.605984    4.715431
               2-5 years ago  |   2.466855   .1204389    18.49   0.000     2.241742    2.714575
                    5+ years  |   1.726957   .0690062    13.67   0.000     1.596868    1.867644
                              |
      1.chronic_liver_disease |   2.439894   .0876572    24.83   0.000     2.273998    2.617892
            1.stroke_dementia |   1.686551   .0242406    36.37   0.000     1.639703    1.734738
                1.other_neuro |   2.136807   .0556038    29.18   0.000     2.030558    2.248615
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.142898   .0145949    10.46   0.000     1.114648    1.171865
           Stage 4/5 egfr<30  |   2.306148    .052666    36.59   0.000     2.205201    2.411717
                              |
                       1.esrd |   2.298982    .126223    15.16   0.000     2.064435    2.560176
           1.other_transplant |   .9851906   .2102303    -0.07   0.944     .6484582    1.496782
                   1.asplenia |   1.299694   .1076447     3.16   0.002     1.104948    1.528763
           1.ra_sle_psoriasis |   1.124397   .0210382     6.27   0.000     1.083909    1.166396
               1.other_immuno |   2.157184   .1692978     9.80   0.000     1.849626    2.515882
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_sense_non_covid_death_CCeth_ageband_1.ster not found)
file ./output/an_sense_non_covid_death_CCeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\anna\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_FULL_Sense1_no
> n_covid_death.log
  log type:  text
 closed on:  12 Sep 2020, 11:34:27
--------------------------------------------------------------------------------------------------------------
