----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\01_cr_analysis_dataset.log
  log type:  text
 opened on:   6 Aug 2020, 20:42:08

. 
. 
. /* CONVERT STRINGS TO DATE====================================================*/
. /* Comorb dates and TPP case outcome dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                                                                                     
>   */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(23,041,976 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(1,281,118 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(407,246 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 permanent_immunodeficiency  ///
>                                                 temporary_immunodeficiency  ///
>                                                 dialysis                                        ///
>                                                 kidney_transplant                       ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 dereg_date ///
>                                                 covid_tpp_probable ///
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(23,144,258 real changes made)
(22,383,693 real changes made)
(22,383,693 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(23,144,258 real changes made)
(21,861,158 real changes made)
(21,861,158 missing values generated)
variable diabetes was str7 now str10
(23,144,258 real changes made)
(21,353,612 real changes made)
(21,353,612 missing values generated)
variable cancer_haem was str7 now str10
(23,144,258 real changes made)
(23,032,771 real changes made)
(23,032,771 missing values generated)
variable cancer_nonhaem was str7 now str10
(23,144,258 real changes made)
(22,215,662 real changes made)
(22,215,662 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(23,144,258 real changes made)
(23,090,603 real changes made)
(23,090,603 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(23,144,258 real changes made)
(23,138,885 real changes made)
(23,138,885 missing values generated)
variable dialysis was str7 now str10
(23,144,258 real changes made)
(23,122,446 real changes made)
(23,122,446 missing values generated)
variable kidney_transplant was str7 now str10
(23,144,258 real changes made)
(23,129,076 real changes made)
(23,129,076 missing values generated)
variable other_transplant was str7 now str10
(23,144,258 real changes made)
(23,139,469 real changes made)
(23,139,469 missing values generated)
variable asplenia was str7 now str10
(23,144,258 real changes made)
(23,117,467 real changes made)
(23,117,467 missing values generated)
variable chronic_liver_disease was str7 now str10
(23,144,258 real changes made)
(23,032,174 real changes made)
(23,032,174 missing values generated)
variable other_neuro was str7 now str10
(23,144,258 real changes made)
(22,949,287 real changes made)
(22,949,287 missing values generated)
variable stroke_dementia was str7 now str10
(23,144,258 real changes made)
(22,710,042 real changes made)
(22,710,042 missing values generated)
variable esrf was str7 now str10
(23,144,258 real changes made)
(23,117,360 real changes made)
(23,117,360 missing values generated)
variable hypertension was str7 now str10
(23,144,258 real changes made)
(19,271,158 real changes made)
(19,271,158 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(23,144,258 real changes made)
(22,189,540 real changes made)
(22,189,540 missing values generated)
variable bmi_date_measured was str7 now str10
(23,144,258 real changes made)
(8,263,506 real changes made)
(8,263,506 missing values generated)
variable bp_sys_date_measured was str7 now str10
(23,144,258 real changes made)
(6,064,005 real changes made)
(6,064,005 missing values generated)
variable bp_dias_date_measured was str7 now str10
(23,144,258 real changes made)
(6,067,443 real changes made)
(6,067,443 missing values generated)
variable creatinine_date was str7 now str10
(23,144,258 real changes made)
(8,845,145 real changes made)
(8,845,145 missing values generated)
variable smoking_status_date was str7 now str10
(23,144,258 real changes made)
(4,681,853 real changes made)
(4,681,853 missing values generated)
variable dereg_date was str7 now str10
(23,144,258 real changes made)
(22,799,046 real changes made)
(22,799,046 missing values generated)
variable covid_tpp_probable was str7 now str10
(23,144,258 real changes made)
(23,076,336 real changes made)
(23,076,336 missing values generated)

. 
. * Recode to dates from the strings 
. foreach var of varlist  died_date_ons   {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td 
  7.         
. }
(23,042,533 missing values generated)

. 
. /*Tab all variables in initial extract*/
. sum, d f

                         patient_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%       430047           2878
 5%      2037781           7276
10%      4182450           9969       Obs          23,144,258
25%     1.04e+07           9970       Sum of Wgt.    23144258

50%     2.17e+07                      Mean           2.31e+07
                        Largest       Std. Dev.      1.47e+07
75%     3.47e+07       5.32e+07
90%     4.49e+07       5.32e+07       Variance       2.15e+14
95%     4.85e+07       5.32e+07       Skewness        .257513
99%     5.14e+07       5.32e+07       Kurtosis       1.936042

                       dereg_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2020      15feb2020
 5%    15feb2020      15feb2020
10%    15feb2020      15feb2020       Obs             345,212
25%    15mar2020      15feb2020       Sum of Wgt.     345,212

50%    15apr2020                      Mean          24apr2020
                        Largest       Std. Dev.      52.53578
75%    15jun2020      15jul2020
90%    15jul2020      15jul2020       Variance       2760.008
95%    15jul2020      15jul2020       Skewness       .1724524
99%    15jul2020      15jul2020       Kurtosis       1.705025

                     has_12_m_follow_up
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs          23,144,258
25%            1              0       Sum of Wgt.    23144258

50%            1                      Mean           .9366092
                        Largest       Std. Dev.      .2436646
75%            1              1
90%            1              1       Variance       .0593724
95%            1              1       Skewness       -3.58369
99%            1              1       Kurtosis       13.84283

                   died_ons_covid_flag_any
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          23,144,258
25%            0              0       Sum of Wgt.    23144258

50%            0                      Mean           .0007425
                        Largest       Std. Dev.       .027239
75%            0              1
90%            0              1       Variance        .000742
95%            0              1       Skewness       36.65749
99%            0              1       Kurtosis       1344.772

               died_ons_covid_flag_underlying
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          23,144,258
25%            0              0       Sum of Wgt.    23144258

50%            0                      Mean            .000689
                        Largest       Std. Dev.      .0262403
75%            0              1
90%            0              1       Variance       .0006886
95%            0              1       Skewness       38.05686
99%            0              1       Kurtosis       1449.324

                   covid_tpp_probable_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15mar2020      15jan1900
 5%    15mar2020      15jan1900
10%    15apr2020      15jan1900       Obs              67,922
25%    15apr2020      15jan1900       Sum of Wgt.      67,922

50%    15may2020                      Mean          14apr2020
                        Largest       Std. Dev.      876.4289
75%    15jun2020      15jul2020
90%    15jul2020      15jul2020       Variance       768127.6
95%    15jul2020      15jul2020       Skewness      -45.48585
99%    15jul2020      15jul2020       Kurtosis       2189.943

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1             -1
 5%            5              0
10%            9              0       Obs          23,144,258
25%           22              0       Sum of Wgt.    23144258

50%           40                      Mean           41.03637
                        Largest       Std. Dev.       23.4111
75%           59            119
90%           73            120       Variance       548.0797
95%           80            120       Skewness       .1106178
99%           89            121       Kurtosis       2.061029

                             sex
-------------------------------------------------------------
no observations

                             imd
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%         1100             -1
10%         2600             -1       Obs          23,144,258
25%         7600             -1       Sum of Wgt.    23144258

50%        15900                      Mean           15831.24
                        Largest       Std. Dev.      9503.878
75%        23900          32800
90%        29000          32800       Variance       9.03e+07
95%        30900          32800       Skewness        .018729
99%        32400          32800       Kurtosis       1.819374

                             stp
-------------------------------------------------------------
no observations

                          ethnicity
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs          16,645,050
25%            1              1       Sum of Wgt.    16645050

50%            1                      Mean           1.385243
                        Largest       Std. Dev.      .9522604
75%            1              5
90%            3              5       Variance       .9067999
95%            4              5       Skewness       2.443765
99%            5              5       Kurtosis       7.977504

                       ethnicity_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%         2003           1888
 5%         2007           1899
10%         2008           1899       Obs          16,645,050
25%         2010           1899       Sum of Wgt.    16645050

50%         2013                      Mean           2012.828
                        Largest       Std. Dev.      8.151854
75%         2017           2066
90%         2019           2075       Variance       66.45272
95%         2019           2081       Skewness      -10.21342
99%         2020           2095       Kurtosis       140.2878

                        household_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          23,144,258
25%      1461749              0       Sum of Wgt.    23144258

50%      4305535                      Mean            4386205
                        Largest       Std. Dev.       3163672
75%      7074970       1.01e+07
90%      8898028       1.01e+07       Variance       1.00e+13
95%      9528389       1.01e+07       Skewness       .1255558
99%     1.00e+07       1.01e+07       Kurtosis       1.750666

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          23,144,258
25%            1              0       Sum of Wgt.    23144258

50%            3                      Mean           4.890642
                        Largest       Std. Dev.      50.03596
75%            4           3355
90%            5           3355       Variance       2503.597
95%            7           3355       Skewness        42.5186
99%           14           3355       Kurtosis       2380.142

                       care_home_type
-------------------------------------------------------------
no observations

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0        -3460.2
 5%            0         -277.8
10%            0           -2.1       Obs          23,144,258
25%            0           -1.8       Sum of Wgt.    23144258

50%         22.8                      Mean           58.17932
                        Largest       Std. Dev.      8016.014
75%           28        1520000
90%           33        1805556       Variance       6.43e+07
95%         36.5       1.95e+07       Skewness       2572.416
99%         44.8       2.85e+07       Kurtosis        8408917

                   bmi_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug2010      15feb2010
 5%    15may2012      15feb2010
10%    15oct2013      15feb2010       Obs          14,880,752
25%    15jun2016      15feb2010       Sum of Wgt.    14880752

50%    15oct2018                      Mean          22oct2017
                        Largest       Std. Dev.      1820.199
75%    15oct2019      15mar9909
90%    15feb2020      15apr9909       Variance        3313126
95%    15apr2020      15apr9912       Skewness       1138.369
99%    15jul2020      15jul9935       Kurtosis        1764924

                           bp_sys
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs          23,144,258
25%            0             -1       Sum of Wgt.    23144258

50%          120                      Mean             93.349
                        Largest       Std. Dev.       116.789
75%          132         136136
90%          142         137137       Variance       13639.66
95%          149         139139       Skewness       771.8543
99%          167         139139       Kurtosis       826316.5

                  bp_sys_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15sep2003      15jan1860
 5%    15dec2010      15jan1860
10%    15jan2014      15sep1899       Obs          17,080,253
25%    15mar2017      15dec1899       Sum of Wgt.    17080253

50%    15feb2019                      Mean          11oct2017
                        Largest       Std. Dev.      1279.141
75%    15sep2019      15feb2020
90%    15dec2019      15feb2020       Variance        1636201
95%    15jan2020      15feb2020       Skewness      -5.001279
99%    15jan2020      15feb2020       Kurtosis       90.33607

                           bp_dias
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs          23,144,258
25%            0             -1       Sum of Wgt.    23144258

50%           70                      Mean            56.1377
                        Largest       Std. Dev.       39.3957
75%           80           7597
90%           87           7690       Variance       1552.021
95%           90           9074       Skewness        500.721
99%          100          89147       Kurtosis        1130362

                 bp_dias_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15oct2003      15jan1860
 5%    15dec2010      15jan1860
10%    15jan2014      15sep1899       Obs          17,076,815
25%    15mar2017      15dec1899       Sum of Wgt.    17076815

50%    15feb2019                      Mean          12oct2017
                        Largest       Std. Dev.      1256.739
75%    15sep2019      15feb2020
90%    15dec2019      15feb2020       Variance        1579393
95%    15jan2020      15feb2020       Skewness      -4.060276
99%    15jan2020      15feb2020       Kurtosis       55.45331

                         creatinine
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0            -40
 5%            0             -1
10%            0             -1       Obs          23,144,258
25%            0             -1       Sum of Wgt.    23144258

50%           60                      Mean            1347.91
                        Largest       Std. Dev.      327805.7
75%           77       1.19e+08
90%           92       1.20e+08       Variance       1.07e+11
95%          101       1.21e+08       Skewness       264.8998
99%          129       1.58e+08       Kurtosis       72906.44

                    creatinine_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15dec2004      15dec1899
 5%    15nov2010      15dec1899
10%    15aug2013      15dec1899       Obs          14,299,113
25%    15jan2017      15jan1900       Sum of Wgt.    14299113

50%    15jan2019                      Mean          17sep2017
                        Largest       Std. Dev.      1184.466
75%    15sep2019      15feb2020
90%    15dec2019      15feb2020       Variance        1402960
95%    15jan2020      15feb2020       Skewness      -3.693102
99%    15jan2020      15feb2020       Kurtosis       60.95081

                       smoking_status
-------------------------------------------------------------
no observations

                  smoking_status_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15dec2004      15sep1899
 5%    15feb2010      15sep1899
10%    15aug2012      15sep1899       Obs          18,462,405
25%    15oct2015      15sep1899       Sum of Wgt.    18462405

50%    15jul2018                      Mean          15feb2017
                        Largest       Std. Dev.      1324.264
75%    15jul2019      15feb2020
90%    15nov2019      15feb2020       Variance        1753674
95%    15dec2019      15feb2020       Skewness      -4.693613
99%    15jan2020      15feb2020       Kurtosis       97.62953

              chronic_respiratory_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15sep1991      15jan1860
10%    15may2001      15dec1899       Obs             760,565
25%    15oct2007      15dec1899       Sum of Wgt.     760,565

50%    15mar2013                      Mean          24apr2009
                        Largest       Std. Dev.      6326.979
75%    15mar2017      15jul2020
90%    15mar2019      15jul2020       Variance       4.00e+07
95%    15oct2019      15jul2020       Skewness      -4.830857
99%    15apr2020      15jul2020       Kurtosis       29.47713

                chronic_cardiac_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1840
 5%    15jan1987      15dec1840
10%    15sep1994      15jan1850       Obs           1,283,100
25%    15jul2003      15jan1850       Sum of Wgt.   1,283,100

50%    15may2011                      Mean          08jan2007
                        Largest       Std. Dev.      6547.281
75%    15aug2016      15jul2020
90%    15jan2019      15jul2020       Variance       4.29e+07
95%    15oct2019      15jul2020       Skewness      -4.263386
99%    15may2020      15sep2106       Kurtosis       25.04925

                        diabetes_type
-------------------------------------------------------------
no observations

                     diabetes_exeter_os
-------------------------------------------------------------
no observations

                       diabetes_exeter
-------------------------------------------------------------
no observations

                     hba1c_mmol_per_mol
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0           -782
 5%            0             -2
10%            0             -1       Obs          23,144,258
25%            0             -1       Sum of Wgt.    23144258

50%            0                      Mean           18.00621
                        Largest       Std. Dev.      1818.833
75%           37         107000
90%           42         111000       Variance        3308152
95%           47         759550       Skewness       4712.378
99%           73        8688000       Kurtosis       2.25e+07

                   hba1c_mmol_per_mol_date
-------------------------------------------------------------
no observations

                      hba1c_percentage
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -2
 5%            0             -1
10%            0             -1       Obs          23,144,258
25%            0             -1       Sum of Wgt.    23144258

50%            0                      Mean           1.549741
                        Largest       Std. Dev.      3977.692
75%            0            935
90%          5.1         231855       Variance       1.58e+07
95%          5.7         930709       Skewness       4793.289
99%          7.6       1.91e+07       Kurtosis       2.30e+07

                    hba1c_percentage_date
-------------------------------------------------------------
no observations

                      cancer_haem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1840
 5%    15jan1986      15jan1860
10%    15aug1994      15dec1899       Obs             111,487
25%    15mar2005      15dec1899       Sum of Wgt.     111,487

50%    15dec2012                      Mean          13aug2008
                        Largest       Std. Dev.      5744.142
75%    15jun2017      15jul2020
90%    15may2019      15jul2020       Variance       3.30e+07
95%    15dec2019      15jul2020       Skewness      -4.324275
99%    15jun2020      15jul2020       Kurtosis       28.52334

                     cancer_nonhaem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15dec1840
 5%    15jan1991      15jan1860
10%    15jul1997      15jan1860       Obs             928,596
25%    15dec2005      15jan1860       Sum of Wgt.     928,596

50%    15nov2012                      Mean          25sep2009
                        Largest       Std. Dev.      4631.079
75%    15jun2017      15jul2020
90%    15jun2019      15jul2020       Variance       2.14e+07
95%    15dec2019      15nov2020       Skewness      -4.541344
99%    15jun2020      15dec2100       Kurtosis       36.24105

               permanent_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1900
 5%    15sep1993      15jan1900
10%    15may2000      15jan1900       Obs              53,655
25%    15may2007      15jan1900       Sum of Wgt.      53,655

50%    15mar2013                      Mean          03jul2009
                        Largest       Std. Dev.      6001.611
75%    15mar2017      15jan2020
90%    15jan2019      15jan2020       Variance       3.60e+07
95%    15jul2019      15jan2020       Skewness      -5.199382
99%    15dec2019      15jan2020       Kurtosis       34.23438

                        asplenia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15jun1956      15dec1899
10%    15jan1967      15dec1899       Obs              26,791
25%    15jun1980      15dec1899       Sum of Wgt.      26,791

50%    15jan1999                      Mean          23mar1993
                        Largest       Std. Dev.      9041.132
75%    15dec2011      15jul2020
90%    15sep2017      15jul2020       Variance       8.17e+07
95%    15mar2019      15jul2020       Skewness       -1.77181
99%    15mar2020      15jul2020       Kurtosis       7.245066

               temporary_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2019      15feb2019
 5%    15feb2019      15feb2019
10%    15mar2019      15feb2019       Obs               5,373
25%    15jun2019      15feb2019       Sum of Wgt.       5,373

50%    15sep2019                      Mean          29aug2019
                        Largest       Std. Dev.      103.2551
75%    15nov2019      15jan2020
90%    15jan2020      15jan2020       Variance       10661.61
95%    15jan2020      15jan2020       Skewness      -.4039046
99%    15jan2020      15jan2020       Kurtosis       2.021719

                 chronic_liver_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1840
 5%    15jan1992      15jan1860
10%    15sep1999      15dec1899       Obs             112,084
25%    15jun2007      15dec1899       Sum of Wgt.     112,084

50%    15mar2014                      Mean          20sep2009
                        Largest       Std. Dev.      6318.794
75%    15dec2017      15jul2020
90%    15jul2019      15jul2020       Variance       3.99e+07
95%    15dec2019      15nov2020       Skewness      -4.921519
99%    15jun2020      15oct2021       Kurtosis       30.86029

                    stroke_dementia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1899
 5%    15dec1994      15dec1899
10%    15sep2000      15dec1899       Obs             434,216
25%    15jan2008      15dec1899       Sum of Wgt.     434,216

50%    15apr2014                      Mean          11aug2010
                        Largest       Std. Dev.      5468.974
75%    15dec2017      15jul2020
90%    15jul2019      15jul2020       Variance       2.99e+07
95%    15jan2020      15sep2020       Skewness       -5.44208
99%    15jun2020      15jul2096       Kurtosis       39.37072

                      other_neuro_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jan1965      15jan1800
10%    15jan1980      15jan1860       Obs             194,971
25%    15sep1997      15dec1899       Sum of Wgt.     194,971

50%    15feb2009                      Mean          04jun2002
                        Largest       Std. Dev.      8100.035
75%    15jan2016      15jul2020
90%    15nov2018      15jul2020       Variance       6.56e+07
95%    15aug2019      15jul2020       Skewness      -2.866313
99%    15apr2020      15jul2020       Kurtosis       12.87227

                          esrf_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15aug1986      15dec1899
10%    15jun1995      15dec1899       Obs              26,898
25%    15jan2006      15dec1899       Sum of Wgt.      26,898

50%    15sep2013                      Mean          14jul2008
                        Largest       Std. Dev.      6740.761
75%    15dec2017      15jul2020
90%    15jul2019      15jul2020       Variance       4.54e+07
95%    15jan2020      15jul2020       Skewness      -4.360828
99%    15jun2020      15jul2020       Kurtosis       25.25233

                        dialysis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15jan1990      15dec1899
10%    15jan1998      15dec1899       Obs              21,812
25%    15jan2007      15dec1899       Sum of Wgt.      21,812

50%    15jun2014                      Mean          20aug2009
                        Largest       Std. Dev.       6352.31
75%    15apr2018      15jul2020
90%    15sep2019      15jul2020       Variance       4.04e+07
95%    15feb2020      15jul2020       Skewness      -4.722999
99%    15jun2020      15jul2020       Kurtosis       29.26278

                   kidney_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15dec1899
 5%    15aug1987      15dec1899
10%    15mar1994      15dec1899       Obs              15,182
25%    15jan2004      15jan1900       Sum of Wgt.      15,182

50%    15aug2011                      Mean          28nov2007
                        Largest       Std. Dev.      5530.491
75%    15jul2016      15jul2020
90%    15nov2018      15jul2020       Variance       3.06e+07
95%    15aug2019      15jul2020       Skewness       -4.46263
99%    15mar2020      15jul2020       Kurtosis       30.77468

                    other_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1963      15jan1900
 5%    15nov1992      15jan1900
10%    15jan1997      15jan1900       Obs               4,789
25%    15jan2004      15jan1900       Sum of Wgt.       4,789

50%    15sep2010                      Mean          25mar2008
                        Largest       Std. Dev.      4820.196
75%    15nov2015      15jul2020
90%    15aug2018      15jul2020       Variance       2.32e+07
95%    15jul2019      15jul2020       Skewness      -4.957988
99%    15apr2020      15jul2020       Kurtosis       39.49851

                      hypertension_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jun1986      15jan1800
10%    15jan1994      15jan1800       Obs           3,873,100
25%    15dec2001      15jan1800       Sum of Wgt.   3,873,100

50%    15feb2008                      Mean          18sep2004
                        Largest       Std. Dev.      7188.495
75%    15oct2014      15sep2037
90%    15mar2018      15jun2055       Variance       5.17e+07
95%    15apr2019      15nov2056       Skewness      -4.125737
99%    15feb2020      15feb2058       Kurtosis       22.14179

                    ra_sle_psoriasis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1800
 5%    15jan1972      15jan1800
10%    15dec1984      15jan1840       Obs             954,718
25%    15jan1998      15jan1840       Sum of Wgt.     954,718

50%    15aug2007                      Mean          14aug2002
                        Largest       Std. Dev.      7291.417
75%    15apr2014      15jul2020
90%    15dec2017      15jul2020       Variance       5.32e+07
95%    15feb2019      15mar2082       Skewness      -3.109514
99%    15feb2020      15mar3000       Kurtosis       22.87678

                           asthma
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          23,144,258
25%            0              0       Sum of Wgt.    23144258

50%            0                      Mean           .1601498
                        Largest       Std. Dev.      .4049642
75%            0              2
90%            1              2       Variance        .163996
95%            1              2       Skewness       2.495508
99%            2              2       Kurtosis       8.720889

                        diabetes_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jan1900      15jan1860
 5%    15may1995      15jan1860
10%    15jan2001      15jan1860       Obs           1,790,646
25%    15nov2006      15jan1860       Sum of Wgt.   1,790,646

50%    15may2013                      Mean          16feb2010
                        Largest       Std. Dev.      5247.861
75%    15jul2017      15feb2020
90%    15feb2019      15feb2020       Variance       2.75e+07
95%    15aug2019      15feb2020       Skewness      -5.500931
99%    15dec2019      15feb2020       Kurtosis       41.18894

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    02feb2020      01feb2020
 5%    10feb2020      01feb2020
10%    19feb2020      01feb2020       Obs             101,725
25%    18mar2020      01feb2020       Sum of Wgt.     101,725

50%    17apr2020                      Mean          19apr2020
                        Largest       Std. Dev.      43.15239
75%    21may2020      19jul2020
90%    22jun2020      19jul2020       Variance       1862.129
95%    03jul2020      20jul2020       Skewness       .1253678
99%    13jul2020      20jul2020       Kurtosis       2.151011

. 
. 
. /* CREATE VARIABLES===========================================================*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(11,564,384 missing values generated)

. replace male = 0 if sex == "F"
(11,564,007 real changes made)

. 
. * Ethnicity 
. replace ethnicity = .u if ethnicity == .
(6,499,208 real changes made, 6,499,208 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                                       ///
>                                                 3 "Asian or Asian British"      ///
>                                                 4 "Black"                                       ///
>                                                 5 "Other"                                       ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(23,144,226 missing values generated)

. replace stp = sum(stp)
(23,144,257 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(23,144,258 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(249,728 real changes made, 249,728 to missing)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 18272484 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age 18/29.9999 = 1 /// 
>                    30/39.9999 = 2 /// 
>            40/49.9999 = 3 ///
>                    50/59.9999 = 4 ///
>                60/69.9999 = 5 ///
>                    70/79.9999 = 6 ///
>                    80/max = 7, gen(agegroup) 
(18513234 differences between age and agegroup)

. 
. label define agegroup   1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Create binary age (for age stratification)
. recode age min/65.999999999 = 0 ///
>            66/max = 1, gen(age66)
(23005614 differences between age and age66)

. 
. * Check there are no missing ages
. assert age < .

. assert agegroup < .

. assert age66 < .

. 
. 
. /* APPLY HH level INCLUSION/EXCLUIONS==================================================*/ 
. 
. noi di "DROP if HH ID==0"
DROP if HH ID==0

. count if household_id==0
  2,810,561

. drop if household_id==0
(2,810,561 observations deleted)

. count
  20,333,697

. 
. *tab care_home_type household_size
. drop if care_home_type!="U"
(100,311 observations deleted)

. count
  20,233,386

. 
. noi di "DROP HH>=10 persons:"
DROP HH>=10 persons:

. sum household_size, d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs          20,233,386
25%            2              1       Sum of Wgt.    20233386

50%            3                      Mean           5.445895
                        Largest       Std. Dev.      53.38364
75%            4           3355
90%            6           3355       Variance       2849.813
95%            7           3355       Skewness       39.99781
99%           13           3355       Kurtosis       2099.407

. drop if household_size>=10
(376,312 observations deleted)

. count
  19,857,074

. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. recode male .=9
(male: 336 changes made)

. recode male .u=9
(male: 0 changes made)

. bysort household_id: egen male_drop=max(male)

. drop if male_drop==9
(946 observations deleted)

. count
  19,856,128

. 
. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. recode age .=9
(age: 0 changes made)

. recode age .u=9
(age: 0 changes made)

. bysort household_id: egen age_drop=max(age)

. drop if age_drop==9
(13,064 observations deleted)

. count
  19,843,064

. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. recode imd .=9
(imd: 0 changes made)

. recode imd .u=9
(imd: 234250 changes made)

. bysort household_id: egen imd_drop=max(imd)

. drop if imd_drop==9
(266,851 observations deleted)

. count
  19,576,213

. **************************** HOUSEHOLD VARS*******************************************
. 
. *No kids/kids under 12/up to 18
. *Identify kids under 12, or kids under 18
. gen nokids=1 if age<12
(16,867,501 missing values generated)

. recode nokids .=2 if age<18 
(nokids: 1318164 changes made)

. bysort household_id: egen min_kids=min(nokids) 
(11100226 missing values generated)

. gen kids_cat3=min_kids
(11,100,226 missing values generated)

. recode kids_cat3 .=0 
(kids_cat3: 11100226 changes made)

. lab define kids_cat3  0 "No kids" 1 "Kids under 12" 2 "Kids under 18"

. lab val kids_cat3 kids_cat3

. drop min_kids

. 
. *Dose-response exposure
. recode nokids 2=.
(nokids: 1318164 changes made)

. bysort household_id: egen number_kids=count(nokids)

. gen gp_number_kids=number_kids

. recode gp_number_kids 3/max=3
(gp_number_kids: 210960 changes made)

. recode gp_number_kids 1=2 2=3 3=4
(gp_number_kids: 6484147 changes made)

. replace gp_number_kids=0 if kids_cat3==0 
(0 real changes made)

. replace gp_number_kids=1 if kids_cat3==2 
(1,991,840 real changes made)

. 
. lab var gp_number_kids "Number kids under 12 years in hh"

. drop nokids

. lab define   gp_number_kids 0 none  1 "only >12 years" ///
> 2 "1 child <12" ///
> 3 "2 children <12" ///
> 4 "3+ children <12"

. lab val gp_number_kids gp_number_kids

. 
. tab kids_cat3 gp_number_kids, miss

              |            Number kids under 12 years in hh
    kids_cat3 |      none  only >12   1 child <  2 childre  3+ childr |     Total
--------------+-------------------------------------------------------+----------
      No kids |11,100,226          0          0          0          0 |11,100,226 
Kids under 12 |         0          0  3,156,210  2,414,428    913,509 | 6,484,147 
Kids under 18 |         0  1,991,840          0          0          0 | 1,991,840 
--------------+-------------------------------------------------------+----------
        Total |11,100,226  1,991,840  3,156,210  2,414,428    913,509 |19,576,213 

.  
. 
. /* DROP ALL KIDS, AS HH COMPOSITION VARS ARE NOW MADE */
. drop if age<18
(4,026,876 observations deleted)

. 
. *Total number adults in household (to check hh size)
. bysort household_id: gen tot_adults_hh=_N

. recode tot_adults_hh 3/max=3
(tot_adults_hh: 2151693 changes made)

. 
. 
. /* SET FU DATES===============================================================*/ 
. * Censoring dates for each outcome (largely, last date outcome data available)
. *****NEEDS UPDATING WHEN INFO AVAILABLE*******************
. global onscoviddeathcensor      = "16/07/2020"

. global tpp_infec_censor                 = "16/07/2020" /*NOT USING THIS DATE*/

. 
. *Start dates
. global indexdate                            = "01/02/2020"

. 
. 
. 
. 
. 
. 
. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. rename dereg_date_date                                          dereg_date

. 
. /* CREATE BINARY VARIABLES====================================================*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes_date  ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 dialysis                                        ///
>                                                 kidney_transplant                       ///
>                                                 other_transplant                        /// 
>                                                 asplenia                        /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia                         ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         
. }

. 
. 
. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(3,059,988 real changes made, 3,059,988 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(118,151 real changes made, 118,151 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(3,006,346 missing values generated)

. gen bmi_age = age - bmi_time
(3,006,346 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(41,837 real changes made, 41,837 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(213,630 real changes made, 213,630 to missing)

. replace bmi_measured = . if bmi == . 
(3,219,976 real changes made, 3,219,976 to missing)

. 
. gen     bmicat = .
(15,549,337 missing values generated)

. recode  bmicat . = 1 if bmi < 18.5
(bmicat: 281511 changes made)

. recode  bmicat . = 2 if bmi < 25
(bmicat: 4395349 changes made)

. recode  bmicat . = 3 if bmi < 30
(bmicat: 4241931 changes made)

. recode  bmicat . = 4 if bmi < 35
(bmicat: 2152108 changes made)

. recode  bmicat . = 5 if bmi < 40
(bmicat: 835734 changes made)

. recode  bmicat . = 6 if bmi < .
(bmicat: 422728 changes made)

. replace bmicat = .u if bmi >= .
(3,219,976 real changes made, 3,219,976 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Create less  granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(15267826 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(8,425,592 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(5,089,628 real changes made)

. replace smoke = 3  if smoking_status == "S"
(2,720,224 real changes made)

. replace smoke = .u if smoking_status == "M"
(615,740 real changes made, 615,740 to missing)

. replace smoke = .u if smoking_status == "" 
(0 real changes made)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(615740 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(cancer_haem_date, d(1/1/1900), d(1/2/2015))
(15,493,208 missing values generated)

. replace cancer_haem_cat = 3 if inrange(cancer_haem_date, d(1/2/2015), d(1/2/2019))
(24,776 real changes made)

. replace cancer_haem_cat = 2 if inrange(cancer_haem_date, d(1/2/2019), d(1/2/2020))
(7,963 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 15460469 changes made)

. label values cancer_haem_cat cancer

. 
. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(cancer_nonhaem_date,  d(1/1/1900), d(1/2/2015)) 
(15,072,973 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(cancer_nonhaem_date,  d(1/2/2015), d(1/2/2019))
(205,722 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(cancer_nonhaem_date,  d(1/2/2019), d(1/2/2020)) 
(69,980 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 14797271 changes made)

. label values cancer_exhaem_cat cancer

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(15,507,558 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), date("$indexdate", "DMY"))

. 
. egen other_immuno = rowmax(temp1 temp2)

. drop temp1 temp2 

. order other_immuno, after(temp_immunodef)

. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(10,497,261 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(2,688,025 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(7,115,627 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(3,299,620 real changes made)

. replace bpcat = .u if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(1,564,129 real changes made, 1,564,129 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" .u "Unknown"

. label values bpcat bpcat

. 
. recode bpcat .u=1, gen(bpcat_nomiss)
(1564129 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 1939436 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(3,997,004 real changes made, 3,997,004 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(3,997,004 missing values generated)

. 
. gen min=.
(15,549,337 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(6,305,522 real changes made)

. replace min = SCr_adj/0.9 if male==1
(5,246,811 real changes made)

. replace min = min^-0.329  if male==0
(6,305,522 real changes made)

. replace min = min^-0.411  if male==1
(5,246,811 real changes made)

. replace min = 1 if min<1
(7,598,164 real changes made)

. 
. gen max=.
(15,549,337 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(6,305,522 real changes made)

. replace max=SCr_adj/0.9 if male==1
(5,246,811 real changes made)

. replace max=max^-1.209
(11,552,333 real changes made)

. replace max=1 if max>1
(7,951,173 real changes made)

. 
. gen egfr=min*max*141
(3,997,004 missing values generated)

. replace egfr=egfr*(0.993^age)
(11,552,333 real changes made)

. replace egfr=egfr*1.018 if male==0
(6,305,522 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(3997004 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(11552333 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. *label var ckd "CKD stage calc without eth"
. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
.         
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(10900167 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(3,997,004 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. lab var  reduced "Reduced kidney function"

. 
. 
. /*ESDR: dialysis or kidney transplant*/
. gen esrd=1 if dialysis==1 | kidney_transplant==1
(15,526,533 missing values generated)

. recode esrd .=0
(esrd: 15526533 changes made)

. 
. 
. 
. ***************************
. /* DM / Hb1AC */
. ***************************
. 
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(13,435,519 real changes made, 13,435,519 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(7,292,154 real changes made, 7,292,154 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |  2,113,818    15.77952     13161.9        .01   1.91e+07
hba1c_mmol~l |  8,257,183    42.17866     3041.81         .4    8688000

. gen     hba1c_pct = hba1c_percentage 
(13,435,519 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(8,257,181 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(625 real changes made, 625 to missing)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(8,257,254 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(15,468,353 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(1,099,675 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(343,162 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(14,025,516 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |14,025,516          0          0          0 |14,025,516 
         1 |         0     80,984          0          0 |    80,984 
         2 |         0          0  1,099,675          0 | 1,099,675 
         3 |         0          0          0    343,162 |   343,162 
-----------+--------------------------------------------+----------
     Total |14,025,516     80,984  1,099,675    343,162 |15,549,337 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(15,478,341 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(1,097,075 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(14,381,266 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(8,229,844 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(528,227 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(139,889 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(153,130 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(176,263 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |  7,319,493       88.01       88.01
  >=6.5-7.4 |    528,227        6.35       94.36
  >=7.5-7.9 |    139,889        1.68       96.04
    >=8-8.9 |    153,130        1.84       97.88
        >=9 |    176,263        2.12      100.00
------------+-----------------------------------
      Total |  8,317,002      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(7,701,617 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(469,282 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  7,847,720       50.47       50.47
          1 |    469,282        3.02       53.49
          . |  7,232,335       46.51      100.00
------------+-----------------------------------
      Total | 15,549,337      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(1,523,821 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(20,970 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(58,577 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(688,953 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(404,164 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(7,995 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"            ///
>                                                 3 "T1DM, uncontrolled"          ///
>                                                 4 "T2DM, controlled"            ///
>                                                 5 "T2DM, uncontrolled"          ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 14,025,516       90.20       90.20
  T1DM, controlled |     20,970        0.13       90.33
T1DM, uncontrolled |     58,577        0.38       90.71
  T2DM, controlled |    688,953        4.43       95.14
T2DM, uncontrolled |    404,164        2.60       97.74
Diabetes, no HbA1c |      7,995        0.05       97.79
                 . |    343,162        2.21      100.00
-------------------+-----------------------------------
             Total | 15,549,337      100.00

. 
. 
. 
. 
. /*  Asthma  */
. 
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3
(asthmacat: 15549337 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. /*  Probable shielding  */
. gen shield=1 if esrd==1 | other_transplant==1 | asthmacat==2 | asthmacat==3 | ///
> chronic_respiratory_disease==1 | cancer_haem==1 | cancer_nonhaem==1 | ///
> asplenia==1 | other_immuno==1
(11,868,655 missing values generated)

. recode shield .=0
(shield: 11868655 changes made)

. 
. 
. /* OUTCOME AND SURVIVAL TIME==================================================*/
. 
. /*  Cohort entry and censor dates  */
. * Date of cohort entry, 1 Mar 2020
. gen enter_date = date("$indexdate", "DMY")

. 
. * Date of study end (typically: last date of outcome data available)
. **** NOTE!! NEEDS UPDATING!!!!
. gen onscoviddeathcensor_date        = date("$onscoviddeathcensor",      "DMY")

. gen tpp_infec_censor_date           = date("$tpp_infec_censor",         "DMY")

.         
. * Format the dates
. format  enter_date                                      ///
>                 onscoviddeathcensor_date   %td

.                         
.                 
.                         /****   Outcome definitions   ****/
. 
. * Date of Covid death in ONS
. gen died_date_onscovid = died_date_ons if died_ons_covid_flag_any == 1
(15,540,145 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen died_date_onsnoncovid = died_date_ons if died_ons_covid_flag_any != 1 
(15,493,256 missing values generated)

. 
. *Date probable covid in TPP
. rename covid_tpp_probable date_covid_tpp_prob

. 
. format died_date_ons %td

. format died_date_onscovid %td 

. format died_date_onsnoncovid %td

. 
. * Binary indicators for outcomes
. gen covid_tpp_prob = (date_covid_tpp_prob < .)

. gen non_covid_death = (died_date_onsnoncovid < .)

. gen covid_death = (died_date_onscovid < .)

. 
. 
. 
.                                         /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: end study, death, or that outcome)
. *gen stime_onscoviddeath = min(onscoviddeathcensor_date,                                died_date_ons)
. gen stime_covid_tpp_prob = min(onscoviddeathcensor_date,        died_date_ons, date_covid_tpp_prob, dereg_date)

. gen stime_non_covid_death = min(onscoviddeathcensor_date,       died_date_ons, died_date_onsnoncovid)

. gen stime_covid_death = min(onscoviddeathcensor_date, died_date_ons, died_date_onscovid)

. 
. 
. * If outcome was after censoring occurred, set to zero
. replace covid_tpp_prob = 0 if (date_covid_tpp_prob > onscoviddeathcensor_date)
(0 real changes made)

. replace non_covid_death = 0 if (died_date_onsnoncovid > onscoviddeathcensor_date)
(77 real changes made)

. replace covid_death = 0 if (died_date_onscovid > onscoviddeathcensor_date)
(3 real changes made)

. 
. 
. * Format date variables
. format  stime* %td 

. 
. 
. /* LABEL VARIABLES============================================================*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var kids_cat3 "Presence of children or young people in the household"

. label var  number_kids "Number of children aged 1-<12 years in household"

. label var  household_size "Number people in household"

. label var  household_id "Household ID"

. 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age66                                         "66 years and older"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI, kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date measured"

. label var obese4cat                                     "Evidence of obesity (4 categories)"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set to non)"

. label var imd                                           "Index of Multiple Deprivation (IMD)"

. label var ethnicity                                     "Ethnicity"

. label var stp                                           "Sustainability and Transformation Partnership"

. lab var care_home_type                          "Care home type"

. lab var tot_adults_hh                           "Total number adults in hh"

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma category"

. label var egfr_cat                                              "Calculated eGFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haematological cancer"

. label var cancer_exhaem_cat                                             "Non-haematological cancer"

. label var kidney_transplant                                             "Kidney transplant"     

. label var other_transplant                                              "Other solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (combination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"                  

. label var stroke_dementia                           "Stroke or dementia"                                                        

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosuppression"

. lab var temp_immunodef                                  "Temporary immunosuppression"

. lab var esrd                                                    "End-stage renal disease"

. 
. 
. label var hypertension_date                                     "Diagnosed hypertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases Date"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Date"

. label var cancer_haem_date                                      "Haem cancer Date"

. label var cancer_nonhaem_date                           "Non-haem cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date              "Neurological disease  Date"

. label var stroke_dementia_date                      "Stroke or dementia date"                                                   

. label var ra_sle_psoriasis_date                         "Autoimmune disease  Date"

. lab var perm_immunodef_date                             "Permanent immunosuppression date"

. lab var temp_immunodef_date                             "Temporary immunosuppression date"

. label var kidney_transplant_date                                                "Kidney transplant"     

. label var other_transplant_date                                         "Other solid organ transplant"

. label var asplenia_date                                                 "Asplenia date"

. lab var  bphigh "non-missing indicator of known high blood pressure"

. lab var bpcat "Blood pressure four levels, non-missing"

. lab var htdiag_or_highbp "High blood pressure or hypertension diagnosis"

. lab var shield "Probable shielding"

. 
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. label var onscoviddeathcensor_date              "Date of admin censoring for ONS deaths"

. label var tpp_infec_censor_date                 "Date of admin censoring for covid TPP cases"

. 
. label var  covid_tpp_prob                               "Failure/censoring indicator for outcome: covid prob case"

. label var  non_covid_death                              "Failure/censoring indicator for outcome: non-covid death"

. label var  covid_death                              "Failure/censoring indicator for outcome: covid death"

. 
. label var date_covid_tpp_prob                   "Date of covid TPP case (probable)"

. label var died_date_onsnoncovid                 "Date of ONS non-COVID Death"

. label var  died_date_onscovid                   "Date of ONS COVID Death"

. 
. * Survival times
. label var  stime_covid_tpp_prob                                 "Survival tme (date); outcome "

. label var  stime_non_covid_death                                "Survival tme (date); outcome non_covid_death   "

. label var  stime_covid_death                            "Survival time (date); outcome covid death"

. 
. *Key DATES
. label var   died_date_ons                               "Date death ONS"

. label var  has_12_m_follow_up                   "Has 12 months follow-up"

. lab var  dereg_date                                             "Date deregistration from practice"

.  
. 
. 
. 
. 
. /* TIDY DATA==================================================================*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
died_ons_c~y  bp_sys_dat~e  creatinine    diabetes_t~e  hba1c_per~ge  esrf          male_drop     SCr_adj       dm_type_ex~s
died_ons_c~g  bp_sys_dat~d  crea~te_date  diabetes_e~s  hba1c_per~te  dialysis_d~e  age_drop      min           hba1ccat
ethnicity_~e  bp_dias       crea~ne_date  diabetes_e~r  cancer_haem   dialysis      imd_drop      max           hba1c75
bmi_measured  bp_dias_da~e  smoki~e_date  hba1c_mmol~l  cancer_non~m  asthmacat     bmi_time      hba1c_pct
bp_sys        bp_dias_da~d  smoki~s_date  hba1c_mmol~e  esrf_date     diabetes      bmi_age       dm_type

. drop `r(varlist)'

.         
. 
.         
. 
. /* APPLY INCLUSION/EXCLUIONS==================================================*/ 
. 
. *************TEMP DROP TO INVESTIGATE ASSOCIATIONS MORE EASILY******************
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(11 observations deleted)

. count
  15,549,326

. 
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if died_date_ons <= date("$indexdate", "DMY")
(331 observations deleted)

. count
  15,548,995

. 
. noi di "DROP IF COVID IN TPP BEFORE INDEX"
DROP IF COVID IN TPP BEFORE INDEX

. drop if date_covid_tpp_prob <= date("$indexdate", "DMY")
(254 observations deleted)

. count
  15,548,741

.         
.         
. ***************
. *  Save data  *
. ***************
. sort patient_id

. save $tempdir\analysis_dataset, replace
file tempdata\analysis_dataset.dta saved

. 
. 
. 
. use  $tempdir\analysis_dataset, clear

. keep if age<=65
(3,469,712 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir\analysis_dataset_ageband_0, replace
(note: file tempdata\analysis_dataset_ageband_0.dta not found)
file tempdata\analysis_dataset_ageband_0.dta saved

. 
. 
. use  $tempdir\analysis_dataset, clear

. keep if age>65
(12,079,029 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir\analysis_dataset_ageband_1, replace
(note: file tempdata\analysis_dataset_ageband_1.dta not found)
file tempdata\analysis_dataset_ageband_1.dta saved

. 
. 
. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_ageband_`x', clear
  3. * Save a version set on NON ONS covid death outcome
. stset stime_non_covid_death, fail(non_covid_death)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  4. /*WEIGHTING - TO REDUCE TIME 
> set seed 30459820
> keep if _d==1|uniform()<.03
> gen pw = 1
> replace pw = (1/0.03) if _d==0
> stset stime_non_covid_death [pweight = pw],  fail(non_covid_death)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)*/
. save "$tempdir\cr_create_analysis_dataset_STSET_non_covid_death_ageband_`x'.dta", replace
  5.         
. 
. use $tempdir\analysis_dataset_ageband_`x', clear
  6. * Save a version set on covid death  outcome
. stset stime_covid_death, fail(covid_death)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7. /*WEIGHTING - TO REDUCE TIME 
> set seed 30459820
> keep if _d==1|uniform()<.03
> gen pw = 1
> replace pw = (1/0.03) if _d==0
> stset stime_covid_death [pweight = pw],  fail(covid_death)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)*/
. save "$tempdir\cr_create_analysis_dataset_STSET_covid_death_ageband_`x'.dta", replace
  8. 
. 
. use $tempdir\analysis_dataset_ageband_`x', clear
  9. * Save a version set on probable covid
. stset stime_covid_tpp_prob, fail(covid_tpp_prob)                                ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 10. /*WEIGHTING - TO REDUCE TIME 
> set seed 30459820
> keep if _d==1|uniform()<.03
> gen pw = 1
> replace pw = (1/0.03) if _d==0
> stset stime_covid_tpp_prob [pweight = pw],  fail(covid_tpp_prob)                                ///
>         id(patient_id) enter(enter_date) origin(enter_date)*/
. save "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'.dta", replace        
 11. 
. 
. }

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   12079029  total observations
          0  exclusions
------------------------------------------------------------------------------
   12079029  observations remaining, representing
   12079029  subjects
      9,386  failures in single-failure-per-subject data
 2.0042e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       166
(note: file tempdata\cr_create_analysis_dataset_STSET_non_covid_death_ageband_0.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_non_covid_death_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   12079029  total observations
          0  exclusions
------------------------------------------------------------------------------
   12079029  observations remaining, representing
   12079029  subjects
      1,423  failures in single-failure-per-subject data
 2.0042e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       166
(note: file tempdata\cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   12079029  total observations
          0  exclusions
------------------------------------------------------------------------------
   12079029  observations remaining, representing
   12079029  subjects
     33,607  failures in single-failure-per-subject data
 1.9906e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       166
(note: file tempdata\cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.dta saved

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
  3,469,712  total observations
          0  exclusions
------------------------------------------------------------------------------
  3,469,712  observations remaining, representing
  3,469,712  subjects
     46,278  failures in single-failure-per-subject data
  571272446  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       166
(note: file tempdata\cr_create_analysis_dataset_STSET_non_covid_death_ageband_1.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_non_covid_death_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
  3,469,712  total observations
          0  exclusions
------------------------------------------------------------------------------
  3,469,712  observations remaining, representing
  3,469,712  subjects
      7,756  failures in single-failure-per-subject data
  571272446  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       166
(note: file tempdata\cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
  3,469,712  total observations
          0  exclusions
------------------------------------------------------------------------------
  3,469,712  observations remaining, representing
  3,469,712  subjects
     14,105  failures in single-failure-per-subject data
  569017088  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       166
(note: file tempdata\cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.dta not found)
file tempdata\cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\01_cr_analysis_dataset.log
  log type:  text
 closed on:   6 Aug 2020, 21:38:47
----------------------------------------------------------------------------------------------------------------------------------
