-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\03a_an_desc
> riptive_tables.log
  log type:  text
 opened on:   7 Aug 2020, 01:00:35

. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_ageband_`x', clear
  3. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. safetab htdiag_or_highbp, m
 16. safetab imd 
 17. safetab imd, m
 18. safetab ethnicity
 19. safetab ethnicity, m
 20. safetab stp
 21. safetab tot_adults_hh
 22. safetab household_size
 23. 
. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat   ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 24.                                                 
. safetab `var'
 25. }
 26. safetab shield
 27. 
. 
. *Exposure 
. foreach var in kids_cat3 gp_number_kids {
 28. safetab `var'
 29. }
 30. 
. * Outcomes
. foreach var in covid_death non_covid_death  ///
>  covid_tpp_prob {
 31. safetab `var'
 32. }
 33. 
. 
. * Outcomes by exposure
. foreach var in covid_death non_covid_death  ///
>  covid_tpp_prob {
 34. safetab `var'
 35. safetab `var' kids_cat3, col row
 36. safetab `var' gp_number_kids, col row
 37. 
. }
 38. 
. **********************************
. *  Number (%) with each exposure  *
. **********************************
. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    kids_cat3, col
 39.         safetab male                                                      
>       kids_cat3, col
 40.         safetab bmicat                                                    
>       kids_cat3, col m 
 41.         safetab smoke                                                     
>       kids_cat3, col m
 42.         safetab obese4cat                                                 
>       kids_cat3, col m 
 43.         safetab shield                                                    
>       kids_cat3, col m 
 44.         safetab tot_adults_hh                                           ki
> ds_cat3, col m 
 45.         safetab household_size                                          ki
> ds_cat3, col m 
 46.         safetab imd                                                       
>       kids_cat3, col m
 47.         safetab ethnicity                                                 
>       kids_cat3, col m
 48.         safetab stp                                                       
>       kids_cat3, col
 49.         
.         
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 50.         safetab `var'           kids_cat3, col
 51. }
 52.         
. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 12,079,029    41.45328    13.39531         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  2,853,819       23.63       23.63
     30-<40 |  2,775,687       22.98       46.61
     40-<50 |  2,500,494       20.70       67.31
     50-<60 |  2,627,784       21.75       89.06
     60-<70 |  1,321,245       10.94      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,079,029      100.00      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  6,021,568       49.85       49.85
          1 |  6,057,461       50.15      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    223,915        2.44        2.44
  Normal (18.5-24.9) |  3,413,982       37.23       39.67
Overweight (25-29.9) |  3,007,574       32.80       72.47
   Obese I (30-34.9) |  1,544,134       16.84       89.30
  Obese II (35-39.9) |    635,735        6.93       96.24
     Obese III (40+) |    345,174        3.76      100.00
---------------------+-----------------------------------
               Total |  9,170,514      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    223,915        1.85        1.85
  Normal (18.5-24.9) |  3,413,982       28.26       30.12
Overweight (25-29.9) |  3,007,574       24.90       55.02
   Obese I (30-34.9) |  1,544,134       12.78       67.80
  Obese II (35-39.9) |    635,735        5.26       73.06
     Obese III (40+) |    345,174        2.86       75.92
        Unknown (.u) |  2,908,515       24.08      100.00
---------------------+-----------------------------------
               Total | 12,079,029      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  9,553,986       79.10       79.10
   Obese I (30-34.9) |  1,544,134       12.78       91.88
  Obese II (35-39.9) |    635,735        5.26       97.14
     Obese III (40+) |    345,174        2.86      100.00
---------------------+-----------------------------------
               Total | 12,079,029      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,740,043       49.98       49.98
      Former |  3,311,170       28.83       78.81
     Current |  2,433,250       21.19      100.00
-------------+-----------------------------------
       Total | 11,484,463      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,740,043       47.52       47.52
      Former |  3,311,170       27.41       74.93
     Current |  2,433,250       20.14       95.08
Unknown (.u) |    594,566        4.92      100.00
-------------+-----------------------------------
       Total | 12,079,029      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,099,614       29.40       29.40
      Elevated |  1,705,332       16.17       45.57
 High, stage I |  3,695,985       35.05       80.63
High, stage II |  2,042,780       19.37      100.00
---------------+-----------------------------------
         Total | 10,543,711      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,099,614       25.66       25.66
      Elevated |  1,705,332       14.12       39.78
 High, stage I |  3,695,985       30.60       70.38
High, stage II |  2,042,780       16.91       87.29
       Unknown |  1,535,318       12.71      100.00
---------------+-----------------------------------
         Total | 12,079,029      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,258,663       76.65       76.65
          1 |  2,820,366       23.35      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,258,663       76.65       76.65
          1 |  2,820,366       23.35      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,304,876       19.08       19.08
               2 |  2,412,311       19.97       39.05
               3 |  2,481,016       20.54       59.59
               4 |  2,562,911       21.22       80.81
 5 most deprived |  2,317,915       19.19      100.00
-----------------+-----------------------------------
           Total | 12,079,029      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,304,876       19.08       19.08
               2 |  2,412,311       19.97       39.05
               3 |  2,481,016       20.54       59.59
               4 |  2,562,911       21.22       80.81
 5 most deprived |  2,317,915       19.19      100.00
-----------------+-----------------------------------
           Total | 12,079,029      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,585,860       82.68       82.68
                 Mixed |    158,292        1.73       84.41
Asian or Asian British |    833,857        9.09       93.50
                 Black |    306,235        3.34       96.83
                 Other |    290,440        3.17      100.00
-----------------------+-----------------------------------
                 Total |  9,174,684      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,585,860       62.80       62.80
                 Mixed |    158,292        1.31       64.11
Asian or Asian British |    833,857        6.90       71.02
                 Black |    306,235        2.54       73.55
                 Other |    290,440        2.40       75.96
               Unknown |  2,904,345       24.04      100.00
-----------------------+-----------------------------------
                 Total | 12,079,029      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,312        0.03        0.03
          2 |  1,154,496        9.56        9.59
          3 |    524,200        4.34       13.93
          4 |    120,601        1.00       14.92
          5 |     84,922        0.70       15.63
          6 |    569,139        4.71       20.34
          7 |     34,344        0.28       20.62
          8 |    442,294        3.66       24.28
          9 |    341,800        2.83       27.11
         10 |    482,982        4.00       31.11
         11 |    540,761        4.48       35.59
         12 |    184,350        1.53       37.12
         13 |    269,055        2.23       39.34
         14 |    335,870        2.78       42.12
         15 |    430,763        3.57       45.69
         16 |    426,272        3.53       49.22
         17 |    369,004        3.05       52.27
         18 |    538,514        4.46       56.73
         19 |    417,031        3.45       60.18
         20 |    599,100        4.96       65.14
         21 |    971,123        8.04       73.18
         22 |     62,576        0.52       73.70
         23 |    458,332        3.79       77.50
         24 |     21,953        0.18       77.68
         25 |    109,600        0.91       78.59
         26 |    370,667        3.07       81.65
         27 |    462,391        3.83       85.48
         28 |    373,242        3.09       88.57
         29 |    314,052        2.60       91.17
         30 |    224,629        1.86       93.03
         31 |     14,251        0.12       93.15
         32 |    827,403        6.85      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  2,871,358       23.77       23.77
          2 |  4,829,125       39.98       63.75
          3 |  4,378,546       36.25      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

     Number |
  people in |
  household |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  2,181,024       18.06       18.06
          2 |  2,882,217       23.86       41.92
          3 |  2,624,901       21.73       63.65
          4 |  2,342,594       19.39       83.04
          5 |  1,062,436        8.80       91.84
          6 |    501,210        4.15       95.99
          7 |    256,828        2.13       98.11
          8 |    143,002        1.18       99.30
          9 |     84,817        0.70      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,850,337       98.11       98.11
          1 |    228,692        1.89      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,031,908       83.05       83.05
          1 |  2,047,121       16.95      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,745,117       97.24       97.24
          1 |    333,912        2.76      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 11,331,840       95.26       95.26
  T1DM, controlled |     16,441        0.14       95.40
T1DM, uncontrolled |     49,260        0.41       95.82
  T2DM, controlled |    275,000        2.31       98.13
T2DM, uncontrolled |    217,068        1.82       99.95
Diabetes, no HbA1c |      5,510        0.05      100.00
-------------------+-----------------------------------
             Total | 11,895,119      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,821,999       97.87       97.87
    Last year |     28,589        0.24       98.11
2-5 years ago |     82,363        0.68       98.79
     5+ years |    146,078        1.21      100.00
--------------+-----------------------------------
        Total | 12,079,029      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 12,041,205       99.69       99.69
    Last year |      3,060        0.03       99.71
2-5 years ago |      9,515        0.08       99.79
     5+ years |     25,249        0.21      100.00
--------------+-----------------------------------
        Total | 12,079,029      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,039,819       99.68       99.68
          1 |     39,210        0.32      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,076,204       99.98       99.98
          1 |      2,825        0.02      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,065,162       99.89       99.89
          1 |     13,867        0.11      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,016,126       99.48       99.48
          1 |     62,903        0.52      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,996,790       99.32       99.32
          1 |     82,239        0.68      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,987,813       99.24       99.24
          1 |     91,216        0.76      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,979        0.06        0.06
         15 |      6,926        0.08        0.14
         30 |     16,734        0.20        0.35
         45 |    105,047        1.27        1.62
         60 |  8,138,182       98.38      100.00
------------+-----------------------------------
      Total |  8,271,868      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 11,945,343       98.89       98.89
Stage 3a/3b egfr 30-60       |    121,781        1.01       99.90
           Stage 4/5 egfr<30 |     11,905        0.10      100.00
-----------------------------+-----------------------------------
                       Total | 12,079,029      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,064,753       99.88       99.88
          1 |     14,276        0.12      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,741,746       88.93       88.93
          1 |  1,337,283       11.07      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,552,716       95.64       95.64
          1 |    526,313        4.36      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,590,045       79.39       79.39
          1 |  2,488,984       20.61      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

  Presence of |
  children or |
 young people |
       in the |
    household |      Freq.     Percent        Cum.
--------------+-----------------------------------
      No kids |  7,740,096       64.08       64.08
Kids under 12 |  3,164,072       26.19       90.27
Kids under 18 |  1,174,861        9.73      100.00
--------------+-----------------------------------
        Total | 12,079,029      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
           none |  7,740,096       64.08       64.08
 only >12 years |  1,174,861        9.73       73.81
    1 child <12 |  1,741,580       14.42       88.22
 2 children <12 |  1,094,886        9.06       97.29
3+ children <12 |    327,606        2.71      100.00
----------------+-----------------------------------
          Total | 12,079,029      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,077,606       99.99       99.99
          1 |      1,423        0.01      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,069,643       99.92       99.92
          1 |      9,386        0.08      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,045,422       99.72       99.72
          1 |     33,607        0.28      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,077,606       99.99       99.99
          1 |      1,423        0.01      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
     covid |     people in the household
     death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,738,935  3,163,919  1,174,752 |12,077,606 
           |     64.08      26.20       9.73 |    100.00 
           |     99.99     100.00      99.99 |     99.99 
-----------+---------------------------------+----------
         1 |     1,161        153        109 |     1,423 
           |     81.59      10.75       7.66 |    100.00 
           |      0.01       0.00       0.01 |      0.01 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |     64.08      26.19       9.73 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
     covid |            Number kids under 12 years in hh
     death |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 7,738,935  1,174,752  1,741,484  1,094,841    327,594 |12,077,606 
           |     64.08       9.73      14.42       9.07       2.71 |    100.00 
           |     99.99      99.99      99.99     100.00     100.00 |     99.99 
-----------+-------------------------------------------------------+----------
         1 |     1,161        109         96         45         12 |     1,423 
           |     81.59       7.66       6.75       3.16       0.84 |    100.00 
           |      0.01       0.01       0.01       0.00       0.00 |      0.01 
-----------+-------------------------------------------------------+----------
     Total | 7,740,096  1,174,861  1,741,580  1,094,886    327,606 |12,079,029 
           |     64.08       9.73      14.42       9.06       2.71 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,069,643       99.92       99.92
          1 |      9,386        0.08      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
 non-covid |     people in the household
     death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,732,002  3,163,295  1,174,346 |12,069,643 
           |     64.06      26.21       9.73 |    100.00 
           |     99.90      99.98      99.96 |     99.92 
-----------+---------------------------------+----------
         1 |     8,094        777        515 |     9,386 
           |     86.23       8.28       5.49 |    100.00 
           |      0.10       0.02       0.04 |      0.08 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |     64.08      26.19       9.73 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |            Number kids under 12 years in hh
     death |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 7,732,002  1,174,346  1,741,083  1,094,669    327,543 |12,069,643 
           |     64.06       9.73      14.43       9.07       2.71 |    100.00 
           |     99.90      99.96      99.97      99.98      99.98 |     99.92 
-----------+-------------------------------------------------------+----------
         1 |     8,094        515        497        217         63 |     9,386 
           |     86.23       5.49       5.30       2.31       0.67 |    100.00 
           |      0.10       0.04       0.03       0.02       0.02 |      0.08 
-----------+-------------------------------------------------------+----------
     Total | 7,740,096  1,174,861  1,741,580  1,094,886    327,606 |12,079,029 
           |     64.08       9.73      14.42       9.06       2.71 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,045,422       99.72       99.72
          1 |     33,607        0.28      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
covid prob |     people in the household
      case |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,719,788  3,154,547  1,171,087 |12,045,422 
           |     64.09      26.19       9.72 |    100.00 
           |     99.74      99.70      99.68 |     99.72 
-----------+---------------------------------+----------
         1 |    20,308      9,525      3,774 |    33,607 
           |     60.43      28.34      11.23 |    100.00 
           |      0.26       0.30       0.32 |      0.28 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |     64.08      26.19       9.73 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |            Number kids under 12 years in hh
      case |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 7,719,788  1,171,087  1,736,317  1,091,674    326,556 |12,045,422 
           |     64.09       9.72      14.41       9.06       2.71 |    100.00 
           |     99.74      99.68      99.70      99.71      99.68 |     99.72 
-----------+-------------------------------------------------------+----------
         1 |    20,308      3,774      5,263      3,212      1,050 |    33,607 
           |     60.43      11.23      15.66       9.56       3.12 |    100.00 
           |      0.26       0.32       0.30       0.29       0.32 |      0.28 
-----------+-------------------------------------------------------+----------
     Total | 7,740,096  1,174,861  1,741,580  1,094,886    327,606 |12,079,029 
           |     64.08       9.73      14.42       9.06       2.71 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
   Grouped |     people in the household
       age |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
    18-<30 | 1,971,131    605,929    276,759 | 2,853,819 
           |     25.47      19.15      23.56 |     23.63 
-----------+---------------------------------+----------
    30-<40 | 1,322,870  1,336,801    116,016 | 2,775,687 
           |     17.09      42.25       9.87 |     22.98 
-----------+---------------------------------+----------
    40-<50 | 1,138,656    928,545    433,293 | 2,500,494 
           |     14.71      29.35      36.88 |     20.70 
-----------+---------------------------------+----------
    50-<60 | 2,079,577    231,434    316,773 | 2,627,784 
           |     26.87       7.31      26.96 |     21.75 
-----------+---------------------------------+----------
    60-<70 | 1,227,862     61,363     32,020 | 1,321,245 
           |     15.86       1.94       2.73 |     10.94 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
      Male |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,612,072  1,782,821    626,675 | 6,021,568 
           |     46.67      56.35      53.34 |     49.85 
-----------+---------------------------------+----------
         1 | 4,128,024  1,381,251    548,186 | 6,057,461 
           |     53.33      43.65      46.66 |     50.15 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
                     |     people in the household
         Grouped BMI |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |   150,781     55,183     17,951 |   223,915 
                     |      1.95       1.74       1.53 |      1.85 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) | 2,173,272    949,861    290,849 | 3,413,982 
                     |     28.08      30.02      24.76 |     28.26 
---------------------+---------------------------------+----------
Overweight (25-29.9) | 1,889,044    831,695    286,835 | 3,007,574 
                     |     24.41      26.29      24.41 |     24.90 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   985,755    406,052    152,327 | 1,544,134 
                     |     12.74      12.83      12.97 |     12.78 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   408,637    164,745     62,353 |   635,735 
                     |      5.28       5.21       5.31 |      5.26 
---------------------+---------------------------------+----------
     Obese III (40+) |   225,106     86,409     33,659 |   345,174 
                     |      2.91       2.73       2.86 |      2.86 
---------------------+---------------------------------+----------
        Unknown (.u) | 1,907,501    670,127    330,887 | 2,908,515 
                     |     24.64      21.18      28.16 |     24.08 
---------------------+---------------------------------+----------
               Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
                     |    100.00     100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |  Presence of children or young
     Smoking |     people in the household
      status |   No kids  Kids unde  Kids unde |     Total
-------------+---------------------------------+----------
       Never | 3,685,231  1,491,957    562,855 | 5,740,043 
             |     47.61      47.15      47.91 |     47.52 
-------------+---------------------------------+----------
      Former | 2,077,945    914,024    319,201 | 3,311,170 
             |     26.85      28.89      27.17 |     27.41 
-------------+---------------------------------+----------
     Current | 1,600,495    632,469    200,286 | 2,433,250 
             |     20.68      19.99      17.05 |     20.14 
-------------+---------------------------------+----------
Unknown (.u) |   376,425    125,622     92,519 |   594,566 
             |      4.86       3.97       7.87 |      4.92 
-------------+---------------------------------+----------
       Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
             |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
 Evidence of obesity |     people in the household
      (4 categories) |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
No record of obesity | 6,120,598  2,506,866    926,522 | 9,553,986 
                     |     79.08      79.23      78.86 |     79.10 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   985,755    406,052    152,327 | 1,544,134 
                     |     12.74      12.83      12.97 |     12.78 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   408,637    164,745     62,353 |   635,735 
                     |      5.28       5.21       5.31 |      5.26 
---------------------+---------------------------------+----------
     Obese III (40+) |   225,106     86,409     33,659 |   345,174 
                     |      2.91       2.73       2.86 |      2.86 
---------------------+---------------------------------+----------
               Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
                     |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
  Probable |     people in the household
 shielding |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 6,101,752  2,549,821    938,472 | 9,590,045 
           |     78.83      80.59      79.88 |     79.39 
-----------+---------------------------------+----------
         1 | 1,638,344    614,251    236,389 | 2,488,984 
           |     21.17      19.41      20.12 |     20.61 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Total |
    number |  Presence of children or young
 adults in |     people in the household
        hh |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 2,273,107    467,675    130,576 | 2,871,358 
           |     29.37      14.78      11.11 |     23.77 
-----------+---------------------------------+----------
         2 | 2,640,534  1,726,608    461,983 | 4,829,125 
           |     34.12      54.57      39.32 |     39.98 
-----------+---------------------------------+----------
         3 | 2,826,455    969,789    582,302 | 4,378,546 
           |     36.52      30.65      49.56 |     36.25 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Number |  Presence of children or young
 people in |     people in the household
 household |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 2,181,024          0          0 | 2,181,024 
           |     28.18       0.00       0.00 |     18.06 
-----------+---------------------------------+----------
         2 | 2,595,041    196,370     90,806 | 2,882,217 
           |     33.53       6.21       7.73 |     23.86 
-----------+---------------------------------+----------
         3 | 1,595,806    713,419    315,676 | 2,624,901 
           |     20.62      22.55      26.87 |     21.73 
-----------+---------------------------------+----------
         4 |   864,497  1,040,749    437,348 | 2,342,594 
           |     11.17      32.89      37.23 |     19.39 
-----------+---------------------------------+----------
         5 |   294,996    572,305    195,135 | 1,062,436 
           |      3.81      18.09      16.61 |      8.80 
-----------+---------------------------------+----------
         6 |   112,583    309,901     78,726 |   501,210 
           |      1.45       9.79       6.70 |      4.15 
-----------+---------------------------------+----------
         7 |    51,237    171,680     33,911 |   256,828 
           |      0.66       5.43       2.89 |      2.13 
-----------+---------------------------------+----------
         8 |    28,217     99,298     15,487 |   143,002 
           |      0.36       3.14       1.32 |      1.18 
-----------+---------------------------------+----------
         9 |    16,695     60,350      7,772 |    84,817 
           |      0.22       1.91       0.66 |      0.70 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |  Presence of children or young
     Deprivation |     people in the household
           (IMD) |   No kids  Kids unde  Kids unde |     Total
-----------------+---------------------------------+----------
1 least deprived | 1,462,924    581,291    260,661 | 2,304,876 
                 |     18.90      18.37      22.19 |     19.08 
-----------------+---------------------------------+----------
               2 | 1,591,163    584,956    236,192 | 2,412,311 
                 |     20.56      18.49      20.10 |     19.97 
-----------------+---------------------------------+----------
               3 | 1,645,198    608,780    227,038 | 2,481,016 
                 |     21.26      19.24      19.32 |     20.54 
-----------------+---------------------------------+----------
               4 | 1,649,786    682,130    230,995 | 2,562,911 
                 |     21.31      21.56      19.66 |     21.22 
-----------------+---------------------------------+----------
 5 most deprived | 1,391,025    706,915    219,975 | 2,317,915 
                 |     17.97      22.34      18.72 |     19.19 
-----------------+---------------------------------+----------
           Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
                 |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
                      |     people in the household
            Ethnicity |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                White | 4,921,959  1,983,425    680,476 | 7,585,860 
                      |     63.59      62.69      57.92 |     62.80 
----------------------+---------------------------------+----------
                Mixed |    94,668     49,403     14,221 |   158,292 
                      |      1.22       1.56       1.21 |      1.31 
----------------------+---------------------------------+----------
Asian or Asian Britis |   396,202    338,588     99,067 |   833,857 
                      |      5.12      10.70       8.43 |      6.90 
----------------------+---------------------------------+----------
                Black |   167,538    105,887     32,810 |   306,235 
                      |      2.16       3.35       2.79 |      2.54 
----------------------+---------------------------------+----------
                Other |   183,289     85,049     22,102 |   290,440 
                      |      2.37       2.69       1.88 |      2.40 
----------------------+---------------------------------+----------
              Unknown | 1,976,440    601,720    326,185 | 2,904,345 
                      |     25.54      19.02      27.76 |     24.04 
----------------------+---------------------------------+----------
                Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
                      |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |
      tion |  Presence of children or young
Partnershi |     people in the household
         p |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 |     1,760      1,222        330 |     3,312 
           |      0.02       0.04       0.03 |      0.03 
-----------+---------------------------------+----------
         2 |   698,676    339,379    116,441 | 1,154,496 
           |      9.03      10.73       9.91 |      9.56 
-----------+---------------------------------+----------
         3 |   342,238    132,841     49,121 |   524,200 
           |      4.42       4.20       4.18 |      4.34 
-----------+---------------------------------+----------
         4 |    75,383     32,435     12,783 |   120,601 
           |      0.97       1.03       1.09 |      1.00 
-----------+---------------------------------+----------
         5 |    53,796     22,199      8,927 |    84,922 
           |      0.70       0.70       0.76 |      0.70 
-----------+---------------------------------+----------
         6 |   368,875    146,463     53,801 |   569,139 
           |      4.77       4.63       4.58 |      4.71 
-----------+---------------------------------+----------
         7 |    22,736      8,633      2,975 |    34,344 
           |      0.29       0.27       0.25 |      0.28 
-----------+---------------------------------+----------
         8 |   284,033    115,423     42,838 |   442,294 
           |      3.67       3.65       3.65 |      3.66 
-----------+---------------------------------+----------
         9 |   225,314     83,249     33,237 |   341,800 
           |      2.91       2.63       2.83 |      2.83 
-----------+---------------------------------+----------
        10 |   304,207    132,768     46,007 |   482,982 
           |      3.93       4.20       3.92 |      4.00 
-----------+---------------------------------+----------
        11 |   338,521    147,245     54,995 |   540,761 
           |      4.37       4.65       4.68 |      4.48 
-----------+---------------------------------+----------
        12 |   110,022     55,659     18,669 |   184,350 
           |      1.42       1.76       1.59 |      1.53 
-----------+---------------------------------+----------
        13 |   163,307     77,041     28,707 |   269,055 
           |      2.11       2.43       2.44 |      2.23 
-----------+---------------------------------+----------
        14 |   203,059     97,828     34,983 |   335,870 
           |      2.62       3.09       2.98 |      2.78 
-----------+---------------------------------+----------
        15 |   263,650    124,544     42,569 |   430,763 
           |      3.41       3.94       3.62 |      3.57 
-----------+---------------------------------+----------
        16 |   278,398    107,439     40,435 |   426,272 
           |      3.60       3.40       3.44 |      3.53 
-----------+---------------------------------+----------
        17 |   238,122     94,399     36,483 |   369,004 
           |      3.08       2.98       3.11 |      3.05 
-----------+---------------------------------+----------
        18 |   310,384    169,850     58,280 |   538,514 
           |      4.01       5.37       4.96 |      4.46 
-----------+---------------------------------+----------
        19 |   257,796    116,756     42,479 |   417,031 
           |      3.33       3.69       3.62 |      3.45 
-----------+---------------------------------+----------
        20 |   360,745    172,018     66,337 |   599,100 
           |      4.66       5.44       5.65 |      4.96 
-----------+---------------------------------+----------
        21 |   687,615    209,359     74,149 |   971,123 
           |      8.88       6.62       6.31 |      8.04 
-----------+---------------------------------+----------
        22 |    36,493     19,558      6,525 |    62,576 
           |      0.47       0.62       0.56 |      0.52 
-----------+---------------------------------+----------
        23 |   300,368    112,819     45,145 |   458,332 
           |      3.88       3.57       3.84 |      3.79 
-----------+---------------------------------+----------
        24 |    14,754      4,951      2,248 |    21,953 
           |      0.19       0.16       0.19 |      0.18 
-----------+---------------------------------+----------
        25 |    76,687     23,062      9,851 |   109,600 
           |      0.99       0.73       0.84 |      0.91 
-----------+---------------------------------+----------
        26 |   249,565     86,001     35,101 |   370,667 
           |      3.22       2.72       2.99 |      3.07 
-----------+---------------------------------+----------
        27 |   300,018    115,340     47,033 |   462,391 
           |      3.88       3.65       4.00 |      3.83 
-----------+---------------------------------+----------
        28 |   254,169     84,500     34,573 |   373,242 
           |      3.28       2.67       2.94 |      3.09 
-----------+---------------------------------+----------
        29 |   216,447     71,466     26,139 |   314,052 
           |      2.80       2.26       2.22 |      2.60 
-----------+---------------------------------+----------
        30 |   149,768     53,098     21,763 |   224,629 
           |      1.93       1.68       1.85 |      1.86 
-----------+---------------------------------+----------
        31 |     9,409      3,348      1,494 |    14,251 
           |      0.12       0.11       0.13 |      0.12 
-----------+---------------------------------+----------
        32 |   543,781    203,179     80,443 |   827,403 
           |      7.03       6.42       6.85 |      6.85 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
Respirator |     people in the household
y Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,552,768  3,138,389  1,159,180 |11,850,337 
           |     97.58      99.19      98.67 |     98.11 
-----------+---------------------------------+----------
         1 |   187,328     25,683     15,681 |   228,692 
           |      2.42       0.81       1.33 |      1.89 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
    Asthma |     people in the household
  category |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 6,448,960  2,609,161    973,787 |10,031,908 
           |     83.32      82.46      82.89 |     83.05 
-----------+---------------------------------+----------
         1 | 1,291,136    554,911    201,074 | 2,047,121 
           |     16.68      17.54      17.11 |     16.95 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
   Cardiac |     people in the household
  Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,475,475  3,120,699  1,148,943 |11,745,117 
           |     96.58      98.63      97.79 |     97.24 
-----------+---------------------------------+----------
         1 |   264,621     43,373     25,918 |   333,912 
           |      3.42       1.37       2.21 |      2.76 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |  Presence of children or young
                   |     people in the household
          Diabetes |   No kids  Kids unde  Kids unde |     Total
-------------------+---------------------------------+----------
       No diabetes | 7,198,694  3,027,000  1,106,146 |11,331,840 
                   |     94.49      97.02      95.64 |     95.26 
-------------------+---------------------------------+----------
  T1DM, controlled |    11,356      3,749      1,336 |    16,441 
                   |      0.15       0.12       0.12 |      0.14 
-------------------+---------------------------------+----------
T1DM, uncontrolled |    34,447     10,342      4,471 |    49,260 
                   |      0.45       0.33       0.39 |      0.41 
-------------------+---------------------------------+----------
  T2DM, controlled |   208,643     42,597     23,760 |   275,000 
                   |      2.74       1.37       2.05 |      2.31 
-------------------+---------------------------------+----------
T2DM, uncontrolled |   161,782     34,929     20,357 |   217,068 
                   |      2.12       1.12       1.76 |      1.82 
-------------------+---------------------------------+----------
Diabetes, no HbA1c |     3,723      1,311        476 |     5,510 
                   |      0.05       0.04       0.04 |      0.05 
-------------------+---------------------------------+----------
             Total | 7,618,645  3,119,928  1,156,546 |11,895,119 
                   |    100.00     100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Non-haematolo |     people in the household
 gical cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 7,539,115  3,130,498  1,152,386 |11,821,999 
              |     97.40      98.94      98.09 |     97.87 
--------------+---------------------------------+----------
    Last year |    21,825      4,165      2,599 |    28,589 
              |      0.28       0.13       0.22 |      0.24 
--------------+---------------------------------+----------
2-5 years ago |    63,132     11,693      7,538 |    82,363 
              |      0.82       0.37       0.64 |      0.68 
--------------+---------------------------------+----------
     5+ years |   116,024     17,716     12,338 |   146,078 
              |      1.50       0.56       1.05 |      1.21 
--------------+---------------------------------+----------
        Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
              |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Haematologica |     people in the household
     l cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 7,711,914  3,157,629  1,171,662 |12,041,205 
              |     99.64      99.80      99.73 |     99.69 
--------------+---------------------------------+----------
    Last year |     2,303        509        248 |     3,060 
              |      0.03       0.02       0.02 |      0.03 
--------------+---------------------------------+----------
2-5 years ago |     7,261      1,471        783 |     9,515 
              |      0.09       0.05       0.07 |      0.08 
--------------+---------------------------------+----------
     5+ years |    18,618      4,463      2,168 |    25,249 
              |      0.24       0.14       0.18 |      0.21 
--------------+---------------------------------+----------
        Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
              |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |  Presence of children or young
        on |     people in the household
algorithm) |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,712,320  3,155,795  1,171,704 |12,039,819 
           |     99.64      99.74      99.73 |     99.68 
-----------+---------------------------------+----------
         1 |    27,776      8,277      3,157 |    39,210 
           |      0.36       0.26       0.27 |      0.32 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |  Presence of children or young
     organ |     people in the household
transplant |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,737,931  3,163,668  1,174,605 |12,076,204 
           |     99.97      99.99      99.98 |     99.98 
-----------+---------------------------------+----------
         1 |     2,165        404        256 |     2,825 
           |      0.03       0.01       0.02 |      0.02 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
  Asplenia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,729,946  3,161,596  1,173,620 |12,065,162 
           |     99.87      99.92      99.89 |     99.89 
-----------+---------------------------------+----------
         1 |    10,150      2,476      1,241 |    13,867 
           |      0.13       0.08       0.11 |      0.11 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
     liver |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,691,456  3,154,036  1,170,634 |12,016,126 
           |     99.37      99.68      99.64 |     99.48 
-----------+---------------------------------+----------
         1 |    48,640     10,036      4,227 |    62,903 
           |      0.63       0.32       0.36 |      0.52 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Neurologic |     people in the household
al disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,676,721  3,151,912  1,168,157 |11,996,790 
           |     99.18      99.62      99.43 |     99.32 
-----------+---------------------------------+----------
         1 |    63,375     12,160      6,704 |    82,239 
           |      0.82       0.38       0.57 |      0.68 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
 Stroke or |     people in the household
  dementia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,666,099  3,153,323  1,168,391 |11,987,813 
           |     99.04      99.66      99.45 |     99.24 
-----------+---------------------------------+----------
         1 |    73,997     10,749      6,470 |    91,216 
           |      0.96       0.34       0.55 |      0.76 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Calculated |     people in the household
      eGFR |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 |     3,920        668        391 |     4,979 
           |      0.07       0.03       0.05 |      0.06 
-----------+---------------------------------+----------
        15 |     5,498        897        531 |     6,926 
           |      0.10       0.04       0.06 |      0.08 
-----------+---------------------------------+----------
        30 |    13,888      1,779      1,067 |    16,734 
           |      0.26       0.08       0.13 |      0.20 
-----------+---------------------------------+----------
        45 |    88,491      9,570      6,986 |   105,047 
           |      1.67       0.45       0.84 |      1.27 
-----------+---------------------------------+----------
        60 | 5,197,219  2,114,505    826,458 | 8,138,182 
           |     97.89      99.39      98.93 |     98.38 
-----------+---------------------------------+----------
     Total | 5,309,016  2,127,419    835,433 | 8,271,868 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
       Reduced kidney |     people in the household
             function |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                 None | 7,628,299  3,151,158  1,165,886 |11,945,343 
                      |     98.56      99.59      99.24 |     98.89 
----------------------+---------------------------------+----------
Stage 3a/3b egfr 30-6 |   102,379     11,349      8,053 |   121,781 
                      |      1.32       0.36       0.69 |      1.01 
----------------------+---------------------------------+----------
    Stage 4/5 egfr<30 |     9,418      1,565        922 |    11,905 
                      |      0.12       0.05       0.08 |      0.10 
----------------------+---------------------------------+----------
                Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
                      |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |  Presence of children or young
     renal |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,729,176  3,161,842  1,173,735 |12,064,753 
           |     99.86      99.93      99.90 |     99.88 
-----------+---------------------------------+----------
         1 |    10,920      2,230      1,126 |    14,276 
           |      0.14       0.07       0.10 |      0.12 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |  Presence of children or young
hypertensi |     people in the household
        on |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 6,701,623  2,982,771  1,057,352 |10,741,746 
           |     86.58      94.27      90.00 |     88.93 
-----------+---------------------------------+----------
         1 | 1,038,473    181,301    117,509 | 1,337,283 
           |     13.42       5.73      10.00 |     11.07 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Autoimmune |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 7,393,674  3,036,273  1,122,769 |11,552,716 
           |     95.52      95.96      95.57 |     95.64 
-----------+---------------------------------+----------
         1 |   346,422    127,799     52,092 |   526,313 
           |      4.48       4.04       4.43 |      4.36 
-----------+---------------------------------+----------
     Total | 7,740,096  3,164,072  1,174,861 |12,079,029 
           |    100.00     100.00     100.00 |    100.00 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  3,469,712    75.49242    7.056946         66        110
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |    796,797       22.96       22.96
     70-<80 |  1,724,416       49.70       72.66
        80+ |    948,499       27.34      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    205,305        5.92        5.92
          1 |  3,264,407       94.08      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,859,697       53.60       53.60
          1 |  1,610,015       46.40      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     57,563        1.82        1.82
  Normal (18.5-24.9) |    981,169       31.07       32.89
Overweight (25-29.9) |  1,234,186       39.08       71.97
   Obese I (30-34.9) |    607,885       19.25       91.21
  Obese II (35-39.9) |    199,972        6.33       97.54
     Obese III (40+) |     77,544        2.46      100.00
---------------------+-----------------------------------
               Total |  3,158,319      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     57,563        1.66        1.66
  Normal (18.5-24.9) |    981,169       28.28       29.94
Overweight (25-29.9) |  1,234,186       35.57       65.51
   Obese I (30-34.9) |    607,885       17.52       83.03
  Obese II (35-39.9) |    199,972        5.76       88.79
     Obese III (40+) |     77,544        2.23       91.03
        Unknown (.u) |    311,393        8.97      100.00
---------------------+-----------------------------------
               Total |  3,469,712      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  2,584,311       74.48       74.48
   Obese I (30-34.9) |    607,885       17.52       92.00
  Obese II (35-39.9) |    199,972        5.76       97.77
     Obese III (40+) |     77,544        2.23      100.00
---------------------+-----------------------------------
               Total |  3,469,712      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,383,513       40.12       40.12
      Former |  1,778,168       51.56       91.68
     Current |    286,865        8.32      100.00
-------------+-----------------------------------
       Total |  3,448,546      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,383,513       39.87       39.87
      Former |  1,778,168       51.25       91.12
     Current |    286,865        8.27       99.39
Unknown (.u) |     21,166        0.61      100.00
-------------+-----------------------------------
       Total |  3,469,712      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    390,053       11.34       11.34
      Elevated |    529,449       15.39       26.72
 High, stage I |  1,265,248       36.77       63.49
High, stage II |  1,256,168       36.51      100.00
---------------+-----------------------------------
         Total |  3,440,918      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    390,053       11.24       11.24
      Elevated |    529,449       15.26       26.50
 High, stage I |  1,265,248       36.47       62.97
High, stage II |  1,256,168       36.20       99.17
       Unknown |     28,794        0.83      100.00
---------------+-----------------------------------
         Total |  3,469,712      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,051,897       30.32       30.32
          1 |  2,417,815       69.68      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,051,897       30.32       30.32
          1 |  2,417,815       69.68      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    870,006       25.07       25.07
               2 |    819,958       23.63       48.71
               3 |    745,010       21.47       70.18
               4 |    604,978       17.44       87.61
 5 most deprived |    429,760       12.39      100.00
-----------------+-----------------------------------
           Total |  3,469,712      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    870,006       25.07       25.07
               2 |    819,958       23.63       48.71
               3 |    745,010       21.47       70.18
               4 |    604,978       17.44       87.61
 5 most deprived |    429,760       12.39      100.00
-----------------+-----------------------------------
           Total |  3,469,712      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,404,539       94.19       94.19
                 Mixed |      9,726        0.38       94.57
Asian or Asian British |     90,144        3.53       98.10
                 Black |     27,193        1.07       99.17
                 Other |     21,248        0.83      100.00
-----------------------+-----------------------------------
                 Total |  2,552,850      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,404,539       69.30       69.30
                 Mixed |      9,726        0.28       69.58
Asian or Asian British |     90,144        2.60       72.18
                 Black |     27,193        0.78       72.96
                 Other |     21,248        0.61       73.58
               Unknown |    916,862       26.42      100.00
-----------------------+-----------------------------------
                 Total |  3,469,712      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        324        0.01        0.01
          2 |    287,625        8.29        8.30
          3 |    155,834        4.49       12.79
          4 |     34,216        0.99       13.78
          5 |     23,717        0.68       14.46
          6 |    161,896        4.67       19.13
          7 |      9,369        0.27       19.40
          8 |    136,625        3.94       23.33
          9 |    128,513        3.70       27.04
         10 |    141,492        4.08       31.12
         11 |    142,491        4.11       35.22
         12 |     38,745        1.12       36.34
         13 |     67,256        1.94       38.28
         14 |     84,800        2.44       40.72
         15 |    111,517        3.21       43.94
         16 |    165,454        4.77       48.70
         17 |    123,175        3.55       52.25
         18 |    125,193        3.61       55.86
         19 |    109,847        3.17       59.03
         20 |    179,989        5.19       64.22
         21 |    134,341        3.87       68.09
         22 |      9,432        0.27       68.36
         23 |    150,789        4.35       72.70
         24 |      8,124        0.23       72.94
         25 |     43,066        1.24       74.18
         26 |    151,741        4.37       78.55
         27 |    146,914        4.23       82.79
         28 |    150,243        4.33       87.12
         29 |     97,557        2.81       89.93
         30 |     76,668        2.21       92.14
         31 |      4,910        0.14       92.28
         32 |    267,849        7.72      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  1,195,868       34.47       34.47
          2 |  1,774,101       51.13       85.60
          3 |    499,743       14.40      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

     Number |
  people in |
  household |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  1,182,772       34.09       34.09
          2 |  1,753,016       50.52       84.61
          3 |    322,395        9.29       93.90
          4 |    103,111        2.97       96.88
          5 |     50,124        1.44       98.32
          6 |     29,645        0.85       99.17
          7 |     15,380        0.44       99.62
          8 |      8,391        0.24       99.86
          9 |      4,878        0.14      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,060,342       88.20       88.20
          1 |    409,370       11.80      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,019,907       87.04       87.04
          1 |    449,805       12.96      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,750,333       79.27       79.27
          1 |    719,379       20.73      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |  2,693,245       81.36       81.36
  T1DM, controlled |      4,528        0.14       81.49
T1DM, uncontrolled |      9,314        0.28       81.77
  T2DM, controlled |    413,866       12.50       94.27
T2DM, uncontrolled |    187,048        5.65       99.92
Diabetes, no HbA1c |      2,483        0.08      100.00
-------------------+-----------------------------------
             Total |  3,310,484      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  2,974,814       85.74       85.74
    Last year |     41,353        1.19       86.93
2-5 years ago |    123,325        3.55       90.48
     5+ years |    330,220        9.52      100.00
--------------+-----------------------------------
        Total |  3,469,712      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  3,418,696       98.53       98.53
    Last year |      4,899        0.14       98.67
2-5 years ago |     15,248        0.44       99.11
     5+ years |     30,869        0.89      100.00
--------------+-----------------------------------
        Total |  3,469,712      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,462,975       99.81       99.81
          1 |      6,737        0.19      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,468,595       99.97       99.97
          1 |      1,117        0.03      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,461,177       99.75       99.75
          1 |      8,535        0.25      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,437,995       99.09       99.09
          1 |     31,717        0.91      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,402,690       98.07       98.07
          1 |     67,022        1.93      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,217,794       92.74       92.74
          1 |    251,918        7.26      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,997        0.24        0.24
         15 |     46,390        1.41        1.66
         30 |    200,389        6.11        7.77
         45 |    547,046       16.68       24.45
         60 |  2,478,081       75.55      100.00
------------+-----------------------------------
      Total |  3,279,903      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |  2,667,890       76.89       76.89
Stage 3a/3b egfr 30-60       |    747,435       21.54       98.43
           Stage 4/5 egfr<30 |     54,387        1.57      100.00
-----------------------------+-----------------------------------
                       Total |  3,469,712      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,461,196       99.75       99.75
          1 |      8,516        0.25      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,543,599       44.49       44.49
          1 |  1,926,113       55.51      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,206,007       92.40       92.40
          1 |    263,705        7.60      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,278,350       65.66       65.66
          1 |  1,191,362       34.34      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

  Presence of |
  children or |
 young people |
       in the |
    household |      Freq.     Percent        Cum.
--------------+-----------------------------------
      No kids |  3,359,594       96.83       96.83
Kids under 12 |     73,264        2.11       98.94
Kids under 18 |     36,854        1.06      100.00
--------------+-----------------------------------
        Total |  3,469,712      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
           none |  3,359,594       96.83       96.83
 only >12 years |     36,854        1.06       97.89
    1 child <12 |     45,672        1.32       99.20
 2 children <12 |     21,596        0.62       99.83
3+ children <12 |      5,996        0.17      100.00
----------------+-----------------------------------
          Total |  3,469,712      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,461,956       99.78       99.78
          1 |      7,756        0.22      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,423,434       98.67       98.67
          1 |     46,278        1.33      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,455,607       99.59       99.59
          1 |     14,105        0.41      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,461,956       99.78       99.78
          1 |      7,756        0.22      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
     covid |     people in the household
     death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,352,067     73,111     36,778 | 3,461,956 
           |     96.83       2.11       1.06 |    100.00 
           |     99.78      99.79      99.79 |     99.78 
-----------+---------------------------------+----------
         1 |     7,527        153         76 |     7,756 
           |     97.05       1.97       0.98 |    100.00 
           |      0.22       0.21       0.21 |      0.22 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |     96.83       2.11       1.06 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
     covid |            Number kids under 12 years in hh
     death |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 3,352,067     36,778     45,587     21,549      5,975 | 3,461,956 
           |     96.83       1.06       1.32       0.62       0.17 |    100.00 
           |     99.78      99.79      99.81      99.78      99.65 |     99.78 
-----------+-------------------------------------------------------+----------
         1 |     7,527         76         85         47         21 |     7,756 
           |     97.05       0.98       1.10       0.61       0.27 |    100.00 
           |      0.22       0.21       0.19       0.22       0.35 |      0.22 
-----------+-------------------------------------------------------+----------
     Total | 3,359,594     36,854     45,672     21,596      5,996 | 3,469,712 
           |     96.83       1.06       1.32       0.62       0.17 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,423,434       98.67       98.67
          1 |     46,278        1.33      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
 non-covid |     people in the household
     death |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,314,564     72,461     36,409 | 3,423,434 
           |     96.82       2.12       1.06 |    100.00 
           |     98.66      98.90      98.79 |     98.67 
-----------+---------------------------------+----------
         1 |    45,030        803        445 |    46,278 
           |     97.30       1.74       0.96 |    100.00 
           |      1.34       1.10       1.21 |      1.33 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |     96.83       2.11       1.06 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |            Number kids under 12 years in hh
     death |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 3,314,564     36,409     45,178     21,357      5,926 | 3,423,434 
           |     96.82       1.06       1.32       0.62       0.17 |    100.00 
           |     98.66      98.79      98.92      98.89      98.83 |     98.67 
-----------+-------------------------------------------------------+----------
         1 |    45,030        445        494        239         70 |    46,278 
           |     97.30       0.96       1.07       0.52       0.15 |    100.00 
           |      1.34       1.21       1.08       1.11       1.17 |      1.33 
-----------+-------------------------------------------------------+----------
     Total | 3,359,594     36,854     45,672     21,596      5,996 | 3,469,712 
           |     96.83       1.06       1.32       0.62       0.17 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,455,607       99.59       99.59
          1 |     14,105        0.41      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |  Presence of children or young
covid prob |     people in the household
      case |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,346,063     72,869     36,675 | 3,455,607 
           |     96.83       2.11       1.06 |    100.00 
           |     99.60      99.46      99.51 |     99.59 
-----------+---------------------------------+----------
         1 |    13,531        395        179 |    14,105 
           |     95.93       2.80       1.27 |    100.00 
           |      0.40       0.54       0.49 |      0.41 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |     96.83       2.11       1.06 |    100.00 
           |    100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |            Number kids under 12 years in hh
      case |      none  only >12   1 child <  2 childre  3+ childr |     Total
-----------+-------------------------------------------------------+----------
         0 | 3,346,063     36,675     45,446     21,466      5,957 | 3,455,607 
           |     96.83       1.06       1.32       0.62       0.17 |    100.00 
           |     99.60      99.51      99.51      99.40      99.35 |     99.59 
-----------+-------------------------------------------------------+----------
         1 |    13,531        179        226        130         39 |    14,105 
           |     95.93       1.27       1.60       0.92       0.28 |    100.00 
           |      0.40       0.49       0.49       0.60       0.65 |      0.41 
-----------+-------------------------------------------------------+----------
     Total | 3,359,594     36,854     45,672     21,596      5,996 | 3,469,712 
           |     96.83       1.06       1.32       0.62       0.17 |    100.00 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
   Grouped |     people in the household
       age |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
    60-<70 |   757,236     28,244     11,317 |   796,797 
           |     22.54      38.55      30.71 |     22.96 
-----------+---------------------------------+----------
    70-<80 | 1,671,403     34,616     18,397 | 1,724,416 
           |     49.75      47.25      49.92 |     49.70 
-----------+---------------------------------+----------
       80+ |   930,955     10,404      7,140 |   948,499 
           |     27.71      14.20      19.37 |     27.34 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
      Male |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 1,801,891     38,684     19,122 | 1,859,697 
           |     53.63      52.80      51.89 |     53.60 
-----------+---------------------------------+----------
         1 | 1,557,703     34,580     17,732 | 1,610,015 
           |     46.37      47.20      48.11 |     46.40 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
                     |     people in the household
         Grouped BMI |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |    56,092        942        529 |    57,563 
                     |      1.67       1.29       1.44 |      1.66 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |   954,818     17,666      8,685 |   981,169 
                     |     28.42      24.11      23.57 |     28.28 
---------------------+---------------------------------+----------
Overweight (25-29.9) | 1,196,918     24,611     12,657 | 1,234,186 
                     |     35.63      33.59      34.34 |     35.57 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   587,146     13,875      6,864 |   607,885 
                     |     17.48      18.94      18.62 |     17.52 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   192,639      4,726      2,607 |   199,972 
                     |      5.73       6.45       7.07 |      5.76 
---------------------+---------------------------------+----------
     Obese III (40+) |    74,448      2,030      1,066 |    77,544 
                     |      2.22       2.77       2.89 |      2.23 
---------------------+---------------------------------+----------
        Unknown (.u) |   297,533      9,414      4,446 |   311,393 
                     |      8.86      12.85      12.06 |      8.97 
---------------------+---------------------------------+----------
               Total | 3,359,594     73,264     36,854 | 3,469,712 
                     |    100.00     100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |  Presence of children or young
     Smoking |     people in the household
      status |   No kids  Kids unde  Kids unde |     Total
-------------+---------------------------------+----------
       Never | 1,331,872     35,427     16,214 | 1,383,513 
             |     39.64      48.36      44.00 |     39.87 
-------------+---------------------------------+----------
      Former | 1,733,725     28,314     16,129 | 1,778,168 
             |     51.61      38.65      43.76 |     51.25 
-------------+---------------------------------+----------
     Current |   275,549      7,479      3,837 |   286,865 
             |      8.20      10.21      10.41 |      8.27 
-------------+---------------------------------+----------
Unknown (.u) |    18,448      2,044        674 |    21,166 
             |      0.55       2.79       1.83 |      0.61 
-------------+---------------------------------+----------
       Total | 3,359,594     73,264     36,854 | 3,469,712 
             |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Presence of children or young
 Evidence of obesity |     people in the household
      (4 categories) |   No kids  Kids unde  Kids unde |     Total
---------------------+---------------------------------+----------
No record of obesity | 2,505,361     52,633     26,317 | 2,584,311 
                     |     74.57      71.84      71.41 |     74.48 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |   587,146     13,875      6,864 |   607,885 
                     |     17.48      18.94      18.62 |     17.52 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |   192,639      4,726      2,607 |   199,972 
                     |      5.73       6.45       7.07 |      5.76 
---------------------+---------------------------------+----------
     Obese III (40+) |    74,448      2,030      1,066 |    77,544 
                     |      2.22       2.77       2.89 |      2.23 
---------------------+---------------------------------+----------
               Total | 3,359,594     73,264     36,854 | 3,469,712 
                     |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
  Probable |     people in the household
 shielding |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 2,201,771     51,574     25,005 | 2,278,350 
           |     65.54      70.39      67.85 |     65.66 
-----------+---------------------------------+----------
         1 | 1,157,823     21,690     11,849 | 1,191,362 
           |     34.46      29.61      32.15 |     34.34 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Total |
    number |  Presence of children or young
 adults in |     people in the household
        hh |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 1,191,647      2,181      2,040 | 1,195,868 
           |     35.47       2.98       5.54 |     34.47 
-----------+---------------------------------+----------
         2 | 1,752,781     12,184      9,136 | 1,774,101 
           |     52.17      16.63      24.79 |     51.13 
-----------+---------------------------------+----------
         3 |   415,166     58,899     25,678 |   499,743 
           |     12.36      80.39      69.67 |     14.40 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Number |  Presence of children or young
 people in |     people in the household
 household |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 | 1,182,772          0          0 | 1,182,772 
           |     35.21       0.00       0.00 |     34.09 
-----------+---------------------------------+----------
         2 | 1,749,875      1,438      1,703 | 1,753,016 
           |     52.09       1.96       4.62 |     50.52 
-----------+---------------------------------+----------
         3 |   307,896      6,971      7,528 |   322,395 
           |      9.16       9.51      20.43 |      9.29 
-----------+---------------------------------+----------
         4 |    78,588     14,544      9,979 |   103,111 
           |      2.34      19.85      27.08 |      2.97 
-----------+---------------------------------+----------
         5 |    23,570     18,112      8,442 |    50,124 
           |      0.70      24.72      22.91 |      1.44 
-----------+---------------------------------+----------
         6 |     9,198     15,070      5,377 |    29,645 
           |      0.27      20.57      14.59 |      0.85 
-----------+---------------------------------+----------
         7 |     3,857      9,200      2,323 |    15,380 
           |      0.11      12.56       6.30 |      0.44 
-----------+---------------------------------+----------
         8 |     2,236      5,121      1,034 |     8,391 
           |      0.07       6.99       2.81 |      0.24 
-----------+---------------------------------+----------
         9 |     1,602      2,808        468 |     4,878 
           |      0.05       3.83       1.27 |      0.14 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |  Presence of children or young
     Deprivation |     people in the household
           (IMD) |   No kids  Kids unde  Kids unde |     Total
-----------------+---------------------------------+----------
1 least deprived |   849,561     13,017      7,428 |   870,006 
                 |     25.29      17.77      20.16 |     25.07 
-----------------+---------------------------------+----------
               2 |   798,651     13,959      7,348 |   819,958 
                 |     23.77      19.05      19.94 |     23.63 
-----------------+---------------------------------+----------
               3 |   721,965     15,173      7,872 |   745,010 
                 |     21.49      20.71      21.36 |     21.47 
-----------------+---------------------------------+----------
               4 |   580,967     16,361      7,650 |   604,978 
                 |     17.29      22.33      20.76 |     17.44 
-----------------+---------------------------------+----------
 5 most deprived |   408,450     14,754      6,556 |   429,760 
                 |     12.16      20.14      17.79 |     12.39 
-----------------+---------------------------------+----------
           Total | 3,359,594     73,264     36,854 | 3,469,712 
                 |    100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
                      |     people in the household
            Ethnicity |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                White | 2,347,705     36,167     20,667 | 2,404,539 
                      |     69.88      49.37      56.08 |     69.30 
----------------------+---------------------------------+----------
                Mixed |     8,606        768        352 |     9,726 
                      |      0.26       1.05       0.96 |      0.28 
----------------------+---------------------------------+----------
Asian or Asian Britis |    68,075     16,602      5,467 |    90,144 
                      |      2.03      22.66      14.83 |      2.60 
----------------------+---------------------------------+----------
                Black |    23,563      2,508      1,122 |    27,193 
                      |      0.70       3.42       3.04 |      0.78 
----------------------+---------------------------------+----------
                Other |    18,382      2,094        772 |    21,248 
                      |      0.55       2.86       2.09 |      0.61 
----------------------+---------------------------------+----------
              Unknown |   893,263     15,125      8,474 |   916,862 
                      |     26.59      20.64      22.99 |     26.42 
----------------------+---------------------------------+----------
                Total | 3,359,594     73,264     36,854 | 3,469,712 
                      |    100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |
      tion |  Presence of children or young
Partnershi |     people in the household
         p |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         1 |       301         14          9 |       324 
           |      0.01       0.02       0.02 |      0.01 
-----------+---------------------------------+----------
         2 |   276,231      7,935      3,459 |   287,625 
           |      8.22      10.83       9.39 |      8.29 
-----------+---------------------------------+----------
         3 |   152,679      1,922      1,233 |   155,834 
           |      4.54       2.62       3.35 |      4.49 
-----------+---------------------------------+----------
         4 |    33,240        614        362 |    34,216 
           |      0.99       0.84       0.98 |      0.99 
-----------+---------------------------------+----------
         5 |    23,130        392        195 |    23,717 
           |      0.69       0.54       0.53 |      0.68 
-----------+---------------------------------+----------
         6 |   158,052      2,442      1,402 |   161,896 
           |      4.70       3.33       3.80 |      4.67 
-----------+---------------------------------+----------
         7 |     9,193        116         60 |     9,369 
           |      0.27       0.16       0.16 |      0.27 
-----------+---------------------------------+----------
         8 |   133,437      2,067      1,121 |   136,625 
           |      3.97       2.82       3.04 |      3.94 
-----------+---------------------------------+----------
         9 |   125,732      1,675      1,106 |   128,513 
           |      3.74       2.29       3.00 |      3.70 
-----------+---------------------------------+----------
        10 |   137,990      2,221      1,281 |   141,492 
           |      4.11       3.03       3.48 |      4.08 
-----------+---------------------------------+----------
        11 |   136,163      4,359      1,969 |   142,491 
           |      4.05       5.95       5.34 |      4.11 
-----------+---------------------------------+----------
        12 |    36,163      1,819        763 |    38,745 
           |      1.08       2.48       2.07 |      1.12 
-----------+---------------------------------+----------
        13 |    64,067      2,239        950 |    67,256 
           |      1.91       3.06       2.58 |      1.94 
-----------+---------------------------------+----------
        14 |    81,848      1,940      1,012 |    84,800 
           |      2.44       2.65       2.75 |      2.44 
-----------+---------------------------------+----------
        15 |   107,660      2,636      1,221 |   111,517 
           |      3.20       3.60       3.31 |      3.21 
-----------+---------------------------------+----------
        16 |   162,080      2,184      1,190 |   165,454 
           |      4.82       2.98       3.23 |      4.77 
-----------+---------------------------------+----------
        17 |   120,308      1,805      1,062 |   123,175 
           |      3.58       2.46       2.88 |      3.55 
-----------+---------------------------------+----------
        18 |   119,009      4,323      1,861 |   125,193 
           |      3.54       5.90       5.05 |      3.61 
-----------+---------------------------------+----------
        19 |   105,843      2,692      1,312 |   109,847 
           |      3.15       3.67       3.56 |      3.17 
-----------+---------------------------------+----------
        20 |   173,850      4,063      2,076 |   179,989 
           |      5.17       5.55       5.63 |      5.19 
-----------+---------------------------------+----------
        21 |   121,668      9,074      3,599 |   134,341 
           |      3.62      12.39       9.77 |      3.87 
-----------+---------------------------------+----------
        22 |     8,591        616        225 |     9,432 
           |      0.26       0.84       0.61 |      0.27 
-----------+---------------------------------+----------
        23 |   146,900      2,570      1,319 |   150,789 
           |      4.37       3.51       3.58 |      4.35 
-----------+---------------------------------+----------
        24 |     7,923        131         70 |     8,124 
           |      0.24       0.18       0.19 |      0.23 
-----------+---------------------------------+----------
        25 |    42,062        620        384 |    43,066 
           |      1.25       0.85       1.04 |      1.24 
-----------+---------------------------------+----------
        26 |   148,417      2,045      1,279 |   151,741 
           |      4.42       2.79       3.47 |      4.37 
-----------+---------------------------------+----------
        27 |   143,256      2,385      1,273 |   146,914 
           |      4.26       3.26       3.45 |      4.23 
-----------+---------------------------------+----------
        28 |   146,708      2,305      1,230 |   150,243 
           |      4.37       3.15       3.34 |      4.33 
-----------+---------------------------------+----------
        29 |    95,102      1,577        878 |    97,557 
           |      2.83       2.15       2.38 |      2.81 
-----------+---------------------------------+----------
        30 |    75,144        904        620 |    76,668 
           |      2.24       1.23       1.68 |      2.21 
-----------+---------------------------------+----------
        31 |     4,812         65         33 |     4,910 
           |      0.14       0.09       0.09 |      0.14 
-----------+---------------------------------+----------
        32 |   262,035      3,514      2,300 |   267,849 
           |      7.80       4.80       6.24 |      7.72 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
Respirator |     people in the household
y Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 2,961,892     65,911     32,539 | 3,060,342 
           |     88.16      89.96      88.29 |     88.20 
-----------+---------------------------------+----------
         1 |   397,702      7,353      4,315 |   409,370 
           |     11.84      10.04      11.71 |     11.80 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
    Asthma |     people in the household
  category |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 2,924,954     63,170     31,783 | 3,019,907 
           |     87.06      86.22      86.24 |     87.04 
-----------+---------------------------------+----------
         1 |   434,640     10,094      5,071 |   449,805 
           |     12.94      13.78      13.76 |     12.96 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
   Cardiac |     people in the household
  Diseases |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 2,661,679     59,397     29,257 | 2,750,333 
           |     79.23      81.07      79.39 |     79.27 
-----------+---------------------------------+----------
         1 |   697,915     13,867      7,597 |   719,379 
           |     20.77      18.93      20.61 |     20.73 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |  Presence of children or young
                   |     people in the household
          Diabetes |   No kids  Kids unde  Kids unde |     Total
-------------------+---------------------------------+----------
       No diabetes | 2,617,303     49,833     26,109 | 2,693,245 
                   |     81.62      72.31      74.99 |     81.36 
-------------------+---------------------------------+----------
  T1DM, controlled |     4,408         80         40 |     4,528 
                   |      0.14       0.12       0.11 |      0.14 
-------------------+---------------------------------+----------
T1DM, uncontrolled |     9,067        154         93 |     9,314 
                   |      0.28       0.22       0.27 |      0.28 
-------------------+---------------------------------+----------
  T2DM, controlled |   396,707     11,655      5,504 |   413,866 
                   |     12.37      16.91      15.81 |     12.50 
-------------------+---------------------------------+----------
T2DM, uncontrolled |   177,012      7,030      3,006 |   187,048 
                   |      5.52      10.20       8.63 |      5.65 
-------------------+---------------------------------+----------
Diabetes, no HbA1c |     2,256        164         63 |     2,483 
                   |      0.07       0.24       0.18 |      0.08 
-------------------+---------------------------------+----------
             Total | 3,206,753     68,916     34,815 | 3,310,484 
                   |    100.00     100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Non-haematolo |     people in the household
 gical cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 2,875,783     66,242     32,789 | 2,974,814 
              |     85.60      90.42      88.97 |     85.74 
--------------+---------------------------------+----------
    Last year |    40,270        715        368 |    41,353 
              |      1.20       0.98       1.00 |      1.19 
--------------+---------------------------------+----------
2-5 years ago |   120,218      2,008      1,099 |   123,325 
              |      3.58       2.74       2.98 |      3.55 
--------------+---------------------------------+----------
     5+ years |   323,323      4,299      2,598 |   330,220 
              |      9.62       5.87       7.05 |      9.52 
--------------+---------------------------------+----------
        Total | 3,359,594     73,264     36,854 | 3,469,712 
              |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |  Presence of children or young
Haematologica |     people in the household
     l cancer |   No kids  Kids unde  Kids unde |     Total
--------------+---------------------------------+----------
        Never | 3,309,838     72,461     36,397 | 3,418,696 
              |     98.52      98.90      98.76 |     98.53 
--------------+---------------------------------+----------
    Last year |     4,779         79         41 |     4,899 
              |      0.14       0.11       0.11 |      0.14 
--------------+---------------------------------+----------
2-5 years ago |    14,860        236        152 |    15,248 
              |      0.44       0.32       0.41 |      0.44 
--------------+---------------------------------+----------
     5+ years |    30,117        488        264 |    30,869 
              |      0.90       0.67       0.72 |      0.89 
--------------+---------------------------------+----------
        Total | 3,359,594     73,264     36,854 | 3,469,712 
              |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |  Presence of children or young
        on |     people in the household
algorithm) |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,353,110     73,096     36,769 | 3,462,975 
           |     99.81      99.77      99.77 |     99.81 
-----------+---------------------------------+----------
         1 |     6,484        168         85 |     6,737 
           |      0.19       0.23       0.23 |      0.19 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |  Presence of children or young
     organ |     people in the household
transplant |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,358,531     73,228     36,836 | 3,468,595 
           |     99.97      99.95      99.95 |     99.97 
-----------+---------------------------------+----------
         1 |     1,063         36         18 |     1,117 
           |      0.03       0.05       0.05 |      0.03 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
           |     people in the household
  Asplenia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,351,267     73,135     36,775 | 3,461,177 
           |     99.75      99.82      99.79 |     99.75 
-----------+---------------------------------+----------
         1 |     8,327        129         79 |     8,535 
           |      0.25       0.18       0.21 |      0.25 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Presence of children or young
     liver |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,328,940     72,581     36,474 | 3,437,995 
           |     99.09      99.07      98.97 |     99.09 
-----------+---------------------------------+----------
         1 |    30,654        683        380 |    31,717 
           |      0.91       0.93       1.03 |      0.91 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Neurologic |     people in the household
al disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,294,452     72,022     36,216 | 3,402,690 
           |     98.06      98.30      98.27 |     98.07 
-----------+---------------------------------+----------
         1 |    65,142      1,242        638 |    67,022 
           |      1.94       1.70       1.73 |      1.93 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
 Stroke or |     people in the household
  dementia |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,114,787     68,689     34,318 | 3,217,794 
           |     92.71      93.76      93.12 |     92.74 
-----------+---------------------------------+----------
         1 |   244,807      4,575      2,536 |   251,918 
           |      7.29       6.24       6.88 |      7.26 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Calculated |     people in the household
      eGFR |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 |     7,592        264        141 |     7,997 
           |      0.24       0.40       0.42 |      0.24 
-----------+---------------------------------+----------
        15 |    45,078        856        456 |    46,390 
           |      1.42       1.31       1.35 |      1.41 
-----------+---------------------------------+----------
        30 |   195,602      2,983      1,804 |   200,389 
           |      6.15       4.56       5.36 |      6.11 
-----------+---------------------------------+----------
        45 |   533,271      8,680      5,095 |   547,046 
           |     16.77      13.27      15.13 |     16.68 
-----------+---------------------------------+----------
        60 | 2,399,296     52,615     26,170 | 2,478,081 
           |     75.43      80.45      77.73 |     75.55 
-----------+---------------------------------+----------
     Total | 3,180,839     65,398     33,666 | 3,279,903 
           |    100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Presence of children or young
       Reduced kidney |     people in the household
             function |   No kids  Kids unde  Kids unde |     Total
----------------------+---------------------------------+----------
                 None | 2,578,051     60,481     29,358 | 2,667,890 
                      |     76.74      82.55      79.66 |     76.89 
----------------------+---------------------------------+----------
Stage 3a/3b egfr 30-6 |   728,873     11,663      6,899 |   747,435 
                      |     21.70      15.92      18.72 |     21.54 
----------------------+---------------------------------+----------
    Stage 4/5 egfr<30 |    52,670      1,120        597 |    54,387 
                      |      1.57       1.53       1.62 |      1.57 
----------------------+---------------------------------+----------
                Total | 3,359,594     73,264     36,854 | 3,469,712 
                      |    100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |  Presence of children or young
     renal |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,351,512     72,964     36,720 | 3,461,196 
           |     99.76      99.59      99.64 |     99.75 
-----------+---------------------------------+----------
         1 |     8,082        300        134 |     8,516 
           |      0.24       0.41       0.36 |      0.25 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |  Presence of children or young
hypertensi |     people in the household
        on |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 1,491,266     35,399     16,934 | 1,543,599 
           |     44.39      48.32      45.95 |     44.49 
-----------+---------------------------------+----------
         1 | 1,868,328     37,865     19,920 | 1,926,113 
           |     55.61      51.68      54.05 |     55.51 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Presence of children or young
Autoimmune |     people in the household
   disease |   No kids  Kids unde  Kids unde |     Total
-----------+---------------------------------+----------
         0 | 3,103,133     68,632     34,242 | 3,206,007 
           |     92.37      93.68      92.91 |     92.40 
-----------+---------------------------------+----------
         1 |   256,461      4,632      2,612 |   263,705 
           |      7.63       6.32       7.09 |      7.60 
-----------+---------------------------------+----------
     Total | 3,359,594     73,264     36,854 | 3,469,712 
           |    100.00     100.00     100.00 |    100.00 

. * Close the log file
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\03a_an_descriptive_tables.log
  log type:  text
 closed on:   7 Aug 2020, 01:10:04
----------------------------------------------------------------------------------------------------------------------------------
