-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\04a_an_desc
> riptive_tables.log
  log type:  text
 opened on:   6 Aug 2020, 21:50:08

. 
. forvalues x=0/1 {
  2. 
. use $tempdir\analysis_dataset_ageband_`x', clear
  3. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. ta shield
 16. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd            ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 17.                                                 
. safetab `var'
 18. }
 19. 
. safetab imd 
 20. safetab imd, m
 21. safetab ethnicity
 22. safetab ethnicity, m
 23. safetab stp
 24. 
. 
. * Outcomes
. safetab non_covid_death
 25. safetab covid_death
 26. safetab covid_tpp_prob
 27. 
. 
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death non_covid_death {
 28. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    `outvar', col
 29.         safetab male                                                      
>       `outvar', col
 30.         safetab bmicat                                                    
>       `outvar', col m 
 31.         safetab smoke                                                     
>       `outvar', col m
 32.         safetab obese4cat                                                 
>       `outvar', col m 
 33.         safetab shield                                                    
>       `outvar', col m 
 34. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 esrd ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 35.         safetab `var'           `outvar', col
 36. }
 37.         
.         safetab imd                                                          
>    `outvar', col m
 38.         safetab ethnicity                                                 
>       `outvar', col m
 39.         *safetab urban                                                    
>       `outvar', col
.         safetab stp                                                          
>    `outvar', col
 40. }
 41. 
. 
. ********************************************
. *  Cumulative incidence of ONS COVID DEATH*
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_death_ageband_`x'.dta", 
> clear
 42. 
. sts list , at(0 80) by(agegroup male) fail
 43. 
. 
. ********************************************
. *  Cumulative incidence of ONS NON COVID DEATH*
. ********************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_non_covid_death_ageband_`x'.dt
> a", clear
 44. 
. sts list , at(0 80) by(agegroup male) fail
 45. 
. ***************************************
. *  Cumulative incidence of TPP COVID PROBABLE CASES *
. ***************************************
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'.dta
> ", clear
 46. 
. sts list , at(0 80) by(agegroup male) fail
 47. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age | 12,079,029    41.45328    13.39531         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |  2,853,819       23.63       23.63
     30-<40 |  2,775,687       22.98       46.61
     40-<50 |  2,500,494       20.70       67.31
     50-<60 |  2,627,784       21.75       89.06
     60-<70 |  1,321,245       10.94      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,079,029      100.00      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  6,021,568       49.85       49.85
          1 |  6,057,461       50.15      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    223,915        2.44        2.44
  Normal (18.5-24.9) |  3,413,982       37.23       39.67
Overweight (25-29.9) |  3,007,574       32.80       72.47
   Obese I (30-34.9) |  1,544,134       16.84       89.30
  Obese II (35-39.9) |    635,735        6.93       96.24
     Obese III (40+) |    345,174        3.76      100.00
---------------------+-----------------------------------
               Total |  9,170,514      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |    223,915        1.85        1.85
  Normal (18.5-24.9) |  3,413,982       28.26       30.12
Overweight (25-29.9) |  3,007,574       24.90       55.02
   Obese I (30-34.9) |  1,544,134       12.78       67.80
  Obese II (35-39.9) |    635,735        5.26       73.06
     Obese III (40+) |    345,174        2.86       75.92
        Unknown (.u) |  2,908,515       24.08      100.00
---------------------+-----------------------------------
               Total | 12,079,029      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  9,553,986       79.10       79.10
   Obese I (30-34.9) |  1,544,134       12.78       91.88
  Obese II (35-39.9) |    635,735        5.26       97.14
     Obese III (40+) |    345,174        2.86      100.00
---------------------+-----------------------------------
               Total | 12,079,029      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,740,043       49.98       49.98
      Former |  3,311,170       28.83       78.81
     Current |  2,433,250       21.19      100.00
-------------+-----------------------------------
       Total | 11,484,463      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  5,740,043       47.52       47.52
      Former |  3,311,170       27.41       74.93
     Current |  2,433,250       20.14       95.08
Unknown (.u) |    594,566        4.92      100.00
-------------+-----------------------------------
       Total | 12,079,029      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,099,614       29.40       29.40
      Elevated |  1,705,332       16.17       45.57
 High, stage I |  3,695,985       35.05       80.63
High, stage II |  2,042,780       19.37      100.00
---------------+-----------------------------------
         Total | 10,543,711      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |  3,099,614       25.66       25.66
      Elevated |  1,705,332       14.12       39.78
 High, stage I |  3,695,985       30.60       70.38
High, stage II |  2,042,780       16.91       87.29
       Unknown |  1,535,318       12.71      100.00
---------------+-----------------------------------
         Total | 12,079,029      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,258,663       76.65       76.65
          1 |  2,820,366       23.35      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,590,045       79.39       79.39
          1 |  2,488,984       20.61      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,850,337       98.11       98.11
          1 |    228,692        1.89      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,031,908       83.05       83.05
          1 |  2,047,121       16.95      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,745,117       97.24       97.24
          1 |    333,912        2.76      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes | 11,331,840       95.26       95.26
  T1DM, controlled |     16,441        0.14       95.40
T1DM, uncontrolled |     49,260        0.41       95.82
  T2DM, controlled |    275,000        2.31       98.13
T2DM, uncontrolled |    217,068        1.82       99.95
Diabetes, no HbA1c |      5,510        0.05      100.00
-------------------+-----------------------------------
             Total | 11,895,119      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 11,821,999       97.87       97.87
    Last year |     28,589        0.24       98.11
2-5 years ago |     82,363        0.68       98.79
     5+ years |    146,078        1.21      100.00
--------------+-----------------------------------
        Total | 12,079,029      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never | 12,041,205       99.69       99.69
    Last year |      3,060        0.03       99.71
2-5 years ago |      9,515        0.08       99.79
     5+ years |     25,249        0.21      100.00
--------------+-----------------------------------
        Total | 12,079,029      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,039,819       99.68       99.68
          1 |     39,210        0.32      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,076,204       99.98       99.98
          1 |      2,825        0.02      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,065,162       99.89       99.89
          1 |     13,867        0.11      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,016,126       99.48       99.48
          1 |     62,903        0.52      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,996,790       99.32       99.32
          1 |     82,239        0.68      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,987,813       99.24       99.24
          1 |     91,216        0.76      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,979        0.06        0.06
         15 |      6,926        0.08        0.14
         30 |     16,734        0.20        0.35
         45 |    105,047        1.27        1.62
         60 |  8,138,182       98.38      100.00
------------+-----------------------------------
      Total |  8,271,868      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None | 11,945,343       98.89       98.89
Stage 3a/3b egfr 30-60       |    121,781        1.01       99.90
           Stage 4/5 egfr<30 |     11,905        0.10      100.00
-----------------------------+-----------------------------------
                       Total | 12,079,029      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,064,753       99.88       99.88
          1 |     14,276        0.12      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,741,746       88.93       88.93
          1 |  1,337,283       11.07      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 11,552,716       95.64       95.64
          1 |    526,313        4.36      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,304,876       19.08       19.08
               2 |  2,412,311       19.97       39.05
               3 |  2,481,016       20.54       59.59
               4 |  2,562,911       21.22       80.81
 5 most deprived |  2,317,915       19.19      100.00
-----------------+-----------------------------------
           Total | 12,079,029      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |  2,304,876       19.08       19.08
               2 |  2,412,311       19.97       39.05
               3 |  2,481,016       20.54       59.59
               4 |  2,562,911       21.22       80.81
 5 most deprived |  2,317,915       19.19      100.00
-----------------+-----------------------------------
           Total | 12,079,029      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,585,860       82.68       82.68
                 Mixed |    158,292        1.73       84.41
Asian or Asian British |    833,857        9.09       93.50
                 Black |    306,235        3.34       96.83
                 Other |    290,440        3.17      100.00
-----------------------+-----------------------------------
                 Total |  9,174,684      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  7,585,860       62.80       62.80
                 Mixed |    158,292        1.31       64.11
Asian or Asian British |    833,857        6.90       71.02
                 Black |    306,235        2.54       73.55
                 Other |    290,440        2.40       75.96
               Unknown |  2,904,345       24.04      100.00
-----------------------+-----------------------------------
                 Total | 12,079,029      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,312        0.03        0.03
          2 |  1,154,496        9.56        9.59
          3 |    524,200        4.34       13.93
          4 |    120,601        1.00       14.92
          5 |     84,922        0.70       15.63
          6 |    569,139        4.71       20.34
          7 |     34,344        0.28       20.62
          8 |    442,294        3.66       24.28
          9 |    341,800        2.83       27.11
         10 |    482,982        4.00       31.11
         11 |    540,761        4.48       35.59
         12 |    184,350        1.53       37.12
         13 |    269,055        2.23       39.34
         14 |    335,870        2.78       42.12
         15 |    430,763        3.57       45.69
         16 |    426,272        3.53       49.22
         17 |    369,004        3.05       52.27
         18 |    538,514        4.46       56.73
         19 |    417,031        3.45       60.18
         20 |    599,100        4.96       65.14
         21 |    971,123        8.04       73.18
         22 |     62,576        0.52       73.70
         23 |    458,332        3.79       77.50
         24 |     21,953        0.18       77.68
         25 |    109,600        0.91       78.59
         26 |    370,667        3.07       81.65
         27 |    462,391        3.83       85.48
         28 |    373,242        3.09       88.57
         29 |    314,052        2.60       91.17
         30 |    224,629        1.86       93.03
         31 |     14,251        0.12       93.15
         32 |    827,403        6.85      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,069,643       99.92       99.92
          1 |      9,386        0.08      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,077,606       99.99       99.99
          1 |      1,423        0.01      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,045,422       99.72       99.72
          1 |     33,607        0.28      100.00
------------+-----------------------------------
      Total | 12,079,029      100.00
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,848,013      5,806 | 2,853,819 
           |     23.64      17.28 |     23.63 
-----------+----------------------+----------
    30-<40 | 2,768,697      6,990 | 2,775,687 
           |     22.99      20.80 |     22.98 
-----------+----------------------+----------
    40-<50 | 2,492,928      7,566 | 2,500,494 
           |     20.70      22.51 |     20.70 
-----------+----------------------+----------
    50-<60 | 2,618,738      9,046 | 2,627,784 
           |     21.74      26.92 |     21.75 
-----------+----------------------+----------
    60-<70 | 1,317,046      4,199 | 1,321,245 
           |     10.93      12.49 |     10.94 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,002,169     19,399 | 6,021,568 
           |     49.83      57.72 |     49.85 
-----------+----------------------+----------
         1 | 6,043,253     14,208 | 6,057,461 
           |     50.17      42.28 |     50.15 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   223,397        518 |   223,915 
                     |      1.85       1.54 |      1.85 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,406,142      7,840 | 3,413,982 
                     |     28.28      23.33 |     28.26 
---------------------+----------------------+----------
Overweight (25-29.9) | 2,998,196      9,378 | 3,007,574 
                     |     24.89      27.90 |     24.90 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,538,197      5,937 | 1,544,134 
                     |     12.77      17.67 |     12.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   632,827      2,908 |   635,735 
                     |      5.25       8.65 |      5.26 
---------------------+----------------------+----------
     Obese III (40+) |   343,238      1,936 |   345,174 
                     |      2.85       5.76 |      2.86 
---------------------+----------------------+----------
        Unknown (.u) | 2,903,425      5,090 | 2,908,515 
                     |     24.10      15.15 |     24.08 
---------------------+----------------------+----------
               Total |12,045,422     33,607 |12,079,029 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,722,401     17,642 | 5,740,043 
             |     47.51      52.50 |     47.52 
-------------+----------------------+----------
      Former | 3,300,477     10,693 | 3,311,170 
             |     27.40      31.82 |     27.41 
-------------+----------------------+----------
     Current | 2,428,729      4,521 | 2,433,250 
             |     20.16      13.45 |     20.14 
-------------+----------------------+----------
Unknown (.u) |   593,815        751 |   594,566 
             |      4.93       2.23 |      4.92 
-------------+----------------------+----------
       Total |12,045,422     33,607 |12,079,029 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,531,160     22,826 | 9,553,986 
                     |     79.13      67.92 |     79.10 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,538,197      5,937 | 1,544,134 
                     |     12.77      17.67 |     12.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   632,827      2,908 |   635,735 
                     |      5.25       8.65 |      5.26 
---------------------+----------------------+----------
     Obese III (40+) |   343,238      1,936 |   345,174 
                     |      2.85       5.76 |      2.86 
---------------------+----------------------+----------
               Total |12,045,422     33,607 |12,079,029 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,565,472     24,573 | 9,590,045 
           |     79.41      73.12 |     79.39 
-----------+----------------------+----------
         1 | 2,479,950      9,034 | 2,488,984 
           |     20.59      26.88 |     20.61 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,818,111     32,226 |11,850,337 
           |     98.11      95.89 |     98.11 
-----------+----------------------+----------
         1 |   227,311      1,381 |   228,692 
           |      1.89       4.11 |      1.89 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |10,004,994     26,914 |10,031,908 
           |     83.06      80.08 |     83.05 
-----------+----------------------+----------
         1 | 2,040,428      6,693 | 2,047,121 
           |     16.94      19.92 |     16.95 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,713,285     31,832 |11,745,117 
           |     97.24      94.72 |     97.24 
-----------+----------------------+----------
         1 |   332,137      1,775 |   333,912 
           |      2.76       5.28 |      2.76 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: covid prob
                   |         case
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |11,302,765     29,075 |11,331,840 
                   |     95.28      88.73 |     95.26 
-------------------+----------------------+----------
  T1DM, controlled |    16,379         62 |    16,441 
                   |      0.14       0.19 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    49,028        232 |    49,260 
                   |      0.41       0.71 |      0.41 
-------------------+----------------------+----------
  T2DM, controlled |   273,280      1,720 |   275,000 
                   |      2.30       5.25 |      2.31 
-------------------+----------------------+----------
T2DM, uncontrolled |   215,412      1,656 |   217,068 
                   |      1.82       5.05 |      1.82 
-------------------+----------------------+----------
Diabetes, no HbA1c |     5,488         22 |     5,510 
                   |      0.05       0.07 |      0.05 
-------------------+----------------------+----------
             Total |11,862,352     32,767 |11,895,119 
                   |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,789,405     32,594 |11,821,999 
              |     97.87      96.99 |     97.87 
--------------+----------------------+----------
    Last year |    28,416        173 |    28,589 
              |      0.24       0.51 |      0.24 
--------------+----------------------+----------
2-5 years ago |    82,031        332 |    82,363 
              |      0.68       0.99 |      0.68 
--------------+----------------------+----------
     5+ years |   145,570        508 |   146,078 
              |      1.21       1.51 |      1.21 
--------------+----------------------+----------
        Total |12,045,422     33,607 |12,079,029 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,007,855     33,350 |12,041,205 
              |     99.69      99.24 |     99.69 
--------------+----------------------+----------
    Last year |     3,025         35 |     3,060 
              |      0.03       0.10 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,432         83 |     9,515 
              |      0.08       0.25 |      0.08 
--------------+----------------------+----------
     5+ years |    25,110        139 |    25,249 
              |      0.21       0.41 |      0.21 
--------------+----------------------+----------
        Total |12,045,422     33,607 |12,079,029 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |12,006,481     33,338 |12,039,819 
           |     99.68      99.20 |     99.68 
-----------+----------------------+----------
         1 |    38,941        269 |    39,210 
           |      0.32       0.80 |      0.32 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |12,042,642     33,562 |12,076,204 
           |     99.98      99.87 |     99.98 
-----------+----------------------+----------
         1 |     2,780         45 |     2,825 
           |      0.02       0.13 |      0.02 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,031,663     33,499 |12,065,162 
           |     99.89      99.68 |     99.89 
-----------+----------------------+----------
         1 |    13,759        108 |    13,867 
           |      0.11       0.32 |      0.11 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,982,906     33,220 |12,016,126 
           |     99.48      98.85 |     99.48 
-----------+----------------------+----------
         1 |    62,516        387 |    62,903 
           |      0.52       1.15 |      0.52 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,963,554     33,236 |11,996,790 
           |     99.32      98.90 |     99.32 
-----------+----------------------+----------
         1 |    81,868        371 |    82,239 
           |      0.68       1.10 |      0.68 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,954,764     33,049 |11,987,813 
           |     99.25      98.34 |     99.24 
-----------+----------------------+----------
         1 |    90,658        558 |    91,216 
           |      0.75       1.66 |      0.76 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,820        159 |     4,979 
           |      0.06       0.57 |      0.06 
-----------+----------------------+----------
        15 |     6,839         87 |     6,926 
           |      0.08       0.31 |      0.08 
-----------+----------------------+----------
        30 |    16,586        148 |    16,734 
           |      0.20       0.53 |      0.20 
-----------+----------------------+----------
        45 |   104,546        501 |   105,047 
           |      1.27       1.81 |      1.27 
-----------+----------------------+----------
        60 | 8,111,342     26,840 | 8,138,182 
           |     98.39      96.77 |     98.38 
-----------+----------------------+----------
     Total | 8,244,133     27,735 | 8,271,868 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,031,434     33,319 |12,064,753 
           |     99.88      99.14 |     99.88 
-----------+----------------------+----------
         1 |    13,988        288 |    14,276 
           |      0.12       0.86 |      0.12 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,912,631     32,712 |11,945,343 
                      |     98.90      97.34 |     98.89 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   121,132        649 |   121,781 
                      |      1.01       1.93 |      1.01 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,659        246 |    11,905 
                      |      0.10       0.73 |      0.10 
----------------------+----------------------+----------
                Total |12,045,422     33,607 |12,079,029 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,714,374     27,372 |10,741,746 
           |     88.95      81.45 |     88.93 
-----------+----------------------+----------
         1 | 1,331,048      6,235 | 1,337,283 
           |     11.05      18.55 |     11.07 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,521,024     31,692 |11,552,716 
           |     95.65      94.30 |     95.64 
-----------+----------------------+----------
         1 |   524,398      1,915 |   526,313 
           |      4.35       5.70 |      4.36 
-----------+----------------------+----------
     Total |12,045,422     33,607 |12,079,029 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,299,934      4,942 | 2,304,876 
                 |     19.09      14.71 |     19.08 
-----------------+----------------------+----------
               2 | 2,406,490      5,821 | 2,412,311 
                 |     19.98      17.32 |     19.97 
-----------------+----------------------+----------
               3 | 2,474,749      6,267 | 2,481,016 
                 |     20.55      18.65 |     20.54 
-----------------+----------------------+----------
               4 | 2,555,085      7,826 | 2,562,911 
                 |     21.21      23.29 |     21.22 
-----------------+----------------------+----------
 5 most deprived | 2,309,164      8,751 | 2,317,915 
                 |     19.17      26.04 |     19.19 
-----------------+----------------------+----------
           Total |12,045,422     33,607 |12,079,029 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,567,692     18,168 | 7,585,860 
                      |     62.83      54.06 |     62.80 
----------------------+----------------------+----------
                Mixed |   157,769        523 |   158,292 
                      |      1.31       1.56 |      1.31 
----------------------+----------------------+----------
Asian or Asian Britis |   827,812      6,045 |   833,857 
                      |      6.87      17.99 |      6.90 
----------------------+----------------------+----------
                Black |   304,847      1,388 |   306,235 
                      |      2.53       4.13 |      2.54 
----------------------+----------------------+----------
                Other |   289,655        785 |   290,440 
                      |      2.40       2.34 |      2.40 
----------------------+----------------------+----------
              Unknown | 2,897,647      6,698 | 2,904,345 
                      |     24.06      19.93 |     24.04 
----------------------+----------------------+----------
                Total |12,045,422     33,607 |12,079,029 
                      |    100.00     100.00 |    100.00 
19

**TABLE OF stp covid_tpp_prob REDACTED DUE TO SMALL N**

21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped | outcome: covid death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,853,804         15 | 2,853,819 
           |     23.63       1.05 |     23.63 
-----------+----------------------+----------
    30-<40 | 2,775,636         51 | 2,775,687 
           |     22.98       3.58 |     22.98 
-----------+----------------------+----------
    40-<50 | 2,500,315        179 | 2,500,494 
           |     20.70      12.58 |     20.70 
-----------+----------------------+----------
    50-<60 | 2,627,224        560 | 2,627,784 
           |     21.75      39.35 |     21.75 
-----------+----------------------+----------
    60-<70 | 1,320,627        618 | 1,321,245 
           |     10.93      43.43 |     10.94 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,021,083        485 | 6,021,568 
           |     49.85      34.08 |     49.85 
-----------+----------------------+----------
         1 | 6,056,523        938 | 6,057,461 
           |     50.15      65.92 |     50.15 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     | outcome: covid death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   223,888         27 |   223,915 
                     |      1.85       1.90 |      1.85 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,413,756        226 | 3,413,982 
                     |     28.27      15.88 |     28.26 
---------------------+----------------------+----------
Overweight (25-29.9) | 3,007,228        346 | 3,007,574 
                     |     24.90      24.31 |     24.90 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,543,842        292 | 1,544,134 
                     |     12.78      20.52 |     12.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   635,523        212 |   635,735 
                     |      5.26      14.90 |      5.26 
---------------------+----------------------+----------
     Obese III (40+) |   345,033        141 |   345,174 
                     |      2.86       9.91 |      2.86 
---------------------+----------------------+----------
        Unknown (.u) | 2,908,336        179 | 2,908,515 
                     |     24.08      12.58 |     24.08 
---------------------+----------------------+----------
               Total |12,077,606      1,423 |12,079,029 
                     |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking | outcome: covid death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,739,452        591 | 5,740,043 
             |     47.52      41.53 |     47.52 
-------------+----------------------+----------
      Former | 3,310,579        591 | 3,311,170 
             |     27.41      41.53 |     27.41 
-------------+----------------------+----------
     Current | 2,433,017        233 | 2,433,250 
             |     20.14      16.37 |     20.14 
-------------+----------------------+----------
Unknown (.u) |   594,558          8 |   594,566 
             |      4.92       0.56 |      4.92 
-------------+----------------------+----------
       Total |12,077,606      1,423 |12,079,029 
             |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity | outcome: covid death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,553,208        778 | 9,553,986 
                     |     79.10      54.67 |     79.10 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,543,842        292 | 1,544,134 
                     |     12.78      20.52 |     12.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   635,523        212 |   635,735 
                     |      5.26      14.90 |      5.26 
---------------------+----------------------+----------
     Obese III (40+) |   345,033        141 |   345,174 
                     |      2.86       9.91 |      2.86 
---------------------+----------------------+----------
               Total |12,077,606      1,423 |12,079,029 
                     |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,589,245        800 | 9,590,045 
           |     79.40      56.22 |     79.39 
-----------+----------------------+----------
         1 | 2,488,361        623 | 2,488,984 
           |     20.60      43.78 |     20.61 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator | outcome: covid death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,849,118      1,219 |11,850,337 
           |     98.11      85.66 |     98.11 
-----------+----------------------+----------
         1 |   228,488        204 |   228,692 
           |      1.89      14.34 |      1.89 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma | outcome: covid death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |10,030,762      1,146 |10,031,908 
           |     83.05      80.53 |     83.05 
-----------+----------------------+----------
         1 | 2,046,844        277 | 2,047,121 
           |     16.95      19.47 |     16.95 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac | outcome: covid death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,743,982      1,135 |11,745,117 
           |     97.24      79.76 |     97.24 
-----------+----------------------+----------
         1 |   333,624        288 |   333,912 
           |      2.76      20.24 |      2.76 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   | outcome: covid death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |11,330,983        857 |11,331,840 
                   |     95.27      63.62 |     95.26 
-------------------+----------------------+----------
  T1DM, controlled |    16,434          7 |    16,441 
                   |      0.14       0.52 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    49,237         23 |    49,260 
                   |      0.41       1.71 |      0.41 
-------------------+----------------------+----------
  T2DM, controlled |   274,797        203 |   275,000 
                   |      2.31      15.07 |      2.31 
-------------------+----------------------+----------
T2DM, uncontrolled |   216,817        251 |   217,068 
                   |      1.82      18.63 |      1.82 
-------------------+----------------------+----------
Diabetes, no HbA1c |     5,504          6 |     5,510 
                   |      0.05       0.45 |      0.05 
-------------------+----------------------+----------
             Total |11,893,772      1,347 |11,895,119 
                   |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo | outcome: covid death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,820,721      1,278 |11,821,999 
              |     97.87      89.81 |     97.87 
--------------+----------------------+----------
    Last year |    28,553         36 |    28,589 
              |      0.24       2.53 |      0.24 
--------------+----------------------+----------
2-5 years ago |    82,306         57 |    82,363 
              |      0.68       4.01 |      0.68 
--------------+----------------------+----------
     5+ years |   146,026         52 |   146,078 
              |      1.21       3.65 |      1.21 
--------------+----------------------+----------
        Total |12,077,606      1,423 |12,079,029 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica | outcome: covid death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,039,823      1,382 |12,041,205 
              |     99.69      97.12 |     99.69 
--------------+----------------------+----------
    Last year |     3,053          7 |     3,060 
              |      0.03       0.49 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,496         19 |     9,515 
              |      0.08       1.34 |      0.08 
--------------+----------------------+----------
     5+ years |    25,234         15 |    25,249 
              |      0.21       1.05 |      0.21 
--------------+----------------------+----------
        Total |12,077,606      1,423 |12,079,029 
              |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on | outcome: covid death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |12,038,422      1,397 |12,039,819 
           |     99.68      98.17 |     99.68 
-----------+----------------------+----------
         1 |    39,184         26 |    39,210 
           |      0.32       1.83 |      0.32 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
29

**TABLE OF other_transplant covid_death REDACTED DUE TO SMALL N**

21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,063,746      1,416 |12,065,162 
           |     99.89      99.51 |     99.89 
-----------+----------------------+----------
         1 |    13,860          7 |    13,867 
           |      0.11       0.49 |      0.11 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,014,779      1,347 |12,016,126 
           |     99.48      94.66 |     99.48 
-----------+----------------------+----------
         1 |    62,827         76 |    62,903 
           |      0.52       5.34 |      0.52 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic | outcome: covid death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,995,448      1,342 |11,996,790 
           |     99.32      94.31 |     99.32 
-----------+----------------------+----------
         1 |    82,158         81 |    82,239 
           |      0.68       5.69 |      0.68 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or | outcome: covid death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,986,497      1,316 |11,987,813 
           |     99.25      92.48 |     99.24 
-----------+----------------------+----------
         1 |    91,109        107 |    91,216 
           |      0.75       7.52 |      0.76 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Calculated | outcome: covid death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,939         40 |     4,979 
           |      0.06       3.01 |      0.06 
-----------+----------------------+----------
        15 |     6,884         42 |     6,926 
           |      0.08       3.16 |      0.08 
-----------+----------------------+----------
        30 |    16,682         52 |    16,734 
           |      0.20       3.91 |      0.20 
-----------+----------------------+----------
        45 |   104,955         92 |   105,047 
           |      1.27       6.92 |      1.27 
-----------+----------------------+----------
        60 | 8,137,079      1,103 | 8,138,182 
           |     98.39      82.99 |     98.38 
-----------+----------------------+----------
     Total | 8,270,539      1,329 | 8,271,868 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 End-stage |     indicator for
     renal | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,063,390      1,363 |12,064,753 
           |     99.88      95.78 |     99.88 
-----------+----------------------+----------
         1 |    14,216         60 |    14,276 
           |      0.12       4.22 |      0.12 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney | outcome: covid death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,944,146      1,197 |11,945,343 
                      |     98.89      84.12 |     98.89 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   121,637        144 |   121,781 
                      |      1.01      10.12 |      1.01 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,823         82 |    11,905 
                      |      0.10       5.76 |      0.10 
----------------------+----------------------+----------
                Total |12,077,606      1,423 |12,079,029 
                      |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi | outcome: covid death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,740,985        761 |10,741,746 
           |     88.93      53.48 |     88.93 
-----------+----------------------+----------
         1 | 1,336,621        662 | 1,337,283 
           |     11.07      46.52 |     11.07 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,551,412      1,304 |11,552,716 
           |     95.64      91.64 |     95.64 
-----------+----------------------+----------
         1 |   526,194        119 |   526,313 
           |      4.36       8.36 |      4.36 
-----------+----------------------+----------
     Total |12,077,606      1,423 |12,079,029 
           |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation | outcome: covid death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,304,708        168 | 2,304,876 
                 |     19.08      11.81 |     19.08 
-----------------+----------------------+----------
               2 | 2,412,097        214 | 2,412,311 
                 |     19.97      15.04 |     19.97 
-----------------+----------------------+----------
               3 | 2,480,763        253 | 2,481,016 
                 |     20.54      17.78 |     20.54 
-----------------+----------------------+----------
               4 | 2,562,519        392 | 2,562,911 
                 |     21.22      27.55 |     21.22 
-----------------+----------------------+----------
 5 most deprived | 2,317,519        396 | 2,317,915 
                 |     19.19      27.83 |     19.19 
-----------------+----------------------+----------
           Total |12,077,606      1,423 |12,079,029 
                 |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      | outcome: covid death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,585,084        776 | 7,585,860 
                      |     62.80      54.53 |     62.80 
----------------------+----------------------+----------
                Mixed |   158,265         27 |   158,292 
                      |      1.31       1.90 |      1.31 
----------------------+----------------------+----------
Asian or Asian Britis |   833,653        204 |   833,857 
                      |      6.90      14.34 |      6.90 
----------------------+----------------------+----------
                Black |   306,135        100 |   306,235 
                      |      2.53       7.03 |      2.54 
----------------------+----------------------+----------
                Other |   290,401         39 |   290,440 
                      |      2.40       2.74 |      2.40 
----------------------+----------------------+----------
              Unknown | 2,904,068        277 | 2,904,345 
                      |     24.05      19.47 |     24.04 
----------------------+----------------------+----------
                Total |12,077,606      1,423 |12,079,029 
                      |    100.00     100.00 |    100.00 
16

**TABLE OF stp covid_death REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 | 2,853,653        166 | 2,853,819 
           |     23.64       1.77 |     23.63 
-----------+----------------------+----------
    30-<40 | 2,775,266        421 | 2,775,687 
           |     22.99       4.49 |     22.98 
-----------+----------------------+----------
    40-<50 | 2,499,178      1,316 | 2,500,494 
           |     20.71      14.02 |     20.70 
-----------+----------------------+----------
    50-<60 | 2,624,175      3,609 | 2,627,784 
           |     21.74      38.45 |     21.75 
-----------+----------------------+----------
    60-<70 | 1,317,371      3,874 | 1,321,245 
           |     10.91      41.27 |     10.94 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 6,017,651      3,917 | 6,021,568 
           |     49.86      41.73 |     49.85 
-----------+----------------------+----------
         1 | 6,051,992      5,469 | 6,057,461 
           |     50.14      58.27 |     50.15 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |   223,426        489 |   223,915 
                     |      1.85       5.21 |      1.85 
---------------------+----------------------+----------
  Normal (18.5-24.9) | 3,411,326      2,656 | 3,413,982 
                     |     28.26      28.30 |     28.26 
---------------------+----------------------+----------
Overweight (25-29.9) | 3,005,313      2,261 | 3,007,574 
                     |     24.90      24.09 |     24.90 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,542,728      1,406 | 1,544,134 
                     |     12.78      14.98 |     12.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   635,049        686 |   635,735 
                     |      5.26       7.31 |      5.26 
---------------------+----------------------+----------
     Obese III (40+) |   344,654        520 |   345,174 
                     |      2.86       5.54 |      2.86 
---------------------+----------------------+----------
        Unknown (.u) | 2,907,147      1,368 | 2,908,515 
                     |     24.09      14.57 |     24.08 
---------------------+----------------------+----------
               Total |12,069,643      9,386 |12,079,029 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 5,737,447      2,596 | 5,740,043 
             |     47.54      27.66 |     47.52 
-------------+----------------------+----------
      Former | 3,307,870      3,300 | 3,311,170 
             |     27.41      35.16 |     27.41 
-------------+----------------------+----------
     Current | 2,429,858      3,392 | 2,433,250 
             |     20.13      36.14 |     20.14 
-------------+----------------------+----------
Unknown (.u) |   594,468         98 |   594,566 
             |      4.93       1.04 |      4.92 
-------------+----------------------+----------
       Total |12,069,643      9,386 |12,079,029 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 9,547,212      6,774 | 9,553,986 
                     |     79.10      72.17 |     79.10 
---------------------+----------------------+----------
   Obese I (30-34.9) | 1,542,728      1,406 | 1,544,134 
                     |     12.78      14.98 |     12.78 
---------------------+----------------------+----------
  Obese II (35-39.9) |   635,049        686 |   635,735 
                     |      5.26       7.31 |      5.26 
---------------------+----------------------+----------
     Obese III (40+) |   344,654        520 |   345,174 
                     |      2.86       5.54 |      2.86 
---------------------+----------------------+----------
               Total |12,069,643      9,386 |12,079,029 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 9,586,773      3,272 | 9,590,045 
           |     79.43      34.86 |     79.39 
-----------+----------------------+----------
         1 | 2,482,870      6,114 | 2,488,984 
           |     20.57      65.14 |     20.61 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,842,559      7,778 |11,850,337 
           |     98.12      82.87 |     98.11 
-----------+----------------------+----------
         1 |   227,084      1,608 |   228,692 
           |      1.88      17.13 |      1.89 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |10,024,154      7,754 |10,031,908 
           |     83.05      82.61 |     83.05 
-----------+----------------------+----------
         1 | 2,045,489      1,632 | 2,047,121 
           |     16.95      17.39 |     16.95 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |11,737,414      7,703 |11,745,117 
           |     97.25      82.07 |     97.24 
-----------+----------------------+----------
         1 |   332,229      1,683 |   333,912 
           |      2.75      17.93 |      2.76 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: non-covid
                   |         death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |11,324,647      7,193 |11,331,840 
                   |     95.28      78.76 |     95.26 
-------------------+----------------------+----------
  T1DM, controlled |    16,381         60 |    16,441 
                   |      0.14       0.66 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |    49,098        162 |    49,260 
                   |      0.41       1.77 |      0.41 
-------------------+----------------------+----------
  T2DM, controlled |   274,119        881 |   275,000 
                   |      2.31       9.65 |      2.31 
-------------------+----------------------+----------
T2DM, uncontrolled |   216,254        814 |   217,068 
                   |      1.82       8.91 |      1.82 
-------------------+----------------------+----------
Diabetes, no HbA1c |     5,487         23 |     5,510 
                   |      0.05       0.25 |      0.05 
-------------------+----------------------+----------
             Total |11,885,986      9,133 |11,895,119 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |11,816,029      5,970 |11,821,999 
              |     97.90      63.61 |     97.87 
--------------+----------------------+----------
    Last year |    27,288      1,301 |    28,589 
              |      0.23      13.86 |      0.24 
--------------+----------------------+----------
2-5 years ago |    80,992      1,371 |    82,363 
              |      0.67      14.61 |      0.68 
--------------+----------------------+----------
     5+ years |   145,334        744 |   146,078 
              |      1.20       7.93 |      1.21 
--------------+----------------------+----------
        Total |12,069,643      9,386 |12,079,029 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |12,032,115      9,090 |12,041,205 
              |     99.69      96.85 |     99.69 
--------------+----------------------+----------
    Last year |     2,982         78 |     3,060 
              |      0.02       0.83 |      0.03 
--------------+----------------------+----------
2-5 years ago |     9,404        111 |     9,515 
              |      0.08       1.18 |      0.08 
--------------+----------------------+----------
     5+ years |    25,142        107 |    25,249 
              |      0.21       1.14 |      0.21 
--------------+----------------------+----------
        Total |12,069,643      9,386 |12,079,029 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |12,030,559      9,260 |12,039,819 
           |     99.68      98.66 |     99.68 
-----------+----------------------+----------
         1 |    39,084        126 |    39,210 
           |      0.32       1.34 |      0.32 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |12,066,850      9,354 |12,076,204 
           |     99.98      99.66 |     99.98 
-----------+----------------------+----------
         1 |     2,793         32 |     2,825 
           |      0.02       0.34 |      0.02 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |12,055,859      9,303 |12,065,162 
           |     99.89      99.12 |     99.89 
-----------+----------------------+----------
         1 |    13,784         83 |    13,867 
           |      0.11       0.88 |      0.11 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,007,635      8,491 |12,016,126 
           |     99.49      90.46 |     99.48 
-----------+----------------------+----------
         1 |    62,008        895 |    62,903 
           |      0.51       9.54 |      0.52 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,987,774      9,016 |11,996,790 
           |     99.32      96.06 |     99.32 
-----------+----------------------+----------
         1 |    81,869        370 |    82,239 
           |      0.68       3.94 |      0.68 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |11,979,090      8,723 |11,987,813 
           |     99.25      92.94 |     99.24 
-----------+----------------------+----------
         1 |    90,553        663 |    91,216 
           |      0.75       7.06 |      0.76 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,822        157 |     4,979 
           |      0.06       1.83 |      0.06 
-----------+----------------------+----------
        15 |     6,769        157 |     6,926 
           |      0.08       1.83 |      0.08 
-----------+----------------------+----------
        30 |    16,516        218 |    16,734 
           |      0.20       2.54 |      0.20 
-----------+----------------------+----------
        45 |   104,607        440 |   105,047 
           |      1.27       5.13 |      1.27 
-----------+----------------------+----------
        60 | 8,130,581      7,601 | 8,138,182 
           |     98.39      88.66 |     98.38 
-----------+----------------------+----------
     Total | 8,263,295      8,573 | 8,271,868 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |12,055,575      9,178 |12,064,753 
           |     99.88      97.78 |     99.88 
-----------+----------------------+----------
         1 |    14,068        208 |    14,276 
           |      0.12       2.22 |      0.12 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |11,936,929      8,414 |11,945,343 
                      |     98.90      89.64 |     98.89 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   121,123        658 |   121,781 
                      |      1.00       7.01 |      1.01 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    11,591        314 |    11,905 
                      |      0.10       3.35 |      0.10 
----------------------+----------------------+----------
                Total |12,069,643      9,386 |12,079,029 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |10,735,587      6,159 |10,741,746 
           |     88.95      65.62 |     88.93 
-----------+----------------------+----------
         1 | 1,334,056      3,227 | 1,337,283 
           |     11.05      34.38 |     11.07 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |11,544,045      8,671 |11,552,716 
           |     95.65      92.38 |     95.64 
-----------+----------------------+----------
         1 |   525,598        715 |   526,313 
           |      4.35       7.62 |      4.36 
-----------+----------------------+----------
     Total |12,069,643      9,386 |12,079,029 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived | 2,303,555      1,321 | 2,304,876 
                 |     19.09      14.07 |     19.08 
-----------------+----------------------+----------
               2 | 2,410,775      1,536 | 2,412,311 
                 |     19.97      16.36 |     19.97 
-----------------+----------------------+----------
               3 | 2,479,213      1,803 | 2,481,016 
                 |     20.54      19.21 |     20.54 
-----------------+----------------------+----------
               4 | 2,560,805      2,106 | 2,562,911 
                 |     21.22      22.44 |     21.22 
-----------------+----------------------+----------
 5 most deprived | 2,315,295      2,620 | 2,317,915 
                 |     19.18      27.91 |     19.19 
-----------------+----------------------+----------
           Total |12,069,643      9,386 |12,079,029 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 7,579,446      6,414 | 7,585,860 
                      |     62.80      68.34 |     62.80 
----------------------+----------------------+----------
                Mixed |   158,237         55 |   158,292 
                      |      1.31       0.59 |      1.31 
----------------------+----------------------+----------
Asian or Asian Britis |   833,507        350 |   833,857 
                      |      6.91       3.73 |      6.90 
----------------------+----------------------+----------
                Black |   306,040        195 |   306,235 
                      |      2.54       2.08 |      2.54 
----------------------+----------------------+----------
                Other |   290,370         70 |   290,440 
                      |      2.41       0.75 |      2.40 
----------------------+----------------------+----------
              Unknown | 2,902,043      2,302 | 2,904,345 
                      |     24.04      24.53 |     24.04 
----------------------+----------------------+----------
                Total |12,069,643      9,386 |12,079,029 
                      |    100.00     100.00 |    100.00 
20

**TABLE OF stp non_covid_death REDACTED DUE TO SMALL N**


         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
REDACTED
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06       22              0.0000    0.0000     0.0000    0.0000
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06       67              0.0000    0.0000     0.0000    0.0001
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      109              0.0001    0.0000     0.0001    0.0001
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      126              0.0001    0.0000     0.0001    0.0001
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06      314              0.0003    0.0000     0.0002    0.0003
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06      389              0.0003    0.0000     0.0003    0.0003
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06      811              0.0006    0.0000     0.0006    0.0007
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     1137              0.0009    0.0000     0.0008    0.0009
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    665331      819              0.0012    0.0000     0.0011    0.0013
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    653543     1220              0.0019    0.0001     0.0018    0.0020
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      982              0.0007    0.0000     0.0006    0.0007
18-<30 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      469              0.0003    0.0000     0.0003    0.0004
30-<40 male=0 
       0         0        0              0.0000         .          .         .
      80   1.4e+06     1456              0.0011    0.0000     0.0010    0.0011
30-<40 male=1 
       0         0        0              0.0000         .          .         .
      80   1.4e+06      872              0.0006    0.0000     0.0006    0.0007
40-<50 male=0 
       0         0        0              0.0000         .          .         .
      80   1.2e+06     1760              0.0014    0.0000     0.0014    0.0015
40-<50 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     1214              0.0010    0.0000     0.0009    0.0010
50-<60 male=0 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     2246              0.0017    0.0000     0.0017    0.0018
50-<60 male=1 
       0         0        0              0.0000         .          .         .
      80   1.3e+06     1966              0.0015    0.0000     0.0014    0.0016
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    662663      982              0.0015    0.0000     0.0014    0.0016
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    650361     1112              0.0017    0.0001     0.0016    0.0018
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |  3,469,712    75.49242    7.056946         66        110
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |    796,797       22.96       22.96
     70-<80 |  1,724,416       49.70       72.66
        80+ |    948,499       27.34      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    205,305        5.92        5.92
          1 |  3,264,407       94.08      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,859,697       53.60       53.60
          1 |  1,610,015       46.40      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     57,563        1.82        1.82
  Normal (18.5-24.9) |    981,169       31.07       32.89
Overweight (25-29.9) |  1,234,186       39.08       71.97
   Obese I (30-34.9) |    607,885       19.25       91.21
  Obese II (35-39.9) |    199,972        6.33       97.54
     Obese III (40+) |     77,544        2.46      100.00
---------------------+-----------------------------------
               Total |  3,158,319      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     57,563        1.66        1.66
  Normal (18.5-24.9) |    981,169       28.28       29.94
Overweight (25-29.9) |  1,234,186       35.57       65.51
   Obese I (30-34.9) |    607,885       17.52       83.03
  Obese II (35-39.9) |    199,972        5.76       88.79
     Obese III (40+) |     77,544        2.23       91.03
        Unknown (.u) |    311,393        8.97      100.00
---------------------+-----------------------------------
               Total |  3,469,712      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |  2,584,311       74.48       74.48
   Obese I (30-34.9) |    607,885       17.52       92.00
  Obese II (35-39.9) |    199,972        5.76       97.77
     Obese III (40+) |     77,544        2.23      100.00
---------------------+-----------------------------------
               Total |  3,469,712      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,383,513       40.12       40.12
      Former |  1,778,168       51.56       91.68
     Current |    286,865        8.32      100.00
-------------+-----------------------------------
       Total |  3,448,546      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |  1,383,513       39.87       39.87
      Former |  1,778,168       51.25       91.12
     Current |    286,865        8.27       99.39
Unknown (.u) |     21,166        0.61      100.00
-------------+-----------------------------------
       Total |  3,469,712      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    390,053       11.34       11.34
      Elevated |    529,449       15.39       26.72
 High, stage I |  1,265,248       36.77       63.49
High, stage II |  1,256,168       36.51      100.00
---------------+-----------------------------------
         Total |  3,440,918      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |    390,053       11.24       11.24
      Elevated |    529,449       15.26       26.50
 High, stage I |  1,265,248       36.47       62.97
High, stage II |  1,256,168       36.20       99.17
       Unknown |     28,794        0.83      100.00
---------------+-----------------------------------
         Total |  3,469,712      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,051,897       30.32       30.32
          1 |  2,417,815       69.68      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,278,350       65.66       65.66
          1 |  1,191,362       34.34      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,060,342       88.20       88.20
          1 |    409,370       11.80      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,019,907       87.04       87.04
          1 |    449,805       12.96      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  2,750,333       79.27       79.27
          1 |    719,379       20.73      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |  2,693,245       81.36       81.36
  T1DM, controlled |      4,528        0.14       81.49
T1DM, uncontrolled |      9,314        0.28       81.77
  T2DM, controlled |    413,866       12.50       94.27
T2DM, uncontrolled |    187,048        5.65       99.92
Diabetes, no HbA1c |      2,483        0.08      100.00
-------------------+-----------------------------------
             Total |  3,310,484      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  2,974,814       85.74       85.74
    Last year |     41,353        1.19       86.93
2-5 years ago |    123,325        3.55       90.48
     5+ years |    330,220        9.52      100.00
--------------+-----------------------------------
        Total |  3,469,712      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |  3,418,696       98.53       98.53
    Last year |      4,899        0.14       98.67
2-5 years ago |     15,248        0.44       99.11
     5+ years |     30,869        0.89      100.00
--------------+-----------------------------------
        Total |  3,469,712      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,462,975       99.81       99.81
          1 |      6,737        0.19      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,468,595       99.97       99.97
          1 |      1,117        0.03      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,461,177       99.75       99.75
          1 |      8,535        0.25      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,437,995       99.09       99.09
          1 |     31,717        0.91      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,402,690       98.07       98.07
          1 |     67,022        1.93      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,217,794       92.74       92.74
          1 |    251,918        7.26      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,997        0.24        0.24
         15 |     46,390        1.41        1.66
         30 |    200,389        6.11        7.77
         45 |    547,046       16.68       24.45
         60 |  2,478,081       75.55      100.00
------------+-----------------------------------
      Total |  3,279,903      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |  2,667,890       76.89       76.89
Stage 3a/3b egfr 30-60       |    747,435       21.54       98.43
           Stage 4/5 egfr<30 |     54,387        1.57      100.00
-----------------------------+-----------------------------------
                       Total |  3,469,712      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,461,196       99.75       99.75
          1 |      8,516        0.25      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,543,599       44.49       44.49
          1 |  1,926,113       55.51      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,206,007       92.40       92.40
          1 |    263,705        7.60      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    870,006       25.07       25.07
               2 |    819,958       23.63       48.71
               3 |    745,010       21.47       70.18
               4 |    604,978       17.44       87.61
 5 most deprived |    429,760       12.39      100.00
-----------------+-----------------------------------
           Total |  3,469,712      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |    870,006       25.07       25.07
               2 |    819,958       23.63       48.71
               3 |    745,010       21.47       70.18
               4 |    604,978       17.44       87.61
 5 most deprived |    429,760       12.39      100.00
-----------------+-----------------------------------
           Total |  3,469,712      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,404,539       94.19       94.19
                 Mixed |      9,726        0.38       94.57
Asian or Asian British |     90,144        3.53       98.10
                 Black |     27,193        1.07       99.17
                 Other |     21,248        0.83      100.00
-----------------------+-----------------------------------
                 Total |  2,552,850      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |  2,404,539       69.30       69.30
                 Mixed |      9,726        0.28       69.58
Asian or Asian British |     90,144        2.60       72.18
                 Black |     27,193        0.78       72.96
                 Other |     21,248        0.61       73.58
               Unknown |    916,862       26.42      100.00
-----------------------+-----------------------------------
                 Total |  3,469,712      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        324        0.01        0.01
          2 |    287,625        8.29        8.30
          3 |    155,834        4.49       12.79
          4 |     34,216        0.99       13.78
          5 |     23,717        0.68       14.46
          6 |    161,896        4.67       19.13
          7 |      9,369        0.27       19.40
          8 |    136,625        3.94       23.33
          9 |    128,513        3.70       27.04
         10 |    141,492        4.08       31.12
         11 |    142,491        4.11       35.22
         12 |     38,745        1.12       36.34
         13 |     67,256        1.94       38.28
         14 |     84,800        2.44       40.72
         15 |    111,517        3.21       43.94
         16 |    165,454        4.77       48.70
         17 |    123,175        3.55       52.25
         18 |    125,193        3.61       55.86
         19 |    109,847        3.17       59.03
         20 |    179,989        5.19       64.22
         21 |    134,341        3.87       68.09
         22 |      9,432        0.27       68.36
         23 |    150,789        4.35       72.70
         24 |      8,124        0.23       72.94
         25 |     43,066        1.24       74.18
         26 |    151,741        4.37       78.55
         27 |    146,914        4.23       82.79
         28 |    150,243        4.33       87.12
         29 |     97,557        2.81       89.93
         30 |     76,668        2.21       92.14
         31 |      4,910        0.14       92.28
         32 |    267,849        7.72      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,423,434       98.67       98.67
          1 |     46,278        1.33      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,461,956       99.78       99.78
          1 |      7,756        0.22      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  3,455,607       99.59       99.59
          1 |     14,105        0.41      100.00
------------+-----------------------------------
      Total |  3,469,712      100.00
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   794,585      2,212 |   796,797 
           |     22.99      15.68 |     22.96 
-----------+----------------------+----------
    70-<80 | 1,718,747      5,669 | 1,724,416 
           |     49.74      40.19 |     49.70 
-----------+----------------------+----------
       80+ |   942,275      6,224 |   948,499 
           |     27.27      44.13 |     27.34 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,852,891      6,806 | 1,859,697 
           |     53.62      48.25 |     53.60 
-----------+----------------------+----------
         1 | 1,602,716      7,299 | 1,610,015 
           |     46.38      51.75 |     46.40 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    57,099        464 |    57,563 
                     |      1.65       3.29 |      1.66 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   977,279      3,890 |   981,169 
                     |     28.28      27.58 |     28.28 
---------------------+----------------------+----------
Overweight (25-29.9) | 1,229,563      4,623 | 1,234,186 
                     |     35.58      32.78 |     35.57 
---------------------+----------------------+----------
   Obese I (30-34.9) |   605,164      2,721 |   607,885 
                     |     17.51      19.29 |     17.52 
---------------------+----------------------+----------
  Obese II (35-39.9) |   198,941      1,031 |   199,972 
                     |      5.76       7.31 |      5.76 
---------------------+----------------------+----------
     Obese III (40+) |    77,041        503 |    77,544 
                     |      2.23       3.57 |      2.23 
---------------------+----------------------+----------
        Unknown (.u) |   310,520        873 |   311,393 
                     |      8.99       6.19 |      8.97 
---------------------+----------------------+----------
               Total | 3,455,607     14,105 | 3,469,712 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,378,915      4,598 | 1,383,513 
             |     39.90      32.60 |     39.87 
-------------+----------------------+----------
      Former | 1,769,728      8,440 | 1,778,168 
             |     51.21      59.84 |     51.25 
-------------+----------------------+----------
     Current |   285,841      1,024 |   286,865 
             |      8.27       7.26 |      8.27 
-------------+----------------------+----------
Unknown (.u) |    21,123         43 |    21,166 
             |      0.61       0.30 |      0.61 
-------------+----------------------+----------
       Total | 3,455,607     14,105 | 3,469,712 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 2,574,461      9,850 | 2,584,311 
                     |     74.50      69.83 |     74.48 
---------------------+----------------------+----------
   Obese I (30-34.9) |   605,164      2,721 |   607,885 
                     |     17.51      19.29 |     17.52 
---------------------+----------------------+----------
  Obese II (35-39.9) |   198,941      1,031 |   199,972 
                     |      5.76       7.31 |      5.76 
---------------------+----------------------+----------
     Obese III (40+) |    77,041        503 |    77,544 
                     |      2.23       3.57 |      2.23 
---------------------+----------------------+----------
               Total | 3,455,607     14,105 | 3,469,712 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,271,696      6,654 | 2,278,350 
           |     65.74      47.17 |     65.66 
-----------+----------------------+----------
         1 | 1,183,911      7,451 | 1,191,362 
           |     34.26      52.83 |     34.34 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,049,813     10,529 | 3,060,342 
           |     88.26      74.65 |     88.20 
-----------+----------------------+----------
         1 |   405,794      3,576 |   409,370 
           |     11.74      25.35 |     11.80 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,008,311     11,596 | 3,019,907 
           |     87.06      82.21 |     87.04 
-----------+----------------------+----------
         1 |   447,296      2,509 |   449,805 
           |     12.94      17.79 |     12.96 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,741,431      8,902 | 2,750,333 
           |     79.33      63.11 |     79.27 
-----------+----------------------+----------
         1 |   714,176      5,203 |   719,379 
           |     20.67      36.89 |     20.73 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: covid prob
                   |         case
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,684,306      8,939 | 2,693,245 
                   |     81.41      67.06 |     81.36 
-------------------+----------------------+----------
  T1DM, controlled |     4,494         34 |     4,528 
                   |      0.14       0.26 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |     9,224         90 |     9,314 
                   |      0.28       0.68 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   411,122      2,744 |   413,866 
                   |     12.47      20.59 |     12.50 
-------------------+----------------------+----------
T2DM, uncontrolled |   185,549      1,499 |   187,048 
                   |      5.63      11.25 |      5.65 
-------------------+----------------------+----------
Diabetes, no HbA1c |     2,460         23 |     2,483 
                   |      0.07       0.17 |      0.08 
-------------------+----------------------+----------
             Total | 3,297,155     13,329 | 3,310,484 
                   |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,963,357     11,457 | 2,974,814 
              |     85.76      81.23 |     85.74 
--------------+----------------------+----------
    Last year |    41,047        306 |    41,353 
              |      1.19       2.17 |      1.19 
--------------+----------------------+----------
2-5 years ago |   122,666        659 |   123,325 
              |      3.55       4.67 |      3.55 
--------------+----------------------+----------
     5+ years |   328,537      1,683 |   330,220 
              |      9.51      11.93 |      9.52 
--------------+----------------------+----------
        Total | 3,455,607     14,105 | 3,469,712 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 3,405,074     13,622 | 3,418,696 
              |     98.54      96.58 |     98.53 
--------------+----------------------+----------
    Last year |     4,823         76 |     4,899 
              |      0.14       0.54 |      0.14 
--------------+----------------------+----------
2-5 years ago |    15,096        152 |    15,248 
              |      0.44       1.08 |      0.44 
--------------+----------------------+----------
     5+ years |    30,614        255 |    30,869 
              |      0.89       1.81 |      0.89 
--------------+----------------------+----------
        Total | 3,455,607     14,105 | 3,469,712 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,448,931     14,044 | 3,462,975 
           |     99.81      99.57 |     99.81 
-----------+----------------------+----------
         1 |     6,676         61 |     6,737 
           |      0.19       0.43 |      0.19 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,454,505     14,090 | 3,468,595 
           |     99.97      99.89 |     99.97 
-----------+----------------------+----------
         1 |     1,102         15 |     1,117 
           |      0.03       0.11 |      0.03 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,447,130     14,047 | 3,461,177 
           |     99.75      99.59 |     99.75 
-----------+----------------------+----------
         1 |     8,477         58 |     8,535 
           |      0.25       0.41 |      0.25 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,424,141     13,854 | 3,437,995 
           |     99.09      98.22 |     99.09 
-----------+----------------------+----------
         1 |    31,466        251 |    31,717 
           |      0.91       1.78 |      0.91 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,389,214     13,476 | 3,402,690 
           |     98.08      95.54 |     98.07 
-----------+----------------------+----------
         1 |    66,393        629 |    67,022 
           |      1.92       4.46 |      1.93 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,205,942     11,852 | 3,217,794 
           |     92.78      84.03 |     92.74 
-----------+----------------------+----------
         1 |   249,665      2,253 |   251,918 
           |      7.22      15.97 |      7.26 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,760        237 |     7,997 
           |      0.24       1.73 |      0.24 
-----------+----------------------+----------
        15 |    45,838        552 |    46,390 
           |      1.40       4.03 |      1.41 
-----------+----------------------+----------
        30 |   198,768      1,621 |   200,389 
           |      6.09      11.85 |      6.11 
-----------+----------------------+----------
        45 |   544,247      2,799 |   547,046 
           |     16.66      20.45 |     16.68 
-----------+----------------------+----------
        60 | 2,469,605      8,476 | 2,478,081 
           |     75.61      61.94 |     75.55 
-----------+----------------------+----------
     Total | 3,266,218     13,685 | 3,279,903 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,447,334     13,862 | 3,461,196 
           |     99.76      98.28 |     99.75 
-----------+----------------------+----------
         1 |     8,273        243 |     8,516 
           |      0.24       1.72 |      0.25 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,658,994      8,896 | 2,667,890 
                      |     76.95      63.07 |     76.89 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   743,015      4,420 |   747,435 
                      |     21.50      31.34 |     21.54 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    53,598        789 |    54,387 
                      |      1.55       5.59 |      1.57 
----------------------+----------------------+----------
                Total | 3,455,607     14,105 | 3,469,712 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,538,972      4,627 | 1,543,599 
           |     44.54      32.80 |     44.49 
-----------+----------------------+----------
         1 | 1,916,635      9,478 | 1,926,113 
           |     55.46      67.20 |     55.51 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,193,444     12,563 | 3,206,007 
           |     92.41      89.07 |     92.40 
-----------+----------------------+----------
         1 |   262,163      1,542 |   263,705 
           |      7.59      10.93 |      7.60 
-----------+----------------------+----------
     Total | 3,455,607     14,105 | 3,469,712 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   867,287      2,719 |   870,006 
                 |     25.10      19.28 |     25.07 
-----------------+----------------------+----------
               2 |   817,026      2,932 |   819,958 
                 |     23.64      20.79 |     23.63 
-----------------+----------------------+----------
               3 |   742,148      2,862 |   745,010 
                 |     21.48      20.29 |     21.47 
-----------------+----------------------+----------
               4 |   601,971      3,007 |   604,978 
                 |     17.42      21.32 |     17.44 
-----------------+----------------------+----------
 5 most deprived |   427,175      2,585 |   429,760 
                 |     12.36      18.33 |     12.39 
-----------------+----------------------+----------
           Total | 3,455,607     14,105 | 3,469,712 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,395,180      9,359 | 2,404,539 
                      |     69.31      66.35 |     69.30 
----------------------+----------------------+----------
                Mixed |     9,673         53 |     9,726 
                      |      0.28       0.38 |      0.28 
----------------------+----------------------+----------
Asian or Asian Britis |    89,388        756 |    90,144 
                      |      2.59       5.36 |      2.60 
----------------------+----------------------+----------
                Black |    26,980        213 |    27,193 
                      |      0.78       1.51 |      0.78 
----------------------+----------------------+----------
                Other |    21,142        106 |    21,248 
                      |      0.61       0.75 |      0.61 
----------------------+----------------------+----------
              Unknown |   913,244      3,618 |   916,862 
                      |     26.43      25.65 |     26.42 
----------------------+----------------------+----------
                Total | 3,455,607     14,105 | 3,469,712 
                      |    100.00     100.00 |    100.00 
19

**TABLE OF stp covid_tpp_prob REDACTED DUE TO SMALL N**

21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped | outcome: covid death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   796,233        564 |   796,797 
           |     23.00       7.27 |     22.96 
-----------+----------------------+----------
    70-<80 | 1,722,039      2,377 | 1,724,416 
           |     49.74      30.65 |     49.70 
-----------+----------------------+----------
       80+ |   943,684      4,815 |   948,499 
           |     27.26      62.08 |     27.34 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,856,576      3,121 | 1,859,697 
           |     53.63      40.24 |     53.60 
-----------+----------------------+----------
         1 | 1,605,380      4,635 | 1,610,015 
           |     46.37      59.76 |     46.40 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     | outcome: covid death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    57,282        281 |    57,563 
                     |      1.65       3.62 |      1.66 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   978,889      2,280 |   981,169 
                     |     28.28      29.40 |     28.28 
---------------------+----------------------+----------
Overweight (25-29.9) | 1,231,881      2,305 | 1,234,186 
                     |     35.58      29.72 |     35.57 
---------------------+----------------------+----------
   Obese I (30-34.9) |   606,488      1,397 |   607,885 
                     |     17.52      18.01 |     17.52 
---------------------+----------------------+----------
  Obese II (35-39.9) |   199,406        566 |   199,972 
                     |      5.76       7.30 |      5.76 
---------------------+----------------------+----------
     Obese III (40+) |    77,277        267 |    77,544 
                     |      2.23       3.44 |      2.23 
---------------------+----------------------+----------
        Unknown (.u) |   310,733        660 |   311,393 
                     |      8.98       8.51 |      8.97 
---------------------+----------------------+----------
               Total | 3,461,956      7,756 | 3,469,712 
                     |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking | outcome: covid death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,381,225      2,288 | 1,383,513 
             |     39.90      29.50 |     39.87 
-------------+----------------------+----------
      Former | 1,773,243      4,925 | 1,778,168 
             |     51.22      63.50 |     51.25 
-------------+----------------------+----------
     Current |   286,355        510 |   286,865 
             |      8.27       6.58 |      8.27 
-------------+----------------------+----------
Unknown (.u) |    21,133         33 |    21,166 
             |      0.61       0.43 |      0.61 
-------------+----------------------+----------
       Total | 3,461,956      7,756 | 3,469,712 
             |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity | outcome: covid death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 2,578,785      5,526 | 2,584,311 
                     |     74.49      71.25 |     74.48 
---------------------+----------------------+----------
   Obese I (30-34.9) |   606,488      1,397 |   607,885 
                     |     17.52      18.01 |     17.52 
---------------------+----------------------+----------
  Obese II (35-39.9) |   199,406        566 |   199,972 
                     |      5.76       7.30 |      5.76 
---------------------+----------------------+----------
     Obese III (40+) |    77,277        267 |    77,544 
                     |      2.23       3.44 |      2.23 
---------------------+----------------------+----------
               Total | 3,461,956      7,756 | 3,469,712 
                     |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,274,584      3,766 | 2,278,350 
           |     65.70      48.56 |     65.66 
-----------+----------------------+----------
         1 | 1,187,372      3,990 | 1,191,362 
           |     34.30      51.44 |     34.34 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator | outcome: covid death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,054,536      5,806 | 3,060,342 
           |     88.23      74.86 |     88.20 
-----------+----------------------+----------
         1 |   407,420      1,950 |   409,370 
           |     11.77      25.14 |     11.80 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma | outcome: covid death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,013,343      6,564 | 3,019,907 
           |     87.04      84.63 |     87.04 
-----------+----------------------+----------
         1 |   448,613      1,192 |   449,805 
           |     12.96      15.37 |     12.96 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac | outcome: covid death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,745,870      4,463 | 2,750,333 
           |     79.32      57.54 |     79.27 
-----------+----------------------+----------
         1 |   716,086      3,293 |   719,379 
           |     20.68      42.46 |     20.73 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   | outcome: covid death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,688,618      4,627 | 2,693,245 
                   |     81.40      63.06 |     81.36 
-------------------+----------------------+----------
  T1DM, controlled |     4,507         21 |     4,528 
                   |      0.14       0.29 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |     9,257         57 |     9,314 
                   |      0.28       0.78 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   412,219      1,647 |   413,866 
                   |     12.48      22.44 |     12.50 
-------------------+----------------------+----------
T2DM, uncontrolled |   186,078        970 |   187,048 
                   |      5.63      13.22 |      5.65 
-------------------+----------------------+----------
Diabetes, no HbA1c |     2,467         16 |     2,483 
                   |      0.07       0.22 |      0.08 
-------------------+----------------------+----------
             Total | 3,303,146      7,338 | 3,310,484 
                   |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo | outcome: covid death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,968,581      6,233 | 2,974,814 
              |     85.75      80.36 |     85.74 
--------------+----------------------+----------
    Last year |    41,142        211 |    41,353 
              |      1.19       2.72 |      1.19 
--------------+----------------------+----------
2-5 years ago |   122,949        376 |   123,325 
              |      3.55       4.85 |      3.55 
--------------+----------------------+----------
     5+ years |   329,284        936 |   330,220 
              |      9.51      12.07 |      9.52 
--------------+----------------------+----------
        Total | 3,461,956      7,756 | 3,469,712 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica | outcome: covid death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 3,411,218      7,478 | 3,418,696 
              |     98.53      96.42 |     98.53 
--------------+----------------------+----------
    Last year |     4,855         44 |     4,899 
              |      0.14       0.57 |      0.14 
--------------+----------------------+----------
2-5 years ago |    15,149         99 |    15,248 
              |      0.44       1.28 |      0.44 
--------------+----------------------+----------
     5+ years |    30,734        135 |    30,869 
              |      0.89       1.74 |      0.89 
--------------+----------------------+----------
        Total | 3,461,956      7,756 | 3,469,712 
              |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on | outcome: covid death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,455,250      7,725 | 3,462,975 
           |     99.81      99.60 |     99.81 
-----------+----------------------+----------
         1 |     6,706         31 |     6,737 
           |      0.19       0.40 |      0.19 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |   Failure/censoring
     solid |     indicator for
     organ | outcome: covid death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,460,848      7,747 | 3,468,595 
           |     99.97      99.88 |     99.97 
-----------+----------------------+----------
         1 |     1,108          9 |     1,117 
           |      0.03       0.12 |      0.03 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,453,447      7,730 | 3,461,177 
           |     99.75      99.66 |     99.75 
-----------+----------------------+----------
         1 |     8,509         26 |     8,535 
           |      0.25       0.34 |      0.25 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,430,392      7,603 | 3,437,995 
           |     99.09      98.03 |     99.09 
-----------+----------------------+----------
         1 |    31,564        153 |    31,717 
           |      0.91       1.97 |      0.91 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic | outcome: covid death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,395,369      7,321 | 3,402,690 
           |     98.08      94.39 |     98.07 
-----------+----------------------+----------
         1 |    66,587        435 |    67,022 
           |      1.92       5.61 |      1.93 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or | outcome: covid death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,211,555      6,239 | 3,217,794 
           |     92.77      80.44 |     92.74 
-----------+----------------------+----------
         1 |   250,401      1,517 |   251,918 
           |      7.23      19.56 |      7.26 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Calculated | outcome: covid death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,807        190 |     7,997 
           |      0.24       2.51 |      0.24 
-----------+----------------------+----------
        15 |    45,839        551 |    46,390 
           |      1.40       7.28 |      1.41 
-----------+----------------------+----------
        30 |   199,104      1,285 |   200,389 
           |      6.08      16.98 |      6.11 
-----------+----------------------+----------
        45 |   545,314      1,732 |   547,046 
           |     16.66      22.89 |     16.68 
-----------+----------------------+----------
        60 | 2,474,272      3,809 | 2,478,081 
           |     75.61      50.34 |     75.55 
-----------+----------------------+----------
     Total | 3,272,336      7,567 | 3,279,903 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 End-stage |     indicator for
     renal | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,453,596      7,600 | 3,461,196 
           |     99.76      97.99 |     99.75 
-----------+----------------------+----------
         1 |     8,360        156 |     8,516 
           |      0.24       2.01 |      0.25 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney | outcome: covid death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,663,892      3,998 | 2,667,890 
                      |     76.95      51.55 |     76.89 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   744,418      3,017 |   747,435 
                      |     21.50      38.90 |     21.54 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    53,646        741 |    54,387 
                      |      1.55       9.55 |      1.57 
----------------------+----------------------+----------
                Total | 3,461,956      7,756 | 3,469,712 
                      |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi | outcome: covid death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,541,294      2,305 | 1,543,599 
           |     44.52      29.72 |     44.49 
-----------+----------------------+----------
         1 | 1,920,662      5,451 | 1,926,113 
           |     55.48      70.28 |     55.51 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,198,996      7,011 | 3,206,007 
           |     92.40      90.39 |     92.40 
-----------+----------------------+----------
         1 |   262,960        745 |   263,705 
           |      7.60       9.61 |      7.60 
-----------+----------------------+----------
     Total | 3,461,956      7,756 | 3,469,712 
           |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation | outcome: covid death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   868,562      1,444 |   870,006 
                 |     25.09      18.62 |     25.07 
-----------------+----------------------+----------
               2 |   818,403      1,555 |   819,958 
                 |     23.64      20.05 |     23.63 
-----------------+----------------------+----------
               3 |   743,424      1,586 |   745,010 
                 |     21.47      20.45 |     21.47 
-----------------+----------------------+----------
               4 |   603,350      1,628 |   604,978 
                 |     17.43      20.99 |     17.44 
-----------------+----------------------+----------
 5 most deprived |   428,217      1,543 |   429,760 
                 |     12.37      19.89 |     12.39 
-----------------+----------------------+----------
           Total | 3,461,956      7,756 | 3,469,712 
                 |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      | outcome: covid death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,399,468      5,071 | 2,404,539 
                      |     69.31      65.38 |     69.30 
----------------------+----------------------+----------
                Mixed |     9,695         31 |     9,726 
                      |      0.28       0.40 |      0.28 
----------------------+----------------------+----------
Asian or Asian Britis |    89,702        442 |    90,144 
                      |      2.59       5.70 |      2.60 
----------------------+----------------------+----------
                Black |    27,052        141 |    27,193 
                      |      0.78       1.82 |      0.78 
----------------------+----------------------+----------
                Other |    21,194         54 |    21,248 
                      |      0.61       0.70 |      0.61 
----------------------+----------------------+----------
              Unknown |   914,845      2,017 |   916,862 
                      |     26.43      26.01 |     26.42 
----------------------+----------------------+----------
                Total | 3,461,956      7,756 | 3,469,712 
                      |    100.00     100.00 |    100.00 
16

**TABLE OF stp covid_death REDACTED DUE TO SMALL N**

25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |   793,188      3,609 |   796,797 
           |     23.17       7.80 |     22.96 
-----------+----------------------+----------
    70-<80 | 1,709,807     14,609 | 1,724,416 
           |     49.94      31.57 |     49.70 
-----------+----------------------+----------
       80+ |   920,439     28,060 |   948,499 
           |     26.89      60.63 |     27.34 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,837,284     22,413 | 1,859,697 
           |     53.67      48.43 |     53.60 
-----------+----------------------+----------
         1 | 1,586,150     23,865 | 1,610,015 
           |     46.33      51.57 |     46.40 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    54,671      2,892 |    57,563 
                     |      1.60       6.25 |      1.66 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   964,553     16,616 |   981,169 
                     |     28.18      35.90 |     28.28 
---------------------+----------------------+----------
Overweight (25-29.9) | 1,221,328     12,858 | 1,234,186 
                     |     35.68      27.78 |     35.57 
---------------------+----------------------+----------
   Obese I (30-34.9) |   601,841      6,044 |   607,885 
                     |     17.58      13.06 |     17.52 
---------------------+----------------------+----------
  Obese II (35-39.9) |   197,745      2,227 |   199,972 
                     |      5.78       4.81 |      5.76 
---------------------+----------------------+----------
     Obese III (40+) |    76,513      1,031 |    77,544 
                     |      2.23       2.23 |      2.23 
---------------------+----------------------+----------
        Unknown (.u) |   306,783      4,610 |   311,393 
                     |      8.96       9.96 |      8.97 
---------------------+----------------------+----------
               Total | 3,423,434     46,278 | 3,469,712 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never | 1,369,496     14,017 | 1,383,513 
             |     40.00      30.29 |     39.87 
-------------+----------------------+----------
      Former | 1,751,460     26,708 | 1,778,168 
             |     51.16      57.71 |     51.25 
-------------+----------------------+----------
     Current |   281,503      5,362 |   286,865 
             |      8.22      11.59 |      8.27 
-------------+----------------------+----------
Unknown (.u) |    20,975        191 |    21,166 
             |      0.61       0.41 |      0.61 
-------------+----------------------+----------
       Total | 3,423,434     46,278 | 3,469,712 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity | 2,547,335     36,976 | 2,584,311 
                     |     74.41      79.90 |     74.48 
---------------------+----------------------+----------
   Obese I (30-34.9) |   601,841      6,044 |   607,885 
                     |     17.58      13.06 |     17.52 
---------------------+----------------------+----------
  Obese II (35-39.9) |   197,745      2,227 |   199,972 
                     |      5.78       4.81 |      5.76 
---------------------+----------------------+----------
     Obese III (40+) |    76,513      1,031 |    77,544 
                     |      2.23       2.23 |      2.23 
---------------------+----------------------+----------
               Total | 3,423,434     46,278 | 3,469,712 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,260,809     17,541 | 2,278,350 
           |     66.04      37.90 |     65.66 
-----------+----------------------+----------
         1 | 1,162,625     28,737 | 1,191,362 
           |     33.96      62.10 |     34.34 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,025,838     34,504 | 3,060,342 
           |     88.39      74.56 |     88.20 
-----------+----------------------+----------
         1 |   397,596     11,774 |   409,370 
           |     11.61      25.44 |     11.80 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,979,572     40,335 | 3,019,907 
           |     87.03      87.16 |     87.04 
-----------+----------------------+----------
         1 |   443,862      5,943 |   449,805 
           |     12.97      12.84 |     12.96 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 | 2,723,355     26,978 | 2,750,333 
           |     79.55      58.30 |     79.27 
-----------+----------------------+----------
         1 |   700,079     19,300 |   719,379 
           |     20.45      41.70 |     20.73 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: non-covid
                   |         death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes | 2,661,631     31,614 | 2,693,245 
                   |     81.49      71.59 |     81.36 
-------------------+----------------------+----------
  T1DM, controlled |     4,409        119 |     4,528 
                   |      0.13       0.27 |      0.14 
-------------------+----------------------+----------
T1DM, uncontrolled |     9,068        246 |     9,314 
                   |      0.28       0.56 |      0.28 
-------------------+----------------------+----------
  T2DM, controlled |   405,628      8,238 |   413,866 
                   |     12.42      18.66 |     12.50 
-------------------+----------------------+----------
T2DM, uncontrolled |   183,182      3,866 |   187,048 
                   |      5.61       8.76 |      5.65 
-------------------+----------------------+----------
Diabetes, no HbA1c |     2,409         74 |     2,483 
                   |      0.07       0.17 |      0.08 
-------------------+----------------------+----------
             Total | 3,266,327     44,157 | 3,310,484 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 2,943,529     31,285 | 2,974,814 
              |     85.98      67.60 |     85.74 
--------------+----------------------+----------
    Last year |    37,593      3,760 |    41,353 
              |      1.10       8.12 |      1.19 
--------------+----------------------+----------
2-5 years ago |   119,050      4,275 |   123,325 
              |      3.48       9.24 |      3.55 
--------------+----------------------+----------
     5+ years |   323,262      6,958 |   330,220 
              |      9.44      15.04 |      9.52 
--------------+----------------------+----------
        Total | 3,423,434     46,278 | 3,469,712 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never | 3,374,291     44,405 | 3,418,696 
              |     98.56      95.95 |     98.53 
--------------+----------------------+----------
    Last year |     4,521        378 |     4,899 
              |      0.13       0.82 |      0.14 
--------------+----------------------+----------
2-5 years ago |    14,630        618 |    15,248 
              |      0.43       1.34 |      0.44 
--------------+----------------------+----------
     5+ years |    29,992        877 |    30,869 
              |      0.88       1.90 |      0.89 
--------------+----------------------+----------
        Total | 3,423,434     46,278 | 3,469,712 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,416,922     46,053 | 3,462,975 
           |     99.81      99.51 |     99.81 
-----------+----------------------+----------
         1 |     6,512        225 |     6,737 
           |      0.19       0.49 |      0.19 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,422,349     46,246 | 3,468,595 
           |     99.97      99.93 |     99.97 
-----------+----------------------+----------
         1 |     1,085         32 |     1,117 
           |      0.03       0.07 |      0.03 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,415,110     46,067 | 3,461,177 
           |     99.76      99.54 |     99.75 
-----------+----------------------+----------
         1 |     8,324        211 |     8,535 
           |      0.24       0.46 |      0.25 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,392,831     45,164 | 3,437,995 
           |     99.11      97.59 |     99.09 
-----------+----------------------+----------
         1 |    30,603      1,114 |    31,717 
           |      0.89       2.41 |      0.91 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,358,608     44,082 | 3,402,690 
           |     98.11      95.25 |     98.07 
-----------+----------------------+----------
         1 |    64,826      2,196 |    67,022 
           |      1.89       4.75 |      1.93 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,180,361     37,433 | 3,217,794 
           |     92.90      80.89 |     92.74 
-----------+----------------------+----------
         1 |   243,073      8,845 |   251,918 
           |      7.10      19.11 |      7.26 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,132        865 |     7,997 
           |      0.22       1.93 |      0.24 
-----------+----------------------+----------
        15 |    43,232      3,158 |    46,390 
           |      1.34       7.03 |      1.41 
-----------+----------------------+----------
        30 |   193,347      7,042 |   200,389 
           |      5.98      15.69 |      6.11 
-----------+----------------------+----------
        45 |   537,412      9,634 |   547,046 
           |     16.61      21.46 |     16.68 
-----------+----------------------+----------
        60 | 2,453,888     24,193 | 2,478,081 
           |     75.85      53.89 |     75.55 
-----------+----------------------+----------
     Total | 3,235,011     44,892 | 3,279,903 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,415,456     45,740 | 3,461,196 
           |     99.77      98.84 |     99.75 
-----------+----------------------+----------
         1 |     7,978        538 |     8,516 
           |      0.23       1.16 |      0.25 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None | 2,642,311     25,579 | 2,667,890 
                      |     77.18      55.27 |     76.89 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |   730,759     16,676 |   747,435 
                      |     21.35      36.03 |     21.54 
----------------------+----------------------+----------
    Stage 4/5 egfr<30 |    50,364      4,023 |    54,387 
                      |      1.47       8.69 |      1.57 
----------------------+----------------------+----------
                Total | 3,423,434     46,278 | 3,469,712 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,528,885     14,714 | 1,543,599 
           |     44.66      31.79 |     44.49 
-----------+----------------------+----------
         1 | 1,894,549     31,564 | 1,926,113 
           |     55.34      68.21 |     55.51 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 | 3,163,884     42,123 | 3,206,007 
           |     92.42      91.02 |     92.40 
-----------+----------------------+----------
         1 |   259,550      4,155 |   263,705 
           |      7.58       8.98 |      7.60 
-----------+----------------------+----------
     Total | 3,423,434     46,278 | 3,469,712 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |   860,351      9,655 |   870,006 
                 |     25.13      20.86 |     25.07 
-----------------+----------------------+----------
               2 |   809,886     10,072 |   819,958 
                 |     23.66      21.76 |     23.63 
-----------------+----------------------+----------
               3 |   735,081      9,929 |   745,010 
                 |     21.47      21.46 |     21.47 
-----------------+----------------------+----------
               4 |   595,999      8,979 |   604,978 
                 |     17.41      19.40 |     17.44 
-----------------+----------------------+----------
 5 most deprived |   422,117      7,643 |   429,760 
                 |     12.33      16.52 |     12.39 
-----------------+----------------------+----------
           Total | 3,423,434     46,278 | 3,469,712 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White | 2,373,624     30,915 | 2,404,539 
                      |     69.33      66.80 |     69.30 
----------------------+----------------------+----------
                Mixed |     9,622        104 |     9,726 
                      |      0.28       0.22 |      0.28 
----------------------+----------------------+----------
Asian or Asian Britis |    89,085      1,059 |    90,144 
                      |      2.60       2.29 |      2.60 
----------------------+----------------------+----------
                Black |    26,874        319 |    27,193 
                      |      0.79       0.69 |      0.78 
----------------------+----------------------+----------
                Other |    21,082        166 |    21,248 
                      |      0.62       0.36 |      0.61 
----------------------+----------------------+----------
              Unknown |   903,147     13,715 |   916,862 
                      |     26.38      29.64 |     26.42 
----------------------+----------------------+----------
                Total | 3,423,434     46,278 | 3,469,712 
                      |    100.00     100.00 |    100.00 
20

**TABLE OF stp non_covid_death REDACTED DUE TO SMALL N**


         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    407992      111              0.0003    0.0000     0.0002    0.0003
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    386640      229              0.0006    0.0000     0.0005    0.0007
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    899124      480              0.0005    0.0000     0.0005    0.0006
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    816310      937              0.0011    0.0000     0.0011    0.0012
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    539235     1037              0.0019    0.0001     0.0018    0.0020
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    391664     1552              0.0039    0.0001     0.0037    0.0041
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    407992      720              0.0018    0.0001     0.0016    0.0019
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    386640     1145              0.0030    0.0001     0.0028    0.0031
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    899124     3289              0.0036    0.0001     0.0035    0.0038
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    816310     4381              0.0053    0.0001     0.0052    0.0055
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    539235     7913              0.0144    0.0002     0.0141    0.0148
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    391664     7381              0.0184    0.0002     0.0180    0.0189
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
60-<70 male=0 
       0         0        0              0.0000         .          .         .
      80    406516      571              0.0014    0.0001     0.0013    0.0015
60-<70 male=1 
       0         0        0              0.0000         .          .         .
      80    384932      679              0.0018    0.0001     0.0016    0.0019
70-<80 male=0 
       0         0        0              0.0000         .          .         .
      80    895670     1505              0.0017    0.0000     0.0016    0.0018
70-<80 male=1 
       0         0        0              0.0000         .          .         .
      80    812462     1911              0.0023    0.0001     0.0022    0.0024
80+ male=0 
       0         0        0              0.0000         .          .         .
      80    534952     1808              0.0034    0.0001     0.0032    0.0035
80+ male=1 
       0         0        0              0.0000         .          .         .
      80    388253     1926              0.0049    0.0001     0.0047    0.0051
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\04a_an_desc
> riptive_tables.log
  log type:  text
 closed on:   6 Aug 2020, 22:19:32
-------------------------------------------------------------------------------
