-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_mult
> ivariable_cox_models_FULL_Sense2_covid_death.log
  log type:  text
 opened on:   6 Aug 2020, 21:50:11

. 
. *set trace on
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string
> )] bmi(string) smoking(string)
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicitytimer clear
  4. timer on 1
  5.          stcox  `exposure' `age'                ///
>                         i.male                                               
>    ///
>                         `bmi'                                                
>    ///
>                         `smoking'                                            
>    ///
>                         `ethnicity'                                          
>    ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  6. timer off 1
  7. timer list
  8. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. foreach exposure_type in        kids_cat3  {
  4.  
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(1
> ) bmi(i.bmicat) smoking(i.smoke)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_MAINFULLYADJMODEL_CCeth_bmi_smok_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCO
> ME `outcome')" 
 10.  
.  }
 11.  
.  }

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -12268.393
Iteration 1:   log pseudolikelihood = -11799.409
Iteration 2:   log pseudolikelihood = -11086.802
Iteration 3:   log pseudolikelihood = -10814.273
Iteration 4:   log pseudolikelihood = -10799.558
Iteration 5:   log pseudolikelihood =  -10799.34
Iteration 6:   log pseudolikelihood =  -10799.34
Iteration 7:   log pseudolikelihood =  -10799.34
Refining estimates:
Iteration 0:   log pseudolikelihood =  -10799.34

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    7,374,509             Number of obs    =   7,374,509
No. of failures      =          966
Time at risk         =   1223550771
                                                Wald chi2(48)    =     5603.65
Log pseudolikelihood =    -10799.34             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,119,717 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .7330952   .0839151    -2.71   0.007     .5857684    .9174761
Kids unde..  |   .8194739   .1108323    -1.47   0.141     .6286541    1.068215
             |
        age1 |   1.124275   .0646983     2.04   0.042     1.004359     1.25851
        age2 |   .9802698   .1218947    -0.16   0.873      .768246    1.250809
        age3 |   .9940057    .290166    -0.02   0.984     .5609313    1.761441
      1.male |   2.002105   .1424186     9.76   0.000     1.741554    2.301636
             |
      bmicat |
Normal (..)  |   .3974295   .0929611    -3.94   0.000     .2512806     .628581
Overweig..)  |     .42379   .0979165    -3.72   0.000     .2694518     .666531
Obese I ..)  |   .5118425   .1204512    -2.85   0.004     .3227188     .811799
Obese II..)  |   .9201317   .2207561    -0.35   0.729     .5749518    1.472545
Obese II..)  |   1.183416   .2928538     0.68   0.496     .7286095    1.922117
             |
       smoke |
     Former  |   1.088039   .0788016     1.17   0.244     .9440522    1.253987
    Current  |   .7368875   .0729928    -3.08   0.002      .606855    .8947825
             |
   ethnicity |
      Mixed  |   2.270613   .5102965     3.65   0.000     1.461653    3.527295
Asian or ..  |   2.251913   .2328746     7.85   0.000     1.838769    2.757884
      Black  |   2.367318   .3172137     6.43   0.000     1.820531    3.078329
      Other  |   2.192808    .414302     4.16   0.000     1.514179    3.175586
             |
         imd |
          2  |   1.255142   .1640934     1.74   0.082     .9714251    1.621722
          3  |    1.31404   .1679191     2.14   0.033     1.022904    1.688038
          4  |   1.805807   .2169146     4.92   0.000     1.427002    2.285168
5 most de..  |   1.782072   .2229553     4.62   0.000     1.394541    2.277295
             |
1.htdiag_o~p |   1.190812   .0889563     2.34   0.019     1.028623    1.378573
1.~y_disease |    2.32075   .2389984     8.18   0.000      1.89657    2.839801
    1.asthma |   1.096055   .0917947     1.10   0.273     .9301307    1.291577
1.~c_disease |   1.601644   .1487509     5.07   0.000     1.335093    1.921411
             |
     diabcat |
T1DM, con..  |   1.576101   .7881763     0.91   0.363     .5914466    4.200033
T1DM, unc..  |   3.237241   .7677649     4.95   0.000     2.033755    5.152897
T2DM, con..  |   1.729826   .1730523     5.48   0.000     1.421831    2.104539
T2DM, unc..  |   2.661026   .2591474    10.05   0.000     2.198639    3.220657
Diabetes,..  |   3.489069   1.778734     2.45   0.014     1.284593    9.476623
             |
cancer_exh~t |
  Last year  |   5.092056   1.039721     7.97   0.000     3.412642    7.597937
2-5 years..  |   2.749419   .4522666     6.15   0.000     1.991693    3.795418
   5+ years  |   1.797273   .2932744     3.59   0.000     1.305321    2.474634
             |
cancer_hae~t |
  Last year  |   7.600279   3.185604     4.84   0.000     3.342368    17.28243
2-5 years..  |   5.324625   1.594347     5.59   0.000     2.960838    9.575543
   5+ years  |   2.445729   .7305297     2.99   0.003      1.36194    4.391966
             |
1.~r_disease |   2.893685   .4516935     6.81   0.000     2.130992    3.929349
1.stroke_d~a |    1.68118   .2328929     3.75   0.000     1.281438     2.20562
1.other_ne~o |    4.12304    .642645     9.09   0.000      3.03769    5.596179
             |
reduced_ki~t |
Stage 3a/..  |   2.553624   .2818839     8.49   0.000      2.05682    3.170425
Stage 4/5..  |   5.329544   1.215531     7.34   0.000      3.40842    8.333492
             |
      1.esrd |   2.448625   .6066052     3.61   0.000     1.506786    3.979175
1.other_tr~t |   1.028529   .5583471     0.05   0.959     .3549227    2.980573
             |
tot_adults~h |
          2  |   .8275211    .070699    -2.22   0.027     .6999337    .9783657
          3  |   1.034225    .086895     0.40   0.689     .8771982    1.219362
             |
  1.asplenia |   1.257804   .6428451     0.45   0.654     .4619304    3.424913
1.ra_sle_p~s |   1.245773   .1452046     1.89   0.059     .9913448      1.5655
1.other_im~o |    2.03988   .5347814     2.72   0.007     1.220256    3.410031
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   3313.39 /        1 =    3313.3950

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    7,374,509             Number of obs    =   7,374,509
No. of failures      =          966
Time at risk         =   1223550771
                                                Wald chi2(48)    =     5603.65
Log pseudolikelihood =    -10799.34             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,119,717 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .7330952   .0839151    -2.71   0.007     .5857684    .9174761
Kids unde..  |   .8194739   .1108323    -1.47   0.141     .6286541    1.068215
             |
        age1 |   1.124275   .0646983     2.04   0.042     1.004359     1.25851
        age2 |   .9802698   .1218947    -0.16   0.873      .768246    1.250809
        age3 |   .9940057    .290166    -0.02   0.984     .5609313    1.761441
      1.male |   2.002105   .1424186     9.76   0.000     1.741554    2.301636
             |
      bmicat |
Normal (..)  |   .3974295   .0929611    -3.94   0.000     .2512806     .628581
Overweig..)  |     .42379   .0979165    -3.72   0.000     .2694518     .666531
Obese I ..)  |   .5118425   .1204512    -2.85   0.004     .3227188     .811799
Obese II..)  |   .9201317   .2207561    -0.35   0.729     .5749518    1.472545
Obese II..)  |   1.183416   .2928538     0.68   0.496     .7286095    1.922117
             |
       smoke |
     Former  |   1.088039   .0788016     1.17   0.244     .9440522    1.253987
    Current  |   .7368875   .0729928    -3.08   0.002      .606855    .8947825
             |
   ethnicity |
      Mixed  |   2.270613   .5102965     3.65   0.000     1.461653    3.527295
Asian or ..  |   2.251913   .2328746     7.85   0.000     1.838769    2.757884
      Black  |   2.367318   .3172137     6.43   0.000     1.820531    3.078329
      Other  |   2.192808    .414302     4.16   0.000     1.514179    3.175586
             |
         imd |
          2  |   1.255142   .1640934     1.74   0.082     .9714251    1.621722
          3  |    1.31404   .1679191     2.14   0.033     1.022904    1.688038
          4  |   1.805807   .2169146     4.92   0.000     1.427002    2.285168
5 most de..  |   1.782072   .2229553     4.62   0.000     1.394541    2.277295
             |
1.htdiag_o~p |   1.190812   .0889563     2.34   0.019     1.028623    1.378573
1.~y_disease |    2.32075   .2389984     8.18   0.000      1.89657    2.839801
    1.asthma |   1.096055   .0917947     1.10   0.273     .9301307    1.291577
1.~c_disease |   1.601644   .1487509     5.07   0.000     1.335093    1.921411
             |
     diabcat |
T1DM, con..  |   1.576101   .7881763     0.91   0.363     .5914466    4.200033
T1DM, unc..  |   3.237241   .7677649     4.95   0.000     2.033755    5.152897
T2DM, con..  |   1.729826   .1730523     5.48   0.000     1.421831    2.104539
T2DM, unc..  |   2.661026   .2591474    10.05   0.000     2.198639    3.220657
Diabetes,..  |   3.489069   1.778734     2.45   0.014     1.284593    9.476623
             |
cancer_exh~t |
  Last year  |   5.092056   1.039721     7.97   0.000     3.412642    7.597937
2-5 years..  |   2.749419   .4522666     6.15   0.000     1.991693    3.795418
   5+ years  |   1.797273   .2932744     3.59   0.000     1.305321    2.474634
             |
cancer_hae~t |
  Last year  |   7.600279   3.185604     4.84   0.000     3.342368    17.28243
2-5 years..  |   5.324625   1.594347     5.59   0.000     2.960838    9.575543
   5+ years  |   2.445729   .7305297     2.99   0.003      1.36194    4.391966
             |
1.~r_disease |   2.893685   .4516935     6.81   0.000     2.130992    3.929349
1.stroke_d~a |    1.68118   .2328929     3.75   0.000     1.281438     2.20562
1.other_ne~o |    4.12304    .642645     9.09   0.000      3.03769    5.596179
             |
reduced_ki~t |
Stage 3a/..  |   2.553624   .2818839     8.49   0.000      2.05682    3.170425
Stage 4/5..  |   5.329544   1.215531     7.34   0.000      3.40842    8.333492
             |
      1.esrd |   2.448625   .6066052     3.61   0.000     1.506786    3.979175
1.other_tr~t |   1.028529   .5583471     0.05   0.959     .3549227    2.980573
             |
tot_adults~h |
          2  |   .8275211    .070699    -2.22   0.027     .6999337    .9783657
          3  |   1.034225    .086895     0.40   0.689     .8771982    1.219362
             |
  1.asplenia |   1.257804   .6428451     0.45   0.654     .4619304    3.424913
1.ra_sle_p~s |   1.245773   .1452046     1.89   0.059     .9913448      1.5655
1.other_im~o |    2.03988   .5347814     2.72   0.007     1.220256    3.410031
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLY
> ADJMODEL_CCeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODE
> L_CCeth_bmi_smok_ageband_0.ster saved

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -57922.579
Iteration 1:   log pseudolikelihood = -54985.993
Iteration 2:   log pseudolikelihood = -54110.386
Iteration 3:   log pseudolikelihood = -54062.406
Iteration 4:   log pseudolikelihood = -54059.339
Iteration 5:   log pseudolikelihood = -54059.308
Iteration 6:   log pseudolikelihood = -54059.308
Refining estimates:
Iteration 0:   log pseudolikelihood = -54059.308

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,291,630             Number of obs    =   2,291,630
No. of failures      =        5,071
Time at risk         =    377477353
                                                Wald chi2(48)    =    11511.99
Log pseudolikelihood =   -54059.308             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,832,205 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .8419458   .0837162    -1.73   0.084     .6928634    1.023106
Kids unde..  |   .7818576   .1104965    -1.74   0.082     .5926947    1.031393
             |
        age1 |    1.07166   .0199359     3.72   0.000     1.033291    1.111455
        age2 |    1.13284   .0813063     1.74   0.082     .9841831     1.30395
        age3 |   .7289325   .1318584    -1.75   0.080     .5113419    1.039114
      1.male |   1.756987     .05438    18.21   0.000     1.653572    1.866869
             |
      bmicat |
Normal (..)  |   .5922062   .0458615    -6.77   0.000     .5088085    .6892735
Overweig..)  |   .4809072   .0377202    -9.33   0.000     .4123793     .560823
Obese I ..)  |   .6316975   .0514488    -5.64   0.000     .5384965    .7410295
Obese II..)  |   .8307724   .0753121    -2.05   0.041     .6955335    .9923071
Obese II..)  |   1.106433   .1173184     0.95   0.340      .898814    1.362011
             |
       smoke |
     Former  |   1.280331   .0425346     7.44   0.000     1.199621    1.366471
    Current  |   1.129588   .0706975     1.95   0.052     .9991854     1.27701
             |
   ethnicity |
      Mixed  |    1.15731   .2318914     0.73   0.466     .7814365    1.713981
Asian or ..  |   1.513593   .0960854     6.53   0.000     1.336513    1.714134
      Black  |   1.312009   .1256514     2.84   0.005      1.08747    1.582911
      Other  |    .986306   .1581557    -0.09   0.931     .7203113    1.350527
             |
         imd |
          2  |   1.115705   .0528347     2.31   0.021     1.016811    1.224217
          3  |   1.188119   .0564522     3.63   0.000      1.08247    1.304079
          4  |   1.398918   .0660887     7.11   0.000     1.275203    1.534636
5 most de..  |   1.530385   .0765008     8.51   0.000     1.387557    1.687914
             |
1.htdiag_o~p |   .9093344   .0326317    -2.65   0.008     .8475748    .9755941
1.~y_disease |   1.727893   .0586972    16.10   0.000     1.616595    1.846854
    1.asthma |    1.05162   .0413111     1.28   0.200     .9736901    1.135787
1.~c_disease |   1.393071   .0428228    10.78   0.000     1.311618    1.479582
             |
     diabcat |
T1DM, con..  |   1.845527   .4745881     2.38   0.017     1.114882    3.055005
T1DM, unc..  |   2.588259   .4234582     5.81   0.000     1.878214    3.566733
T2DM, con..  |   1.498742   .0533514    11.37   0.000      1.39774    1.607043
T2DM, unc..  |   1.995463   .0882459    15.62   0.000     1.829788    2.176138
Diabetes,..  |    1.96273   .6623142     2.00   0.046      1.01304    3.802722
             |
cancer_exh~t |
  Last year  |   2.355413    .199362    10.12   0.000     1.995361    2.780435
2-5 years..  |   1.292653   .0847525     3.92   0.000     1.136771     1.46991
   5+ years  |   1.053294    .046603     1.17   0.241     .9658021    1.148712
             |
cancer_hae~t |
  Last year  |   3.265575   .6345491     6.09   0.000     2.231304    4.779259
2-5 years..  |   2.543008   .3173023     7.48   0.000     1.991313     3.24755
   5+ years  |    1.57533   .1721456     4.16   0.000     1.271616    1.951585
             |
1.~r_disease |   2.141256   .2051768     7.95   0.000     1.774622    2.583636
1.stroke_d~a |   1.647788   .0613715    13.41   0.000     1.531788    1.772574
1.other_ne~o |   2.317123   .1479316    13.16   0.000     2.044588    2.625984
             |
reduced_ki~t |
Stage 3a/..  |   1.352086   .0451299     9.04   0.000     1.266464    1.443497
Stage 4/5..  |   2.473621   .1426008    15.71   0.000      2.20934    2.769515
             |
      1.esrd |   3.316013    .353542    11.24   0.000     2.690692    4.086659
1.other_tr~t |   1.516854   .6261055     1.01   0.313      .675456    3.406361
             |
tot_adults~h |
          2  |   .7859812   .0264815    -7.15   0.000     .7357551    .8396359
          3  |   1.155589   .0544231     3.07   0.002     1.053696    1.267334
             |
  1.asplenia |   .8871523   .2475847    -0.43   0.668      .513389    1.533027
1.ra_sle_p~s |   1.185175   .0568825     3.54   0.000      1.07877    1.302074
1.other_im~o |   1.865356   .3903303     2.98   0.003     1.237786    2.811109
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   4539.13 /        2 =    2269.5625

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,291,630             Number of obs    =   2,291,630
No. of failures      =        5,071
Time at risk         =    377477353
                                                Wald chi2(48)    =    11511.99
Log pseudolikelihood =   -54059.308             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,832,205 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .8419458   .0837162    -1.73   0.084     .6928634    1.023106
Kids unde..  |   .7818576   .1104965    -1.74   0.082     .5926947    1.031393
             |
        age1 |    1.07166   .0199359     3.72   0.000     1.033291    1.111455
        age2 |    1.13284   .0813063     1.74   0.082     .9841831     1.30395
        age3 |   .7289325   .1318584    -1.75   0.080     .5113419    1.039114
      1.male |   1.756987     .05438    18.21   0.000     1.653572    1.866869
             |
      bmicat |
Normal (..)  |   .5922062   .0458615    -6.77   0.000     .5088085    .6892735
Overweig..)  |   .4809072   .0377202    -9.33   0.000     .4123793     .560823
Obese I ..)  |   .6316975   .0514488    -5.64   0.000     .5384965    .7410295
Obese II..)  |   .8307724   .0753121    -2.05   0.041     .6955335    .9923071
Obese II..)  |   1.106433   .1173184     0.95   0.340      .898814    1.362011
             |
       smoke |
     Former  |   1.280331   .0425346     7.44   0.000     1.199621    1.366471
    Current  |   1.129588   .0706975     1.95   0.052     .9991854     1.27701
             |
   ethnicity |
      Mixed  |    1.15731   .2318914     0.73   0.466     .7814365    1.713981
Asian or ..  |   1.513593   .0960854     6.53   0.000     1.336513    1.714134
      Black  |   1.312009   .1256514     2.84   0.005      1.08747    1.582911
      Other  |    .986306   .1581557    -0.09   0.931     .7203113    1.350527
             |
         imd |
          2  |   1.115705   .0528347     2.31   0.021     1.016811    1.224217
          3  |   1.188119   .0564522     3.63   0.000      1.08247    1.304079
          4  |   1.398918   .0660887     7.11   0.000     1.275203    1.534636
5 most de..  |   1.530385   .0765008     8.51   0.000     1.387557    1.687914
             |
1.htdiag_o~p |   .9093344   .0326317    -2.65   0.008     .8475748    .9755941
1.~y_disease |   1.727893   .0586972    16.10   0.000     1.616595    1.846854
    1.asthma |    1.05162   .0413111     1.28   0.200     .9736901    1.135787
1.~c_disease |   1.393071   .0428228    10.78   0.000     1.311618    1.479582
             |
     diabcat |
T1DM, con..  |   1.845527   .4745881     2.38   0.017     1.114882    3.055005
T1DM, unc..  |   2.588259   .4234582     5.81   0.000     1.878214    3.566733
T2DM, con..  |   1.498742   .0533514    11.37   0.000      1.39774    1.607043
T2DM, unc..  |   1.995463   .0882459    15.62   0.000     1.829788    2.176138
Diabetes,..  |    1.96273   .6623142     2.00   0.046      1.01304    3.802722
             |
cancer_exh~t |
  Last year  |   2.355413    .199362    10.12   0.000     1.995361    2.780435
2-5 years..  |   1.292653   .0847525     3.92   0.000     1.136771     1.46991
   5+ years  |   1.053294    .046603     1.17   0.241     .9658021    1.148712
             |
cancer_hae~t |
  Last year  |   3.265575   .6345491     6.09   0.000     2.231304    4.779259
2-5 years..  |   2.543008   .3173023     7.48   0.000     1.991313     3.24755
   5+ years  |    1.57533   .1721456     4.16   0.000     1.271616    1.951585
             |
1.~r_disease |   2.141256   .2051768     7.95   0.000     1.774622    2.583636
1.stroke_d~a |   1.647788   .0613715    13.41   0.000     1.531788    1.772574
1.other_ne~o |   2.317123   .1479316    13.16   0.000     2.044588    2.625984
             |
reduced_ki~t |
Stage 3a/..  |   1.352086   .0451299     9.04   0.000     1.266464    1.443497
Stage 4/5..  |   2.473621   .1426008    15.71   0.000      2.20934    2.769515
             |
      1.esrd |   3.316013    .353542    11.24   0.000     2.690692    4.086659
1.other_tr~t |   1.516854   .6261055     1.01   0.313      .675456    3.406361
             |
tot_adults~h |
          2  |   .7859812   .0264815    -7.15   0.000     .7357551    .8396359
          3  |   1.155589   .0544231     3.07   0.002     1.053696    1.267334
             |
  1.asplenia |   .8871523   .2475847    -0.43   0.668      .513389    1.533027
1.ra_sle_p~s |   1.185175   .0568825     3.54   0.000      1.07877    1.302074
1.other_im~o |   1.865356   .3903303     2.98   0.003     1.237786    2.811109
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLY
> ADJMODEL_CCeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODE
> L_CCeth_bmi_smok_ageband_1.ster saved

. 
. 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_mult
> ivariable_cox_models_FULL_Sense2_covid_death.log
  log type:  text
 closed on:   6 Aug 2020, 23:06:56
-------------------------------------------------------------------------------
