-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_mult
> ivariable_cox_models_covid_tpp_prob.log
  log type:  text
 opened on:   6 Aug 2020, 21:50:10

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string
> )] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                ///
>                         i.male                                               
>    ///
>                         `bmi'                                                
>    ///
>                         `smoking'                                            
>    ///
>                         `ethnicity'                                          
>    ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in        kids_cat3  {
  4. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0
> ) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_MAINFULLYADJMODEL_noeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.         /*  Proportional Hazards test  */
.         * Based on Schoenfeld residuals
.         timer clear 
  9.         timer on 1
 10.         if e(N_fail)>0 estat phtest, d
 11.         timer off 1
 12.         timer list
 13. }
 14. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 15. 
. }
 16. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
 17. foreach exposure_type in kids_cat3   {
 18. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 19. if _rc==0{
 20. estimates
 21. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_MAINFULLYADJMODEL_noeth_12mo_ageband_`x', replace
 22. *estat concordance /*c-statistic*/
. }
 23. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outc
> ome')"
 24. 
. 
. }       
 25. 
.  
.  
.  foreach exposure_type in       gp_number_kids {
 26. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0
> ) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 27. if _rc==0{
 28. estimates
 29. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_MAINFULLYADJMODEL_noeth_ageband_`x', replace
 30. }
 31. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 32. }
 33. 
. }
   1:   3236.79 /        1 =    3236.7930

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,895,119             Number of obs    =  11,895,119
No. of failures      =       32,767
Time at risk         =   1960253127
                                                Wald chi2(42)    =    12038.06
Log pseudolikelihood =   -426586.85             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 6,799,224 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.135295    .017514     8.23   0.000     1.101482    1.170147
Kids unde..  |   1.132652   .0236908     5.96   0.000     1.087158     1.18005
             |
        age1 |   1.026419   .0025364    10.55   0.000      1.02146    1.031402
        age2 |   .9789576   .0072785    -2.86   0.004     .9647954    .9933276
        age3 |   1.000928   .0206646     0.04   0.964     .9612346     1.04226
      1.male |   .7364373   .0080679   -27.93   0.000     .7207931     .752421
             |
   obese4cat |
Obese I ..)  |   1.283083   .0199551    16.03   0.000     1.244562    1.322797
Obese II..)  |   1.379171   .0293174    15.12   0.000      1.32289    1.437845
Obese II..)  |   1.568756   .0401546    17.59   0.000     1.491996    1.649466
             |
smoke_nomiss |
     Former  |   .9599574   .0124376    -3.15   0.002      .935887    .9846469
    Current  |   .5676264   .0100427   -32.01   0.000     .5482804     .587655
             |
         imd |
          2  |   1.143087   .0240519     6.36   0.000     1.096904    1.191213
          3  |   1.269014   .0267988    11.28   0.000     1.217562    1.322641
          4  |   1.467474    .029902    18.82   0.000     1.410022    1.527267
5 most de..  |   1.665296   .0345533    24.58   0.000     1.598931    1.734415
             |
1.htdiag_o~p |   1.155262   .0160279    10.40   0.000     1.124272    1.187108
1.~y_disease |   1.745963   .0517835    18.79   0.000     1.647362    1.850464
    1.asthma |   1.149926   .0164212     9.78   0.000     1.118187    1.182566
1.~c_disease |   1.322233   .0351851    10.50   0.000     1.255039    1.393025
             |
     diabcat |
T1DM, con..  |   1.151549   .1475997     1.10   0.271     .8957357    1.480421
T1DM, unc..  |   1.583466   .1046855     6.95   0.000     1.391023    1.802532
T2DM, con..  |   1.576118   .0422032    16.99   0.000     1.495534    1.661043
T2DM, unc..  |   1.912602   .0522155    23.75   0.000     1.812952     2.01773
Diabetes,..  |   1.182279   .2521309     0.79   0.432     .7783843     1.79575
             |
cancer_exh~t |
  Last year  |   1.825664   .1418348     7.75   0.000     1.567803    2.125936
2-5 years..  |   1.198695   .0674794     3.22   0.001     1.073472    1.338524
   5+ years  |   1.028823    .047256     0.62   0.536     .9402494     1.12574
             |
cancer_hae~t |
  Last year  |   3.272524   .5673183     6.84   0.000     2.329809    4.596693
2-5 years..  |       2.58   .2901392     8.43   0.000     2.069646    3.216202
   5+ years  |   1.625055   .1414284     5.58   0.000     1.370213    1.927295
             |
1.~r_disease |   1.664481   .0881903     9.62   0.000     1.500303    1.846624
1.stroke_d~a |   1.422334   .0647999     7.73   0.000     1.300833    1.555182
1.other_ne~o |   1.322843   .0714592     5.18   0.000     1.189945    1.470584
             |
reduced_ki~t |
Stage 3a/..  |   1.232638   .0523713     4.92   0.000     1.134149    1.339679
Stage 4/5..  |   2.215092    .186196     9.46   0.000     1.878631    2.611812
             |
      1.esrd |   2.849416    .233496    12.78   0.000     2.426633     3.34586
1.other_tr~t |    1.46847   .2356321     2.39   0.017     1.072211    2.011174
             |
tot_adults~h |
          2  |    1.06601    .016874     4.04   0.000     1.033446    1.099601
          3  |   1.273774   .0204173    15.10   0.000     1.234379    1.314426
             |
  1.asplenia |   2.327085   .2266765     8.67   0.000     1.922643    2.816606
1.ra_sle_p~s |   1.145366   .0277106     5.61   0.000     1.092322    1.200987
1.other_im~o |   1.999987   .1260406    11.00   0.000     1.767599    2.262927
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFU
> LLYADJMODEL_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJM
> ODEL_noeth_ageband_0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.05494       119.77        1         0.0000
      2.kids_cat3 |      0.02777        31.89        1         0.0000
      age1        |     -0.02216        15.18        1         0.0001
      age2        |     -0.00994         3.24        1         0.0719
      age3        |      0.01435         6.88        1         0.0087
      0b.male     |            .            .        1             .
      1.male      |     -0.00545         0.94        1         0.3320
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02476        21.34        1         0.0000
      3.obese4cat |     -0.02722        26.20        1         0.0000
      4.obese4cat |     -0.02589        23.64        1         0.0000
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.03539        43.06        1         0.0000
      3.smoke_no~s|     -0.00565         1.15        1         0.2833
      1b.imd      |            .            .        1             .
      2.imd       |      0.02187        18.09        1         0.0000
      3.imd       |      0.05125       102.21        1         0.0000
      4.imd       |      0.08141       258.40        1         0.0000
      5.imd       |      0.10061       403.10        1         0.0000
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.01055         3.89        1         0.0486
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01988        13.63        1         0.0002
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.06929       165.32        1         0.0000
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.01517         7.78        1         0.0053
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00020         0.00        1         0.9705
      3.diabcat   |     -0.01524         7.60        1         0.0058
      4.diabcat   |      0.01118         4.48        1         0.0343
      5.diabcat   |     -0.01023         3.73        1         0.0534
      6.diabcat   |     -0.00345         0.39        1         0.5310
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.01050         3.65        1         0.0560
      3.cancer_e~t|     -0.00613         1.26        1         0.2621
      4.cancer_e~t|     -0.01539         7.81        1         0.0052
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.01450         7.10        1         0.0077
      3.cancer_h~t|     -0.01858        11.51        1         0.0007
      4.cancer_h~t|     -0.00274         0.25        1         0.6136
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.00773         2.02        1         0.1555
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00553         1.05        1         0.3060
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.02144        15.56        1         0.0001
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01936        12.80        1         0.0003
      3.reduced_~t|     -0.01939        11.69        1         0.0006
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.01380         6.81        1         0.0091
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00297         0.33        1         0.5631
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01242         5.38        1         0.0203
      3.tot_adul~h|      0.06600       157.25        1         0.0000
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00478         0.77        1         0.3788
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.01412         6.65        1         0.0099
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.02181        16.11        1         0.0001
      ------------+---------------------------------------------------
      global test |                   2585.38       42         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   3899.17 /        1 =    3899.1660
(0 observations deleted)
   1:   2741.17 /        1 =    2741.1670

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,895,119             Number of obs    =  11,895,119
No. of failures      =       32,767
Time at risk         =   1960253127
                                                Wald chi2(42)    =    12038.06
Log pseudolikelihood =   -426586.85             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 6,799,224 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.135295    .017514     8.23   0.000     1.101482    1.170147
Kids unde..  |   1.132652   .0236908     5.96   0.000     1.087158     1.18005
             |
        age1 |   1.026419   .0025364    10.55   0.000      1.02146    1.031402
        age2 |   .9789576   .0072785    -2.86   0.004     .9647954    .9933276
        age3 |   1.000928   .0206646     0.04   0.964     .9612346     1.04226
      1.male |   .7364373   .0080679   -27.93   0.000     .7207931     .752421
             |
   obese4cat |
Obese I ..)  |   1.283083   .0199551    16.03   0.000     1.244562    1.322797
Obese II..)  |   1.379171   .0293174    15.12   0.000      1.32289    1.437845
Obese II..)  |   1.568756   .0401546    17.59   0.000     1.491996    1.649466
             |
smoke_nomiss |
     Former  |   .9599574   .0124376    -3.15   0.002      .935887    .9846469
    Current  |   .5676264   .0100427   -32.01   0.000     .5482804     .587655
             |
         imd |
          2  |   1.143087   .0240519     6.36   0.000     1.096904    1.191213
          3  |   1.269014   .0267988    11.28   0.000     1.217562    1.322641
          4  |   1.467474    .029902    18.82   0.000     1.410022    1.527267
5 most de..  |   1.665296   .0345533    24.58   0.000     1.598931    1.734415
             |
1.htdiag_o~p |   1.155262   .0160279    10.40   0.000     1.124272    1.187108
1.~y_disease |   1.745963   .0517835    18.79   0.000     1.647362    1.850464
    1.asthma |   1.149926   .0164212     9.78   0.000     1.118187    1.182566
1.~c_disease |   1.322233   .0351851    10.50   0.000     1.255039    1.393025
             |
     diabcat |
T1DM, con..  |   1.151549   .1475997     1.10   0.271     .8957357    1.480421
T1DM, unc..  |   1.583466   .1046855     6.95   0.000     1.391023    1.802532
T2DM, con..  |   1.576118   .0422032    16.99   0.000     1.495534    1.661043
T2DM, unc..  |   1.912602   .0522155    23.75   0.000     1.812952     2.01773
Diabetes,..  |   1.182279   .2521309     0.79   0.432     .7783843     1.79575
             |
cancer_exh~t |
  Last year  |   1.825664   .1418348     7.75   0.000     1.567803    2.125936
2-5 years..  |   1.198695   .0674794     3.22   0.001     1.073472    1.338524
   5+ years  |   1.028823    .047256     0.62   0.536     .9402494     1.12574
             |
cancer_hae~t |
  Last year  |   3.272524   .5673183     6.84   0.000     2.329809    4.596693
2-5 years..  |       2.58   .2901392     8.43   0.000     2.069646    3.216202
   5+ years  |   1.625055   .1414284     5.58   0.000     1.370213    1.927295
             |
1.~r_disease |   1.664481   .0881903     9.62   0.000     1.500303    1.846624
1.stroke_d~a |   1.422334   .0647999     7.73   0.000     1.300833    1.555182
1.other_ne~o |   1.322843   .0714592     5.18   0.000     1.189945    1.470584
             |
reduced_ki~t |
Stage 3a/..  |   1.232638   .0523713     4.92   0.000     1.134149    1.339679
Stage 4/5..  |   2.215092    .186196     9.46   0.000     1.878631    2.611812
             |
      1.esrd |   2.849416    .233496    12.78   0.000     2.426633     3.34586
1.other_tr~t |    1.46847   .2356321     2.39   0.017     1.072211    2.011174
             |
tot_adults~h |
          2  |    1.06601    .016874     4.04   0.000     1.033446    1.099601
          3  |   1.273774   .0204173    15.10   0.000     1.234379    1.314426
             |
  1.asplenia |   2.327085   .2266765     8.67   0.000     1.922643    2.816606
1.ra_sle_p~s |   1.145366   .0277106     5.61   0.000     1.092322    1.200987
1.other_im~o |   1.999987   .1260406    11.00   0.000     1.767599    2.262927
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFU
> LLYADJMODEL_noeth_12mo_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJM
> ODEL_noeth_12mo_ageband_0.ster saved
   1:   2950.55 /        1 =    2950.5500

--------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,895,119             Number of obs    =  11,895,119
No. of failures      =       32,767
Time at risk         =   1960253127
                                                Wald chi2(44)    =    12037.81
Log pseudolikelihood =   -426586.39             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,799,224 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |   1.132613   .0236906     5.95   0.000      1.08712    1.180011
                 1 child <12  |    1.13602   .0209299     6.92   0.000      1.09573    1.177792
              2 children <12  |   1.124958   .0252828     5.24   0.000      1.07648    1.175619
             3+ children <12  |   1.164447   .0427712     4.14   0.000     1.083564    1.251369
                              |
                         age1 |   1.026404   .0025406    10.53   0.000     1.021436    1.031395
                         age2 |   .9790379   .0072968    -2.84   0.004     .9648405    .9934442
                         age3 |   1.000663   .0207085     0.03   0.974     .9608877    1.042086
                       1.male |    .736455   .0080683   -27.92   0.000       .72081    .7524396
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.282944   .0199547    16.02   0.000     1.244423    1.322656
          Obese II (35-39.9)  |   1.378992    .029315    15.12   0.000     1.322716    1.437662
             Obese III (40+)  |   1.568541   .0401489    17.59   0.000     1.491791    1.649238
                              |
                 smoke_nomiss |
                      Former  |   .9599977    .012438    -3.15   0.002     .9359267    .9846878
                     Current  |    .567554   .0100435   -32.01   0.000     .5482065    .5875843
                              |
                          imd |
                           2  |   1.142993   .0240523     6.35   0.000      1.09681     1.19112
                           3  |   1.268767    .026795    11.27   0.000     1.217322    1.322386
                           4  |   1.467013   .0298991    18.80   0.000     1.409567    1.526801
             5 most deprived  |   1.664331   .0345513    24.54   0.000      1.59797    1.733446
                              |
           1.htdiag_or_highbp |     1.1553   .0160275    10.41   0.000      1.12431    1.187144
1.chronic_respiratory_disease |    1.74603   .0517854    18.79   0.000     1.647427    1.850536
                     1.asthma |   1.149952   .0164218     9.78   0.000     1.118212    1.182593
    1.chronic_cardiac_disease |   1.322261   .0351856    10.50   0.000     1.255066    1.393054
                              |
                      diabcat |
            T1DM, controlled  |   1.151599   .1476071     1.10   0.271     .8957727    1.480487
          T1DM, uncontrolled  |   1.583573   .1046926     6.95   0.000     1.391118    1.802654
            T2DM, controlled  |   1.576048   .0421994    16.99   0.000     1.495472    1.660966
          T2DM, uncontrolled  |   1.912537   .0522118    23.75   0.000     1.812893    2.017658
          Diabetes, no HbA1c  |    1.18226   .2521267     0.79   0.432     .7783717     1.79572
                              |
            cancer_exhaem_cat |
                   Last year  |    1.82576   .1418419     7.75   0.000     1.567886    2.126047
               2-5 years ago  |   1.198736   .0674821     3.22   0.001     1.073509    1.338571
                    5+ years  |   1.028836   .0472572     0.62   0.536     .9402609    1.125756
                              |
              cancer_haem_cat |
                   Last year  |    3.27224   .5672442     6.84   0.000     2.329641    4.596225
               2-5 years ago  |   2.580178   .2901584     8.43   0.000      2.06979    3.216422
                    5+ years  |   1.625067   .1414291     5.58   0.000     1.370223    1.927308
                              |
      1.chronic_liver_disease |   1.664427   .0881874     9.62   0.000     1.500255    1.846565
            1.stroke_dementia |   1.422376    .064801     7.73   0.000     1.300873    1.555226
                1.other_neuro |   1.322919   .0714636     5.18   0.000     1.190013    1.470669
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.232661   .0523722     4.92   0.000     1.134171    1.339704
           Stage 4/5 egfr<30  |   2.215153    .186203     9.46   0.000     1.878679    2.611888
                              |
                       1.esrd |   2.849416   .2334997    12.78   0.000     2.426626    3.345869
           1.other_transplant |    1.46832   .2356098     2.39   0.017       1.0721    2.010974
                              |
                tot_adults_hh |
                           2  |   1.066064   .0168824     4.04   0.000     1.033484    1.099672
                           3  |   1.273494    .020412    15.08   0.000     1.234109    1.314136
                              |
                   1.asplenia |    2.32703   .2266714     8.67   0.000     1.922597     2.81654
           1.ra_sle_psoriasis |     1.1454   .0277117     5.61   0.000     1.092354    1.201022
               1.other_immuno |   1.999968   .1260389    11.00   0.000     1.767583    2.262904
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_0.ster saved
   1:    911.23 /        1 =     911.2280

--------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,310,484             Number of obs    =   3,310,484
No. of failures      =       13,329
Time at risk         =    542927141
                                                Wald chi2(42)    =    12706.35
Log pseudolikelihood =    -152582.8             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,508,446 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.112103   .0646849     1.83   0.068     .9922825    1.246392
               Kids under 18  |   1.005794   .0830807     0.07   0.944     .8554569    1.182552
                              |
                         age1 |   .9798719     .00851    -2.34   0.019     .9633337    .9966939
                         age2 |   1.199672   .0439326     4.97   0.000     1.116583    1.288944
                         age3 |   .6839296   .0653274    -3.98   0.000     .5671613    .8247384
                       1.male |   1.164673   .0210176     8.45   0.000     1.124199    1.206603
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.083911   .0248617     3.51   0.000     1.036262    1.133751
          Obese II (35-39.9)  |    1.18932   .0414157     4.98   0.000     1.110855    1.273328
             Obese III (40+)  |   1.498905   .0720157     8.42   0.000     1.364199    1.646913
                              |
                 smoke_nomiss |
                      Former  |   1.135615   .0224841     6.42   0.000     1.092391    1.180549
                     Current  |   .8933355   .0333319    -3.02   0.003     .8303377     .961113
                              |
                          imd |
                           2  |   1.126966   .0321104     4.20   0.000     1.065756    1.191692
                           3  |   1.196928   .0345197     6.23   0.000     1.131147    1.266534
                           4  |   1.398855    .040487    11.60   0.000     1.321711    1.480502
             5 most deprived  |   1.544027   .0478461    14.02   0.000     1.453041     1.64071
                              |
           1.htdiag_or_highbp |   1.023328   .0217508     1.08   0.278      .981573    1.066859
1.chronic_respiratory_disease |   1.983078   .0426402    31.84   0.000     1.901241    2.068437
                     1.asthma |   1.228953   .0287148     8.82   0.000     1.173943    1.286542
    1.chronic_cardiac_disease |   1.438229   .0283089    18.46   0.000     1.383801    1.494798
                              |
                      diabcat |
            T1DM, controlled  |   1.617986   .2804009     2.78   0.005     1.152019    2.272428
          T1DM, uncontrolled  |   2.308832   .2460873     7.85   0.000     1.873556    2.845233
            T2DM, controlled  |    1.41371   .0325316    15.05   0.000     1.351366    1.478931
          T2DM, uncontrolled  |   1.734984   .0507144    18.85   0.000      1.63838    1.837285
          Diabetes, no HbA1c  |   1.758933   .3686123     2.69   0.007     1.166451    2.652358
                              |
            cancer_exhaem_cat |
                   Last year  |   1.823086   .1092588    10.02   0.000     1.621042    2.050314
               2-5 years ago  |   1.288764   .0535363     6.11   0.000     1.187992    1.398083
                    5+ years  |   1.179802   .0320293     6.09   0.000     1.118666    1.244278
                              |
              cancer_haem_cat |
                   Last year  |   3.703341   .4398593    11.02   0.000     2.934225    4.674057
               2-5 years ago  |   2.313461    .192679    10.07   0.000     1.965029    2.723676
                    5+ years  |   1.757249   .1165682     8.50   0.000     1.543009    2.001236
                              |
      1.chronic_liver_disease |   1.666298   .1092624     7.79   0.000     1.465337    1.894818
            1.stroke_dementia |   1.629973   .0409111    19.47   0.000     1.551729    1.712162
                1.other_neuro |   2.040411   .0868189    16.76   0.000     1.877151    2.217869
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.153279   .0241616     6.81   0.000     1.106882     1.20162
           Stage 4/5 egfr<30  |     1.7249   .0750246    12.53   0.000     1.583948    1.878396
                              |
                       1.esrd |    3.78473   .2752569    18.30   0.000     3.281923    4.364568
           1.other_transplant |    1.16364   .3172726     0.56   0.578     .6819212    1.985653
                              |
                tot_adults_hh |
                           2  |   .8734757   .0180402    -6.55   0.000     .8388237    .9095592
                           3  |   1.169174   .0341801     5.35   0.000     1.104066    1.238123
                              |
                   1.asplenia |    1.32924   .1834312     2.06   0.039     1.014239    1.742075
           1.ra_sle_psoriasis |   1.361635   .0379937    11.06   0.000     1.289169    1.438175
               1.other_immuno |   1.785767   .2374303     4.36   0.000     1.376105    2.317385
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.03677        19.92        1         0.0000
      2.kids_cat3 |      0.01921         5.44        1         0.0197
      age1        |     -0.02587         9.18        1         0.0024
      age2        |      0.01352         2.52        1         0.1124
      age3        |     -0.00956         1.26        1         0.2618
      0b.male     |            .            .        1             .
      1.male      |     -0.05763        45.10        1         0.0000
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01617         3.53        1         0.0603
      3.obese4cat |     -0.02502         8.52        1         0.0035
      4.obese4cat |     -0.00311         0.13        1         0.7180
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01435         2.77        1         0.0958
      3.smoke_no~s|     -0.00271         0.10        1         0.7503
      1b.imd      |            .            .        1             .
      2.imd       |      0.01135         1.87        1         0.1716
      3.imd       |     -0.00444         0.28        1         0.5950
      4.imd       |      0.00991         1.41        1         0.2342
      5.imd       |      0.01398         2.81        1         0.0935
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.01270         2.22        1         0.1365
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.00577         0.48        1         0.4878
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.00967         1.31        1         0.2527
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00754         0.83        1         0.3614
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01326         2.42        1         0.1196
      3.diabcat   |     -0.00854         0.99        1         0.3197
      4.diabcat   |     -0.00174         0.04        1         0.8365
      5.diabcat   |     -0.00859         1.01        1         0.3145
      6.diabcat   |     -0.00728         0.72        1         0.3965
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.00415         0.23        1         0.6308
      3.cancer_e~t|     -0.00557         0.42        1         0.5156
      4.cancer_e~t|     -0.01673         3.80        1         0.0513
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.01533         3.24        1         0.0719
      3.cancer_h~t|      0.00509         0.35        1         0.5550
      4.cancer_h~t|      0.00011         0.00        1         0.9896
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.01284         2.26        1         0.1331
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00776         0.89        1         0.3443
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00992         1.39        1         0.2377
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01132         1.82        1         0.1774
      3.reduced_~t|     -0.01868         4.88        1         0.0272
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.00767         0.78        1         0.3783
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00219         0.07        1         0.7980
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.02144         6.77        1         0.0093
      3.tot_adul~h|      0.02410         9.60        1         0.0019
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.01200         1.94        1         0.1632
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00493         0.33        1         0.5666
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00171         0.04        1         0.8412
      ------------+---------------------------------------------------
      global test |                    207.69       42         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   1483.86 /        1 =    1483.8620
(0 observations deleted)
   1:    908.01 /        1 =     908.0100

--------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,310,484             Number of obs    =   3,310,484
No. of failures      =       13,329
Time at risk         =    542927141
                                                Wald chi2(42)    =    12706.35
Log pseudolikelihood =    -152582.8             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,508,446 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.112103   .0646849     1.83   0.068     .9922825    1.246392
               Kids under 18  |   1.005794   .0830807     0.07   0.944     .8554569    1.182552
                              |
                         age1 |   .9798719     .00851    -2.34   0.019     .9633337    .9966939
                         age2 |   1.199672   .0439326     4.97   0.000     1.116583    1.288944
                         age3 |   .6839296   .0653274    -3.98   0.000     .5671613    .8247384
                       1.male |   1.164673   .0210176     8.45   0.000     1.124199    1.206603
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.083911   .0248617     3.51   0.000     1.036262    1.133751
          Obese II (35-39.9)  |    1.18932   .0414157     4.98   0.000     1.110855    1.273328
             Obese III (40+)  |   1.498905   .0720157     8.42   0.000     1.364199    1.646913
                              |
                 smoke_nomiss |
                      Former  |   1.135615   .0224841     6.42   0.000     1.092391    1.180549
                     Current  |   .8933355   .0333319    -3.02   0.003     .8303377     .961113
                              |
                          imd |
                           2  |   1.126966   .0321104     4.20   0.000     1.065756    1.191692
                           3  |   1.196928   .0345197     6.23   0.000     1.131147    1.266534
                           4  |   1.398855    .040487    11.60   0.000     1.321711    1.480502
             5 most deprived  |   1.544027   .0478461    14.02   0.000     1.453041     1.64071
                              |
           1.htdiag_or_highbp |   1.023328   .0217508     1.08   0.278      .981573    1.066859
1.chronic_respiratory_disease |   1.983078   .0426402    31.84   0.000     1.901241    2.068437
                     1.asthma |   1.228953   .0287148     8.82   0.000     1.173943    1.286542
    1.chronic_cardiac_disease |   1.438229   .0283089    18.46   0.000     1.383801    1.494798
                              |
                      diabcat |
            T1DM, controlled  |   1.617986   .2804009     2.78   0.005     1.152019    2.272428
          T1DM, uncontrolled  |   2.308832   .2460873     7.85   0.000     1.873556    2.845233
            T2DM, controlled  |    1.41371   .0325316    15.05   0.000     1.351366    1.478931
          T2DM, uncontrolled  |   1.734984   .0507144    18.85   0.000      1.63838    1.837285
          Diabetes, no HbA1c  |   1.758933   .3686123     2.69   0.007     1.166451    2.652358
                              |
            cancer_exhaem_cat |
                   Last year  |   1.823086   .1092588    10.02   0.000     1.621042    2.050314
               2-5 years ago  |   1.288764   .0535363     6.11   0.000     1.187992    1.398083
                    5+ years  |   1.179802   .0320293     6.09   0.000     1.118666    1.244278
                              |
              cancer_haem_cat |
                   Last year  |   3.703341   .4398593    11.02   0.000     2.934225    4.674057
               2-5 years ago  |   2.313461    .192679    10.07   0.000     1.965029    2.723676
                    5+ years  |   1.757249   .1165682     8.50   0.000     1.543009    2.001236
                              |
      1.chronic_liver_disease |   1.666298   .1092624     7.79   0.000     1.465337    1.894818
            1.stroke_dementia |   1.629973   .0409111    19.47   0.000     1.551729    1.712162
                1.other_neuro |   2.040411   .0868189    16.76   0.000     1.877151    2.217869
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.153279   .0241616     6.81   0.000     1.106882     1.20162
           Stage 4/5 egfr<30  |     1.7249   .0750246    12.53   0.000     1.583948    1.878396
                              |
                       1.esrd |    3.78473   .2752569    18.30   0.000     3.281923    4.364568
           1.other_transplant |    1.16364   .3172726     0.56   0.578     .6819212    1.985653
                              |
                tot_adults_hh |
                           2  |   .8734757   .0180402    -6.55   0.000     .8388237    .9095592
                           3  |   1.169174   .0341801     5.35   0.000     1.104066    1.238123
                              |
                   1.asplenia |    1.32924   .1834312     2.06   0.039     1.014239    1.742075
           1.ra_sle_psoriasis |   1.361635   .0379937    11.06   0.000     1.289169    1.438175
               1.other_immuno |   1.785767   .2374303     4.36   0.000     1.376105    2.317385
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_1.ster saved
   1:    936.51 /        1 =     936.5140

--------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,310,484             Number of obs    =   3,310,484
No. of failures      =       13,329
Time at risk         =    542927141
                                                Wald chi2(44)    =    12708.40
Log pseudolikelihood =    -152581.1             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,508,446 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |   1.006117   .0831103     0.07   0.941     .8557266    1.182938
                 1 child <12  |   1.043895   .0770317     0.58   0.560     .9033263    1.206339
              2 children <12  |    1.27968   .1245935     2.53   0.011     1.057368    1.548735
             3+ children <12  |   1.035786   .1878913     0.19   0.846      .725876    1.478011
                              |
                         age1 |   .9799003   .0085101    -2.34   0.019      .963362    .9967226
                         age2 |   1.199598   .0439293     4.97   0.000     1.116515    1.288863
                         age3 |   .6840132   .0653347    -3.98   0.000     .5672316    .8248377
                       1.male |   1.164665   .0210176     8.45   0.000     1.124192    1.206596
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.084014   .0248639     3.52   0.000      1.03636    1.133858
          Obese II (35-39.9)  |   1.189668   .0414288     4.99   0.000     1.111178    1.273702
             Obese III (40+)  |   1.499342   .0720368     8.43   0.000     1.364596    1.647393
                              |
                 smoke_nomiss |
                      Former  |   1.135822   .0224888     6.43   0.000     1.092589    1.180765
                     Current  |    .893627   .0333442    -3.01   0.003     .8306062    .9614294
                              |
                          imd |
                           2  |   1.127043   .0321126     4.20   0.000     1.065828    1.191773
                           3  |   1.197089   .0345259     6.24   0.000     1.131297    1.266708
                           4  |   1.398935   .0404899    11.60   0.000     1.321785    1.480588
             5 most deprived  |   1.544309   .0478624    14.02   0.000     1.453293    1.641026
                              |
           1.htdiag_or_highbp |   1.023315   .0217508     1.08   0.278     .9815602    1.066846
1.chronic_respiratory_disease |   1.983089    .042641    31.84   0.000      1.90125     2.06845
                     1.asthma |   1.228898   .0287149     8.82   0.000     1.173887    1.286487
    1.chronic_cardiac_disease |   1.438219   .0283081    18.46   0.000     1.383792    1.494785
                              |
                      diabcat |
            T1DM, controlled  |   1.618992    .280573     2.78   0.005     1.152738    2.273835
          T1DM, uncontrolled  |   2.308685   .2460729     7.85   0.000     1.873435    2.845054
            T2DM, controlled  |   1.413545   .0325271    15.04   0.000     1.351209    1.478756
          T2DM, uncontrolled  |   1.734594   .0507037    18.84   0.000      1.63801    1.836874
          Diabetes, no HbA1c  |   1.756336   .3680663     2.69   0.007     1.164731    2.648437
                              |
            cancer_exhaem_cat |
                   Last year  |   1.823445   .1092812    10.02   0.000     1.621359    2.050719
               2-5 years ago  |   1.288798   .0535382     6.11   0.000     1.188023    1.398121
                    5+ years  |   1.179929   .0320328     6.09   0.000     1.118787    1.244413
                              |
              cancer_haem_cat |
                   Last year  |   3.702674   .4397867    11.02   0.000     2.933686    4.673232
               2-5 years ago  |   2.313802   .1927051    10.07   0.000     1.965323    2.724072
                    5+ years  |   1.757191   .1165642     8.50   0.000     1.542958     2.00117
                              |
      1.chronic_liver_disease |   1.667015   .1092886     7.79   0.000     1.466004    1.895587
            1.stroke_dementia |   1.630064    .040913    19.47   0.000     1.551817    1.712257
                1.other_neuro |   2.040365   .0868139    16.76   0.000     1.877115    2.217813
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.153257   .0241613     6.81   0.000     1.106861    1.201598
           Stage 4/5 egfr<30  |   1.724668   .0750179    12.53   0.000     1.583729     1.87815
                              |
                       1.esrd |   3.784805   .2752802    18.30   0.000     3.281959    4.364696
           1.other_transplant |     1.1599    .316338     0.54   0.587     .6796315    1.979555
                              |
                tot_adults_hh |
                           2  |   .8735329   .0180416    -6.55   0.000     .8388783    .9096192
                           3  |   1.168719   .0341899     5.33   0.000     1.103593    1.237689
                              |
                   1.asplenia |   1.329539   .1834668     2.06   0.039     1.014475    1.742452
           1.ra_sle_psoriasis |   1.361753   .0379971    11.07   0.000      1.28928      1.4383
               1.other_immuno |   1.785808   .2374134     4.36   0.000     1.376171    2.317381
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_covid_tpp_prob.log
  log type:  text
 closed on:   7 Aug 2020, 02:35:51
--------------------------------------------------------------------------------------------------------------------------------
