-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_mult
> ivariable_cox_models_FULL_Sense1_non_covid_death.log
  log type:  text
 opened on:   6 Aug 2020, 21:50:11

. 
. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string
> )] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                ///
>                         i.male                                               
>    ///
>                         `bmi'                                                
>    ///
>                         `smoking'                                            
>    ///
>                         `ethnicity'                                          
>    ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. foreach exposure_type in        kids_cat3  {
  4. 
. 
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(1
> ) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_MAINFULLYADJMODEL_CCeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `
> outcome')"
 10. 
.  }
 11. }
   1:    317.07 /        1 =     317.0660
WARNING CC ETHNICITY MODEL WITH AGESPLINE DID NOT FIT (OUTCOME non_covid_death)
   1:   2199.55 /        1 =    2199.5480

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,430,539             Number of obs    =   2,430,539
No. of failures      =       30,979
Time at risk         =    400307361
                                                Wald chi2(46)    =    70867.88
Log pseudolikelihood =   -332710.44             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,923,608 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.081065   .0479829     1.76   0.079     .9909949    1.179322
Kids unde..  |   1.021473   .0597604     0.36   0.716     .9108107    1.145581
             |
        age1 |   1.089052    .007926    11.72   0.000     1.073628    1.104698
        age2 |   .9472368    .026722    -1.92   0.055     .8962843    1.001086
        age3 |   1.256051   .0895767     3.20   0.001     1.092202     1.44448
      1.male |   1.133584   .0140249    10.13   0.000     1.106426    1.161408
             |
   obese4cat |
Obese I ..)  |   .7675617   .0132074   -15.37   0.000     .7421073    .7938891
Obese II..)  |   .9235133   .0248093    -2.96   0.003     .8761458    .9734416
Obese II..)  |   1.201886    .047055     4.70   0.000     1.113109    1.297742
             |
smoke_nomiss |
     Former  |   1.173033   .0158715    11.80   0.000     1.142334    1.204557
    Current  |   1.954225   .0411192    31.84   0.000     1.875272    2.036502
             |
   ethnicity |
      Mixed  |   .8331899   .0885439    -1.72   0.086     .6765284    1.026129
Asian or ..  |   .8638457   .0317072    -3.99   0.000     .8038834    .9282807
      Black  |    .767588   .0467169    -4.35   0.000     .6812749    .8648364
      Other  |   .6725632    .059428    -4.49   0.000     .5656144    .7997342
             |
         imd |
          2  |   1.114453    .020166     5.99   0.000     1.075621    1.154687
          3  |   1.158848   .0212809     8.03   0.000     1.117879    1.201317
          4  |   1.247641   .0236379    11.68   0.000     1.202161    1.294841
5 most de..  |   1.385645   .0279405    16.18   0.000     1.331951    1.441504
             |
1.htdiag_o~p |   .9562282   .0134829    -3.17   0.002      .930164    .9830227
1.~y_disease |   1.871572   .0264603    44.33   0.000     1.820423    1.924158
    1.asthma |   .9230323   .0159431    -4.64   0.000     .8923074    .9548151
1.~c_disease |   1.552287   .0196367    34.76   0.000     1.514273    1.591256
             |
     diabcat |
T1DM, con..  |   1.985005   .2288785     5.95   0.000     1.583488    2.488332
T1DM, unc..  |   2.115493   .1592643     9.95   0.000     1.825278    2.451851
T2DM, con..  |   1.289301    .019749    16.59   0.000     1.251169    1.328595
T2DM, unc..  |   1.440284   .0303676    17.30   0.000     1.381978    1.501051
Diabetes,..  |   1.669722   .2590386     3.30   0.001     1.231941    2.263073
             |
cancer_exh~t |
  Last year  |    8.10872   .1822393    93.13   0.000      7.75929    8.473886
2-5 years..  |   3.074774   .0627543    55.03   0.000     2.954205    3.200264
   5+ years  |   1.588877   .0264878    27.77   0.000     1.537801     1.64165
             |
cancer_hae~t |
  Last year  |   4.208323   .3052038    19.82   0.000     3.650704    4.851114
2-5 years..  |    2.58058   .1315026    18.60   0.000     2.335293    2.851631
   5+ years  |   1.717908    .073854    12.59   0.000     1.579088    1.868933
             |
1.~r_disease |   2.480047   .0946402    23.80   0.000     2.301323    2.672651
1.stroke_d~a |   1.681393   .0260869    33.49   0.000     1.631033    1.733308
1.other_ne~o |   2.122376   .0596381    26.78   0.000     2.008648    2.242543
             |
reduced_ki~t |
Stage 3a/..  |   1.149382    .015794    10.13   0.000     1.118839    1.180758
Stage 4/5..  |   2.347544   .0573985    34.90   0.000     2.237698    2.462782
             |
      1.esrd |   2.302442    .133325    14.40   0.000     2.055413     2.57916
1.other_tr~t |    .876688   .2071425    -0.56   0.578     .5517272    1.393047
             |
tot_adults~h |
          2  |   .9489679   .0128359    -3.87   0.000     .9241406    .9744622
          3  |   1.258175   .0251105    11.51   0.000     1.209909    1.308366
             |
  1.asplenia |    1.30707   .1158761     3.02   0.003     1.098594    1.555109
1.ra_sle_p~s |    1.11989    .022509     5.63   0.000      1.07663    1.164887
1.other_im~o |   2.234204   .1844446     9.74   0.000     1.900431    2.626599
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINF
> ULLYADJMODEL_CCeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJ
> MODEL_CCeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_mult
> ivariable_cox_models_FULL_Sense1_non_covid_death.log
  log type:  text
 closed on:   6 Aug 2020, 22:33:12
-------------------------------------------------------------------------------
