-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_mult
> ivariable_cox_models_FULL_Sense2_non_covid_death.log
  log type:  text
 opened on:   6 Aug 2020, 21:50:11

. 
. *set trace on
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string
> )] bmi(string) smoking(string)
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicitytimer clear
  4. timer on 1
  5.          stcox  `exposure' `age'                ///
>                         i.male                                               
>    ///
>                         `bmi'                                                
>    ///
>                         `smoking'                                            
>    ///
>                         `ethnicity'                                          
>    ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  6. timer off 1
  7. timer list
  8. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. foreach exposure_type in        kids_cat3  {
  4.  
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(1
> ) bmi(i.bmicat) smoking(i.smoke)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_MAINFULLYADJMODEL_CCeth_bmi_smok_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC ETHN BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCO
> ME `outcome')" 
 10.  
.  }
 11.  
.  }

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -77170.048
Iteration 1:   log pseudolikelihood =  -73322.17
Iteration 2:   log pseudolikelihood = -68701.361
Iteration 3:   log pseudolikelihood = -66450.722
Iteration 4:   log pseudolikelihood = -66335.822
Iteration 5:   log pseudolikelihood = -66333.953
Iteration 6:   log pseudolikelihood = -66333.952
Refining estimates:
Iteration 0:   log pseudolikelihood = -66333.952

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    7,374,509             Number of obs    =   7,374,509
No. of failures      =        6,124
Time at risk         =   1223550771
                                                Wald chi2(48)    =    38908.42
Log pseudolikelihood =   -66333.952             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,119,717 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .6722284   .0352492    -7.57   0.000     .6065728    .7449906
Kids unde..  |   .7089721   .0420505    -5.80   0.000     .6311647    .7963713
             |
        age1 |   1.161494   .0243242     7.15   0.000     1.114784     1.21016
        age2 |   .8953323   .0405042    -2.44   0.015     .8193632    .9783449
        age3 |   1.160892    .123642     1.40   0.161     .9421794    1.430375
      1.male |    1.44543   .0399204    13.34   0.000     1.369267    1.525829
             |
      bmicat |
Normal (..)  |   .3799065   .0239563   -15.35   0.000     .3357385    .4298849
Overweig..)  |   .2600222   .0168296   -20.81   0.000     .2290432    .2951913
Obese I ..)  |    .254662   .0174969   -19.91   0.000     .2225775    .2913715
Obese II..)  |   .2777375   .0213974   -16.63   0.000     .2388122    .3230075
Obese II..)  |   .3851592   .0316883   -11.60   0.000     .3278002     .452555
             |
       smoke |
     Former  |   1.246909   .0421048     6.53   0.000     1.167057    1.332225
    Current  |   2.017156   .0736914    19.21   0.000     1.877773    2.166885
             |
   ethnicity |
      Mixed  |   .7250838   .1090882    -2.14   0.033     .5399154    .9737571
Asian or ..  |   .8475586   .0545211    -2.57   0.010     .7471612    .9614465
      Black  |   .9419408   .0791672    -0.71   0.477     .7988823    1.110617
      Other  |   .6134244   .0811048    -3.70   0.000      .473389    .7948843
             |
         imd |
          2  |   1.100778   .0528269     2.00   0.045     1.001959    1.209342
          3  |   1.225168   .0580628     4.29   0.000     1.116493    1.344422
          4  |   1.350845   .0629557     6.45   0.000     1.232922    1.480047
5 most de..  |   1.622712   .0760722    10.33   0.000     1.480258    1.778876
             |
1.htdiag_o~p |   1.247578   .0371419     7.43   0.000     1.176864     1.32254
1.~y_disease |   1.999709   .0811175    17.08   0.000     1.846877    2.165187
    1.asthma |   1.068687    .036395     1.95   0.051     .9996825    1.142454
1.~c_disease |   1.879479   .0724195    16.38   0.000     1.742767    2.026916
             |
     diabcat |
T1DM, con..  |   2.102092   .3730865     4.19   0.000     1.484491    2.976637
T1DM, unc..  |   2.512641   .2744172     8.44   0.000     2.028462    3.112391
T2DM, con..  |    1.44954   .0693503     7.76   0.000     1.319795    1.592041
T2DM, unc..  |   1.872819   .0916982    12.81   0.000     1.701448     2.06145
Diabetes,..  |   3.802087   .9356506     5.43   0.000     2.347205    6.158758
             |
cancer_exh~t |
  Last year  |   36.70328    1.61678    81.79   0.000     33.66739    40.01293
2-5 years..  |   14.68277   .6073199    64.95   0.000     13.53942    15.92267
   5+ years  |   4.899691   .2454477    31.72   0.000     4.441485    5.405169
             |
cancer_hae~t |
  Last year  |   6.936729   1.212085    11.08   0.000     4.925163    9.769871
2-5 years..  |   4.539429   .5903877    11.63   0.000        3.518    5.857422
   5+ years  |   1.867851   .2464771     4.73   0.000     1.442181    2.419161
             |
1.~r_disease |   5.019957   .2593099    31.23   0.000       4.5366    5.554814
1.stroke_d~a |   1.952925   .1130225    11.57   0.000     1.743507    2.187498
1.other_ne~o |   2.522515   .1945414    12.00   0.000      2.16864    2.934135
             |
reduced_ki~t |
Stage 3a/..  |   1.913788   .1043575    11.90   0.000     1.719802    2.129655
Stage 4/5..  |   5.381508   .5945494    15.23   0.000     4.333743    6.682589
             |
      1.esrd |   1.634296   .2120852     3.79   0.000      1.26727    2.107621
1.other_tr~t |   .8874333   .2219736    -0.48   0.633     .5435315    1.448928
             |
tot_adults~h |
          2  |   .8285105   .0263934    -5.91   0.000     .7783622    .8818897
          3  |   .8414928   .0293113    -4.95   0.000      .785961    .9009482
             |
  1.asplenia |    1.89501   .2790283     4.34   0.000     1.419964    2.528981
1.ra_sle_p~s |   1.076379   .0540999     1.46   0.143     .9754007    1.187812
1.other_im~o |   1.735282   .2151643     4.45   0.000     1.360901    2.212656
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   6435.46 /        1 =    6435.4590

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    7,374,509             Number of obs    =   7,374,509
No. of failures      =        6,124
Time at risk         =   1223550771
                                                Wald chi2(48)    =    38908.42
Log pseudolikelihood =   -66333.952             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,119,717 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .6722284   .0352492    -7.57   0.000     .6065728    .7449906
Kids unde..  |   .7089721   .0420505    -5.80   0.000     .6311647    .7963713
             |
        age1 |   1.161494   .0243242     7.15   0.000     1.114784     1.21016
        age2 |   .8953323   .0405042    -2.44   0.015     .8193632    .9783449
        age3 |   1.160892    .123642     1.40   0.161     .9421794    1.430375
      1.male |    1.44543   .0399204    13.34   0.000     1.369267    1.525829
             |
      bmicat |
Normal (..)  |   .3799065   .0239563   -15.35   0.000     .3357385    .4298849
Overweig..)  |   .2600222   .0168296   -20.81   0.000     .2290432    .2951913
Obese I ..)  |    .254662   .0174969   -19.91   0.000     .2225775    .2913715
Obese II..)  |   .2777375   .0213974   -16.63   0.000     .2388122    .3230075
Obese II..)  |   .3851592   .0316883   -11.60   0.000     .3278002     .452555
             |
       smoke |
     Former  |   1.246909   .0421048     6.53   0.000     1.167057    1.332225
    Current  |   2.017156   .0736914    19.21   0.000     1.877773    2.166885
             |
   ethnicity |
      Mixed  |   .7250838   .1090882    -2.14   0.033     .5399154    .9737571
Asian or ..  |   .8475586   .0545211    -2.57   0.010     .7471612    .9614465
      Black  |   .9419408   .0791672    -0.71   0.477     .7988823    1.110617
      Other  |   .6134244   .0811048    -3.70   0.000      .473389    .7948843
             |
         imd |
          2  |   1.100778   .0528269     2.00   0.045     1.001959    1.209342
          3  |   1.225168   .0580628     4.29   0.000     1.116493    1.344422
          4  |   1.350845   .0629557     6.45   0.000     1.232922    1.480047
5 most de..  |   1.622712   .0760722    10.33   0.000     1.480258    1.778876
             |
1.htdiag_o~p |   1.247578   .0371419     7.43   0.000     1.176864     1.32254
1.~y_disease |   1.999709   .0811175    17.08   0.000     1.846877    2.165187
    1.asthma |   1.068687    .036395     1.95   0.051     .9996825    1.142454
1.~c_disease |   1.879479   .0724195    16.38   0.000     1.742767    2.026916
             |
     diabcat |
T1DM, con..  |   2.102092   .3730865     4.19   0.000     1.484491    2.976637
T1DM, unc..  |   2.512641   .2744172     8.44   0.000     2.028462    3.112391
T2DM, con..  |    1.44954   .0693503     7.76   0.000     1.319795    1.592041
T2DM, unc..  |   1.872819   .0916982    12.81   0.000     1.701448     2.06145
Diabetes,..  |   3.802087   .9356506     5.43   0.000     2.347205    6.158758
             |
cancer_exh~t |
  Last year  |   36.70328    1.61678    81.79   0.000     33.66739    40.01293
2-5 years..  |   14.68277   .6073199    64.95   0.000     13.53942    15.92267
   5+ years  |   4.899691   .2454477    31.72   0.000     4.441485    5.405169
             |
cancer_hae~t |
  Last year  |   6.936729   1.212085    11.08   0.000     4.925163    9.769871
2-5 years..  |   4.539429   .5903877    11.63   0.000        3.518    5.857422
   5+ years  |   1.867851   .2464771     4.73   0.000     1.442181    2.419161
             |
1.~r_disease |   5.019957   .2593099    31.23   0.000       4.5366    5.554814
1.stroke_d~a |   1.952925   .1130225    11.57   0.000     1.743507    2.187498
1.other_ne~o |   2.522515   .1945414    12.00   0.000      2.16864    2.934135
             |
reduced_ki~t |
Stage 3a/..  |   1.913788   .1043575    11.90   0.000     1.719802    2.129655
Stage 4/5..  |   5.381508   .5945494    15.23   0.000     4.333743    6.682589
             |
      1.esrd |   1.634296   .2120852     3.79   0.000      1.26727    2.107621
1.other_tr~t |   .8874333   .2219736    -0.48   0.633     .5435315    1.448928
             |
tot_adults~h |
          2  |   .8285105   .0263934    -5.91   0.000     .7783622    .8818897
          3  |   .8414928   .0293113    -4.95   0.000      .785961    .9009482
             |
  1.asplenia |    1.89501   .2790283     4.34   0.000     1.419964    2.528981
1.ra_sle_p~s |   1.076379   .0540999     1.46   0.143     .9754007    1.187812
1.other_im~o |   1.735282   .2151643     4.45   0.000     1.360901    2.212656
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINF
> ULLYADJMODEL_CCeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJ
> MODEL_CCeth_bmi_smok_ageband_0.ster saved

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -328653.04
Iteration 1:   log pseudolikelihood = -310579.36
Iteration 2:   log pseudolikelihood = -305670.04
Iteration 3:   log pseudolikelihood = -305463.87
Iteration 4:   log pseudolikelihood = -305461.21
Iteration 5:   log pseudolikelihood = -305461.21
Refining estimates:
Iteration 0:   log pseudolikelihood = -305461.21

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,291,630             Number of obs    =   2,291,630
No. of failures      =       28,698
Time at risk         =    377477353
                                                Wald chi2(48)    =    67948.95
Log pseudolikelihood =   -305461.21             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,832,205 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.110719   .0513333     2.27   0.023      1.01453    1.216028
Kids unde..  |   .9999974   .0616895    -0.00   1.000     .8861119     1.12852
             |
        age1 |    1.08523   .0082149    10.81   0.000     1.069248    1.101451
        age2 |   .9532504   .0280198    -1.63   0.103     .8998846    1.009781
        age3 |   1.222396     .09093     2.70   0.007      1.05656    1.414263
      1.male |   1.215532   .0158105    15.01   0.000     1.184936    1.246919
             |
      bmicat |
Normal (..)  |   .4507078   .0118644   -30.27   0.000     .4280437     .474572
Overweig..)  |   .3027932   .0083109   -43.53   0.000     .2869344    .3195284
Obese I ..)  |   .3012916   .0090653   -39.87   0.000     .2840377    .3195937
Obese II..)  |   .3601505   .0131596   -27.95   0.000     .3352601    .3868888
Obese II..)  |   .4655156   .0215996   -16.48   0.000     .4250491    .5098347
             |
       smoke |
     Former  |   1.190563   .0168622    12.32   0.000     1.157968    1.224075
    Current  |   1.793812   .0399619    26.23   0.000     1.717174    1.873871
             |
   ethnicity |
      Mixed  |   .8458987    .092856    -1.52   0.127     .6821507    1.048954
Asian or ..  |   .8317036   .0318581    -4.81   0.000     .7715491    .8965481
      Black  |   .7792891    .048901    -3.97   0.000     .6891044    .8812765
      Other  |   .6911488   .0619777    -4.12   0.000     .5797509    .8239516
             |
         imd |
          2  |   1.105585   .0208448     5.32   0.000     1.065476    1.147204
          3  |   1.153036   .0220278     7.45   0.000     1.110661    1.197028
          4  |   1.239897   .0244005    10.93   0.000     1.192984    1.288656
5 most de..  |   1.371297   .0287197    15.08   0.000     1.316147    1.428758
             |
1.htdiag_o~p |   1.000737   .0148757     0.05   0.960     .9720016    1.030321
1.~y_disease |   1.789106   .0261473    39.80   0.000     1.738585    1.841095
    1.asthma |   .9384843   .0166636    -3.58   0.000      .906386    .9717193
1.~c_disease |   1.574536   .0206234    34.66   0.000      1.53463    1.615481
             |
     diabcat |
T1DM, con..  |   2.071074   .2352116     6.41   0.000     1.657772    2.587417
T1DM, unc..  |   2.216756   .1666208    10.59   0.000     1.913102    2.568608
T2DM, con..  |   1.354741   .0213861    19.23   0.000     1.313467    1.397312
T2DM, unc..  |   1.519546   .0329834    19.28   0.000     1.456256    1.585587
Diabetes,..  |   1.760967   .2830613     3.52   0.000     1.285072    2.413098
             |
cancer_exh~t |
  Last year  |   8.078912    .188378    89.60   0.000     7.718007    8.456692
2-5 years..  |    3.10126   .0651905    53.84   0.000     2.976086      3.2317
   5+ years  |   1.591642   .0275206    26.88   0.000     1.538606    1.646506
             |
cancer_hae~t |
  Last year  |   4.178557   .3169175    18.85   0.000     3.601372    4.848246
2-5 years..  |   2.569546   .1349119    17.97   0.000     2.318274    2.848052
   5+ years  |   1.726547   .0759305    12.42   0.000      1.58396    1.881971
             |
1.~r_disease |   2.460416   .0959444    23.09   0.000     2.279375    2.655836
1.stroke_d~a |   1.660086    .026641    31.58   0.000     1.608683    1.713131
1.other_ne~o |   2.050575   .0607611    24.24   0.000     1.934877     2.17319
             |
reduced_ki~t |
Stage 3a/..  |   1.193297   .0170897    12.34   0.000     1.160267    1.227267
Stage 4/5..  |   2.473643   .0621255    36.06   0.000     2.354828    2.598454
             |
      1.esrd |   2.191253   .1296966    13.25   0.000     1.951243    2.460786
1.other_tr~t |   .8537957   .2040323    -0.66   0.508     .5344925    1.363849
             |
tot_adults~h |
          2  |    .962067    .013504    -2.76   0.006     .9359604    .9889019
          3  |   1.269129   .0262723    11.51   0.000     1.218667     1.32168
             |
  1.asplenia |   1.285797   .1177103     2.75   0.006     1.074603    1.538498
1.ra_sle_p~s |   1.113631   .0231221     5.18   0.000     1.069223    1.159885
1.other_im~o |   2.205838   .1856529     9.40   0.000     1.870393    2.601444
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   8589.20 /        2 =    4294.6015

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,291,630             Number of obs    =   2,291,630
No. of failures      =       28,698
Time at risk         =    377477353
                                                Wald chi2(48)    =    67948.95
Log pseudolikelihood =   -305461.21             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,832,205 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.110719   .0513333     2.27   0.023      1.01453    1.216028
Kids unde..  |   .9999974   .0616895    -0.00   1.000     .8861119     1.12852
             |
        age1 |    1.08523   .0082149    10.81   0.000     1.069248    1.101451
        age2 |   .9532504   .0280198    -1.63   0.103     .8998846    1.009781
        age3 |   1.222396     .09093     2.70   0.007      1.05656    1.414263
      1.male |   1.215532   .0158105    15.01   0.000     1.184936    1.246919
             |
      bmicat |
Normal (..)  |   .4507078   .0118644   -30.27   0.000     .4280437     .474572
Overweig..)  |   .3027932   .0083109   -43.53   0.000     .2869344    .3195284
Obese I ..)  |   .3012916   .0090653   -39.87   0.000     .2840377    .3195937
Obese II..)  |   .3601505   .0131596   -27.95   0.000     .3352601    .3868888
Obese II..)  |   .4655156   .0215996   -16.48   0.000     .4250491    .5098347
             |
       smoke |
     Former  |   1.190563   .0168622    12.32   0.000     1.157968    1.224075
    Current  |   1.793812   .0399619    26.23   0.000     1.717174    1.873871
             |
   ethnicity |
      Mixed  |   .8458987    .092856    -1.52   0.127     .6821507    1.048954
Asian or ..  |   .8317036   .0318581    -4.81   0.000     .7715491    .8965481
      Black  |   .7792891    .048901    -3.97   0.000     .6891044    .8812765
      Other  |   .6911488   .0619777    -4.12   0.000     .5797509    .8239516
             |
         imd |
          2  |   1.105585   .0208448     5.32   0.000     1.065476    1.147204
          3  |   1.153036   .0220278     7.45   0.000     1.110661    1.197028
          4  |   1.239897   .0244005    10.93   0.000     1.192984    1.288656
5 most de..  |   1.371297   .0287197    15.08   0.000     1.316147    1.428758
             |
1.htdiag_o~p |   1.000737   .0148757     0.05   0.960     .9720016    1.030321
1.~y_disease |   1.789106   .0261473    39.80   0.000     1.738585    1.841095
    1.asthma |   .9384843   .0166636    -3.58   0.000      .906386    .9717193
1.~c_disease |   1.574536   .0206234    34.66   0.000      1.53463    1.615481
             |
     diabcat |
T1DM, con..  |   2.071074   .2352116     6.41   0.000     1.657772    2.587417
T1DM, unc..  |   2.216756   .1666208    10.59   0.000     1.913102    2.568608
T2DM, con..  |   1.354741   .0213861    19.23   0.000     1.313467    1.397312
T2DM, unc..  |   1.519546   .0329834    19.28   0.000     1.456256    1.585587
Diabetes,..  |   1.760967   .2830613     3.52   0.000     1.285072    2.413098
             |
cancer_exh~t |
  Last year  |   8.078912    .188378    89.60   0.000     7.718007    8.456692
2-5 years..  |    3.10126   .0651905    53.84   0.000     2.976086      3.2317
   5+ years  |   1.591642   .0275206    26.88   0.000     1.538606    1.646506
             |
cancer_hae~t |
  Last year  |   4.178557   .3169175    18.85   0.000     3.601372    4.848246
2-5 years..  |   2.569546   .1349119    17.97   0.000     2.318274    2.848052
   5+ years  |   1.726547   .0759305    12.42   0.000      1.58396    1.881971
             |
1.~r_disease |   2.460416   .0959444    23.09   0.000     2.279375    2.655836
1.stroke_d~a |   1.660086    .026641    31.58   0.000     1.608683    1.713131
1.other_ne~o |   2.050575   .0607611    24.24   0.000     1.934877     2.17319
             |
reduced_ki~t |
Stage 3a/..  |   1.193297   .0170897    12.34   0.000     1.160267    1.227267
Stage 4/5..  |   2.473643   .0621255    36.06   0.000     2.354828    2.598454
             |
      1.esrd |   2.191253   .1296966    13.25   0.000     1.951243    2.460786
1.other_tr~t |   .8537957   .2040323    -0.66   0.508     .5344925    1.363849
             |
tot_adults~h |
          2  |    .962067    .013504    -2.76   0.006     .9359604    .9889019
          3  |   1.269129   .0262723    11.51   0.000     1.218667     1.32168
             |
  1.asplenia |   1.285797   .1177103     2.75   0.006     1.074603    1.538498
1.ra_sle_p~s |   1.113631   .0231221     5.18   0.000     1.069223    1.159885
1.other_im~o |   2.205838   .1856529     9.40   0.000     1.870393    2.601444
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINF
> ULLYADJMODEL_CCeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_non_covid_death_kids_cat3_MAINFULLYADJ
> MODEL_CCeth_bmi_smok_ageband_1.ster saved

. 
. 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_mult
> ivariable_cox_models_FULL_Sense2_non_covid_death.log
  log type:  text
 closed on:   7 Aug 2020, 00:14:18
-------------------------------------------------------------------------------
