-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_mult
> ivariable_cox_models_covid_death.log
  log type:  text
 opened on:   6 Aug 2020, 21:50:10

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string
> )] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                ///
>                         i.male                                               
>    ///
>                         `bmi'                                                
>    ///
>                         `smoking'                                            
>    ///
>                         `ethnicity'                                          
>    ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in        kids_cat3  {
  4. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0
> ) bmi(i.obese4cat) smoking(i.smoke_nomiss)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_MAINFULLYADJMODEL_noeth_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.         /*  Proportional Hazards test  */
.         * Based on Schoenfeld residuals
.         timer clear 
  9.         timer on 1
 10.         if e(N_fail)>0 estat phtest, d
 11.         timer off 1
 12.         timer list
 13. }
 14. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 15. 
. }
 16. 
. *SENSITIVITY ANALYSIS: 12 months FUP
. drop if has_12_m_follow_up == .
 17. foreach exposure_type in kids_cat3   {
 18. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ethnicity(
> 0) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 19. if _rc==0{
 20. estimates
 21. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_MAINFULLYADJMODEL_noeth_12mo_ageband_`x', replace
 22. *estat concordance /*c-statistic*/
. }
 23. else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outc
> ome')"
 24. 
. 
. }       
 25. 
.  
.  
.  foreach exposure_type in       gp_number_kids {
 26. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0
> ) bmi(i.obese4cat) smoking(i.smoke_nomiss)
 27. if _rc==0{
 28. estimates
 29. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_MAINFULLYADJMODEL_noeth_ageband_`x', replace
 30. }
 31. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 32. }
 33. 
. }
   1:   4652.06 /        1 =    4652.0560

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,895,119             Number of obs    =  11,895,119
No. of failures      =        1,347
Time at risk         =   1973675373
                                                Wald chi2(42)    =     7666.21
Log pseudolikelihood =   -15645.745             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 6,799,224 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .8201052   .0803788    -2.02   0.043     .6767729    .9937935
Kids unde..  |   .9774017   .1058924    -0.21   0.833     .7904116    1.208629
             |
        age1 |   1.183045    .050797     3.91   0.000     1.087559    1.286915
        age2 |   .8927586   .0829999    -1.22   0.222     .7440424      1.0712
        age3 |   1.191011   .2611792     0.80   0.425     .7749147    1.830533
      1.male |   1.784859   .1053627     9.81   0.000     1.589851    2.003787
             |
   obese4cat |
Obese I ..)  |   1.104712   .0830985     1.32   0.186     .9532791      1.2802
Obese II..)  |    1.81518   .1566755     6.91   0.000     1.532671    2.149762
Obese II..)  |   2.133403   .2209828     7.32   0.000      1.74142    2.613619
             |
smoke_nomiss |
     Former  |   .9871402   .0607189    -0.21   0.833     .8750272    1.113618
    Current  |   .7156893   .0586028    -4.09   0.000     .6095727     .840279
             |
         imd |
          2  |   1.166083   .1236741     1.45   0.147     .9472219    1.435514
          3  |    1.30084   .1353461     2.53   0.011     1.060866    1.595098
          4  |   1.800163    .176343     6.00   0.000     1.485691    2.181198
5 most de..  |   1.953158   .1983211     6.59   0.000     1.600691    2.383237
             |
1.htdiag_o~p |   1.302152   .0832249     4.13   0.000     1.148837    1.475927
1.~y_disease |    2.48332   .2168282    10.42   0.000     2.092719    2.946825
    1.asthma |   1.121901   .0802774     1.61   0.108     .9750955     1.29081
1.~c_disease |   1.594594   .1281757     5.81   0.000     1.362164    1.866684
             |
     diabcat |
T1DM, con..  |   2.066517   .7961504     1.88   0.060     .9711884    4.397183
T1DM, unc..  |   2.777305   .6058585     4.68   0.000     1.811078    4.259023
T2DM, con..  |   2.035505   .1778466     8.13   0.000     1.715144    2.415703
T2DM, unc..  |   3.193848   .2695206    13.76   0.000     2.706971    3.768296
Diabetes,..  |   4.196175   1.768099     3.40   0.001     1.837349    9.583312
             |
cancer_exh~t |
  Last year  |   4.874515   .8550683     9.03   0.000     3.456344    6.874575
2-5 years..  |   2.654267   .3728794     6.95   0.000     2.015419    3.495618
   5+ years  |   1.533931    .224981     2.92   0.004     1.150696    2.044802
             |
cancer_hae~t |
  Last year  |   6.681139   2.586196     4.91   0.000     3.128669    14.26729
2-5 years..  |   6.069561   1.452191     7.54   0.000     3.797524    9.700945
   5+ years  |   2.164815   .5799843     2.88   0.004     1.280478    3.659903
             |
1.~r_disease |   3.260241   .4197058     9.18   0.000     2.533206    4.195935
1.stroke_d~a |   1.770365   .2078848     4.86   0.000     1.406405    2.228512
1.other_ne~o |   4.539211   .5691316    12.07   0.000     3.550224    5.803701
             |
reduced_ki~t |
Stage 3a/..  |   2.655775   .2526455    10.27   0.000     2.204022    3.200123
Stage 4/5..  |   6.307006   1.157899    10.03   0.000     4.401003    9.038467
             |
      1.esrd |   2.349132   .4777788     4.20   0.000     1.576833    3.499688
1.other_tr~t |    .837689   .4000478    -0.37   0.711     .3285352    2.135914
             |
tot_adults~h |
          2  |   .8674294   .0632553    -1.95   0.051     .7519037    1.000705
          3  |   1.157272   .0811262     2.08   0.037     1.008707    1.327718
             |
  1.asplenia |    1.55874   .6032861     1.15   0.251     .7300113    3.328266
1.ra_sle_p~s |   1.198176   .1201674     1.80   0.071     .9843559    1.458443
1.other_im~o |   2.743825   .5857086     4.73   0.000      1.80574    4.169246
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLY
> ADJMODEL_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODE
> L_noeth_ageband_0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.01524         0.40        1         0.5280
      2.kids_cat3 |     -0.01104         0.19        1         0.6610
      age1        |      0.00857         0.11        1         0.7352
      age2        |     -0.00714         0.08        1         0.7765
      age3        |      0.00632         0.06        1         0.8023
      0b.male     |            .            .        1             .
      1.male      |     -0.04279         2.98        1         0.0843
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.08607        12.31        1         0.0005
      3.obese4cat |     -0.06547         7.17        1         0.0074
      4.obese4cat |     -0.07789        11.02        1         0.0009
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.03471         1.72        1         0.1896
      3.smoke_no~s|      0.07932         9.13        1         0.0025
      1b.imd      |            .            .        1             .
      2.imd       |      0.04612         3.02        1         0.0821
      3.imd       |      0.04383         2.86        1         0.0909
      4.imd       |      0.04725         3.29        1         0.0697
      5.imd       |      0.06953         7.38        1         0.0066
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.03042         1.55        1         0.2128
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.00274         0.01        1         0.9086
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.02244         0.83        1         0.3629
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.02562         1.19        1         0.2760
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02307         0.79        1         0.3734
      3.diabcat   |     -0.00818         0.10        1         0.7463
      4.diabcat   |     -0.05013         4.22        1         0.0398
      5.diabcat   |     -0.04479         3.87        1         0.0492
      6.diabcat   |      0.01088         0.19        1         0.6658
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.03717         2.13        1         0.1440
      3.cancer_e~t|      0.04494         3.19        1         0.0739
      4.cancer_e~t|      0.05442         4.45        1         0.0349
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.02851         1.27        1         0.2595
      3.cancer_h~t|     -0.02511         1.01        1         0.3142
      4.cancer_h~t|      0.00138         0.00        1         0.9567
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.04824         4.19        1         0.0406
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01843         0.65        1         0.4195
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.00381         0.03        1         0.8715
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.00644         0.07        1         0.7967
      3.reduced_~t|      0.00222         0.01        1         0.9174
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.01454         0.45        1         0.5024
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00795         0.11        1         0.7361
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.01394         0.29        1         0.5894
      3.tot_adul~h|      0.00632         0.06        1         0.8145
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.00101         0.00        1         0.9685
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.01847         0.51        1         0.4759
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.02774         1.30        1         0.2547
      ------------+---------------------------------------------------
      global test |                     79.85       42         0.0004
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   6111.80 /        1 =    6111.7960
(0 observations deleted)
   1:   4357.75 /        1 =    4357.7540

--------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,895,119             Number of obs    =  11,895,119
No. of failures      =        1,347
Time at risk         =   1973675373
                                                Wald chi2(42)    =     7666.21
Log pseudolikelihood =   -15645.745             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,799,224 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8201052   .0803788    -2.02   0.043     .6767729    .9937935
               Kids under 18  |   .9774017   .1058924    -0.21   0.833     .7904116    1.208629
                              |
                         age1 |   1.183045    .050797     3.91   0.000     1.087559    1.286915
                         age2 |   .8927586   .0829999    -1.22   0.222     .7440424      1.0712
                         age3 |   1.191011   .2611792     0.80   0.425     .7749147    1.830533
                       1.male |   1.784859   .1053627     9.81   0.000     1.589851    2.003787
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.104712   .0830985     1.32   0.186     .9532791      1.2802
          Obese II (35-39.9)  |    1.81518   .1566755     6.91   0.000     1.532671    2.149762
             Obese III (40+)  |   2.133403   .2209828     7.32   0.000      1.74142    2.613619
                              |
                 smoke_nomiss |
                      Former  |   .9871402   .0607189    -0.21   0.833     .8750272    1.113618
                     Current  |   .7156893   .0586028    -4.09   0.000     .6095727     .840279
                              |
                          imd |
                           2  |   1.166083   .1236741     1.45   0.147     .9472219    1.435514
                           3  |    1.30084   .1353461     2.53   0.011     1.060866    1.595098
                           4  |   1.800163    .176343     6.00   0.000     1.485691    2.181198
             5 most deprived  |   1.953158   .1983211     6.59   0.000     1.600691    2.383237
                              |
           1.htdiag_or_highbp |   1.302152   .0832249     4.13   0.000     1.148837    1.475927
1.chronic_respiratory_disease |    2.48332   .2168282    10.42   0.000     2.092719    2.946825
                     1.asthma |   1.121901   .0802774     1.61   0.108     .9750955     1.29081
    1.chronic_cardiac_disease |   1.594594   .1281757     5.81   0.000     1.362164    1.866684
                              |
                      diabcat |
            T1DM, controlled  |   2.066517   .7961504     1.88   0.060     .9711884    4.397183
          T1DM, uncontrolled  |   2.777305   .6058585     4.68   0.000     1.811078    4.259023
            T2DM, controlled  |   2.035505   .1778466     8.13   0.000     1.715144    2.415703
          T2DM, uncontrolled  |   3.193848   .2695206    13.76   0.000     2.706971    3.768296
          Diabetes, no HbA1c  |   4.196175   1.768099     3.40   0.001     1.837349    9.583312
                              |
            cancer_exhaem_cat |
                   Last year  |   4.874515   .8550683     9.03   0.000     3.456344    6.874575
               2-5 years ago  |   2.654267   .3728794     6.95   0.000     2.015419    3.495618
                    5+ years  |   1.533931    .224981     2.92   0.004     1.150696    2.044802
                              |
              cancer_haem_cat |
                   Last year  |   6.681139   2.586196     4.91   0.000     3.128669    14.26729
               2-5 years ago  |   6.069561   1.452191     7.54   0.000     3.797524    9.700945
                    5+ years  |   2.164815   .5799843     2.88   0.004     1.280478    3.659903
                              |
      1.chronic_liver_disease |   3.260241   .4197058     9.18   0.000     2.533206    4.195935
            1.stroke_dementia |   1.770365   .2078848     4.86   0.000     1.406405    2.228512
                1.other_neuro |   4.539211   .5691316    12.07   0.000     3.550224    5.803701
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.655775   .2526455    10.27   0.000     2.204022    3.200123
           Stage 4/5 egfr<30  |   6.307006   1.157899    10.03   0.000     4.401003    9.038467
                              |
                       1.esrd |   2.349132   .4777788     4.20   0.000     1.576833    3.499688
           1.other_transplant |    .837689   .4000478    -0.37   0.711     .3285352    2.135914
                              |
                tot_adults_hh |
                           2  |   .8674294   .0632553    -1.95   0.051     .7519037    1.000705
                           3  |   1.157272   .0811262     2.08   0.037     1.008707    1.327718
                              |
                   1.asplenia |    1.55874   .6032861     1.15   0.251     .7300113    3.328266
           1.ra_sle_psoriasis |   1.198176   .1201674     1.80   0.071     .9843559    1.458443
               1.other_immuno |   2.743825   .5857086     4.73   0.000      1.80574    4.169246
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_0.ster saved
   1:   4408.85 /        1 =    4408.8470

--------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,895,119             Number of obs    =  11,895,119
No. of failures      =        1,347
Time at risk         =   1973675373
                                                Wald chi2(44)    =     7667.68
Log pseudolikelihood =   -15645.513             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,799,224 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |   .9772347   .1058767    -0.21   0.832     .7902727    1.208428
                 1 child <12  |   .8561886    .098136    -1.35   0.176     .6839195     1.07185
              2 children <12  |   .7699633   .1295175    -1.55   0.120     .5537162    1.070663
             3+ children <12  |   .7388955   .2190746    -1.02   0.307     .4132481    1.321159
                              |
                         age1 |   1.184242   .0510231     3.92   0.000     1.088344    1.288589
                         age2 |   .8900449   .0831608    -1.25   0.213     .7411062    1.068916
                         age3 |   1.200337   .2646168     0.83   0.407     .7792094    1.849066
                       1.male |   1.785279   .1053969     9.82   0.000     1.590208    2.004279
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.104681   .0831108     1.32   0.186     .9532279    1.280198
          Obese II (35-39.9)  |   1.814878    .156654     6.91   0.000     1.532409    2.149415
             Obese III (40+)  |   2.132675   .2209672     7.31   0.000      1.74073    2.612871
                              |
                 smoke_nomiss |
                      Former  |   .9867144   .0607079    -0.22   0.828     .8746234    1.113171
                     Current  |    .715301   .0585848    -4.09   0.000      .609219    .8398548
                              |
                          imd |
                           2  |   1.166106   .1236768     1.45   0.147     .9472393    1.435543
                           3  |   1.300783   .1353695     2.53   0.012     1.060773    1.595098
                           4  |   1.800329   .1763456     6.00   0.000     1.485851    2.181367
             5 most deprived  |   1.953649   .1983723     6.60   0.000     1.601092     2.38384
                              |
           1.htdiag_or_highbp |   1.302015   .0832047     4.13   0.000     1.148736    1.475746
1.chronic_respiratory_disease |   2.483588   .2168639    10.42   0.000     2.092925    2.947171
                     1.asthma |   1.121931   .0802745     1.61   0.108     .9751295    1.290832
    1.chronic_cardiac_disease |   1.594793   .1281895     5.81   0.000     1.362337    1.866912
                              |
                      diabcat |
            T1DM, controlled  |   2.068094   .7967376     1.89   0.059     .9719484    4.400454
          T1DM, uncontrolled  |    2.77735   .6058283     4.68   0.000     1.811159    4.258971
            T2DM, controlled  |   2.036171   .1778956     8.14   0.000     1.715721    2.416472
          T2DM, uncontrolled  |    3.19477   .2695521    13.77   0.000     2.707829    3.769276
          Diabetes, no HbA1c  |   4.194044   1.767177     3.40   0.001     1.836436    9.578339
                              |
            cancer_exhaem_cat |
                   Last year  |   4.875536   .8552957     9.03   0.000     3.457001    6.876148
               2-5 years ago  |   2.653588     .37276     6.95   0.000     2.014939    3.494662
                    5+ years  |    1.53397    .224973     2.92   0.004     1.150745    2.044818
                              |
              cancer_haem_cat |
                   Last year  |    6.66846    2.58236     4.90   0.000     3.121748     14.2447
               2-5 years ago  |   6.063345   1.450739     7.53   0.000     3.793591    9.691121
                    5+ years  |   2.165669   .5801941     2.88   0.004     1.281005    3.661284
                              |
      1.chronic_liver_disease |   3.260151   .4196944     9.18   0.000     2.533136     4.19582
            1.stroke_dementia |   1.770169    .207855     4.86   0.000      1.40626    2.228249
                1.other_neuro |   4.538455   .5690526    12.06   0.000     3.549608    5.802774
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.656298   .2527262    10.27   0.000     2.204406    3.200826
           Stage 4/5 egfr<30  |   6.313533   1.159745    10.03   0.000     4.404672     9.04964
                              |
                       1.esrd |   2.347157   .4774831     4.19   0.000     1.575367    3.497054
           1.other_transplant |   .8377618   .4001125    -0.37   0.711     .3285407    2.136249
                              |
                tot_adults_hh |
                           2  |   .8680075   .0632993    -1.94   0.052     .7524017    1.001376
                           3  |    1.15778    .081141     2.09   0.037     1.009186    1.328254
                              |
                   1.asplenia |   1.558465   .6031924     1.15   0.252     .7298707    3.327732
           1.ra_sle_psoriasis |     1.1979   .1201255     1.80   0.072     .9841518    1.458073
               1.other_immuno |   2.744358    .585825     4.73   0.000     1.806088    4.170064
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_0.ster saved
   1:   1546.86 /        1 =    1546.8610

--------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,310,484             Number of obs    =   3,310,484
No. of failures      =        7,338
Time at risk         =    545061384
                                                Wald chi2(42)    =    15642.47
Log pseudolikelihood =   -80895.552             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,508,446 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8897329   .0791762    -1.31   0.189     .7473298    1.059271
               Kids under 18  |   .8265763   .1021748    -1.54   0.123     .6487303    1.053178
                              |
                         age1 |   1.048137   .0161476     3.05   0.002     1.016962    1.080269
                         age2 |   1.229416   .0733322     3.46   0.001     1.093771    1.381883
                         age3 |   .5973547    .089853    -3.43   0.001     .4448321    .8021738
                       1.male |   1.748715   .0446803    21.87   0.000     1.663299    1.838516
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.097624   .0347879     2.94   0.003     1.031516     1.16797
          Obese II (35-39.9)  |   1.449462   .0678992     7.92   0.000     1.322309    1.588843
             Obese III (40+)  |   1.989538    .131077    10.44   0.000     1.748528    2.263769
                              |
                 smoke_nomiss |
                      Former  |   1.243968   .0337269     8.05   0.000      1.17959    1.311859
                     Current  |   1.083412   .0565192     1.54   0.125     .9781115    1.200049
                              |
                          imd |
                           2  |   1.102533   .0423481     2.54   0.011     1.022579    1.188738
                           3  |   1.221095   .0467385     5.22   0.000     1.132841    1.316224
                           4  |   1.408859   .0544844     8.86   0.000     1.306018    1.519798
             5 most deprived  |   1.623002   .0662928    11.86   0.000     1.498136    1.758276
                              |
           1.htdiag_or_highbp |   .8974976   .0261848    -3.71   0.000     .8476161    .9503145
1.chronic_respiratory_disease |   1.804131   .0518357    20.54   0.000     1.705342    1.908642
                     1.asthma |   1.096673   .0364223     2.78   0.005     1.027561    1.170434
    1.chronic_cardiac_disease |   1.389341   .0355776    12.84   0.000     1.321331    1.460851
                              |
                      diabcat |
            T1DM, controlled  |   1.814102    .404501     2.67   0.008     1.171829    2.808401
          T1DM, uncontrolled  |    2.80297   .3794993     7.61   0.000     2.149675    3.654805
            T2DM, controlled  |   1.455003   .0434417    12.56   0.000     1.372303    1.542688
          T2DM, uncontrolled  |   1.992459   .0740502    18.55   0.000     1.852483    2.143011
          Diabetes, no HbA1c  |   2.337827   .5919434     3.35   0.001     1.423266    3.840066
                              |
            cancer_exhaem_cat |
                   Last year  |   2.220994   .1608918    11.02   0.000     1.927015    2.559821
               2-5 years ago  |   1.248224   .0691646     4.00   0.000     1.119766    1.391419
                    5+ years  |   1.055741   .0384753     1.49   0.137     .9829612     1.13391
                              |
              cancer_haem_cat |
                   Last year  |   3.627731   .5677859     8.23   0.000     2.669385    4.930137
               2-5 years ago  |   2.546655   .2649619     8.98   0.000     2.076866    3.122711
                    5+ years  |   1.596746   .1447548     5.16   0.000     1.336809    1.907228
                              |
      1.chronic_liver_disease |   2.073214   .1744361     8.67   0.000     1.758028    2.444908
            1.stroke_dementia |   1.676057   .0523018    16.55   0.000     1.576619    1.781766
                1.other_neuro |   2.430907   .1269737    17.01   0.000     2.194358    2.692955
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.302797   .0358915     9.60   0.000     1.234316    1.375077
           Stage 4/5 egfr<30  |   2.487513   .1187023    19.10   0.000     2.265409    2.731392
                              |
                       1.esrd |   3.519511   .3145067    14.08   0.000     2.954052    4.193209
           1.other_transplant |   1.680887   .5666766     1.54   0.123     .8681076    3.254646
                              |
                tot_adults_hh |
                           2  |    .792312   .0219916    -8.39   0.000     .7503607    .8366088
                           3  |   1.144737   .0449862     3.44   0.001     1.059876    1.236393
                              |
                   1.asplenia |   1.150009   .2366019     0.68   0.497     .7683791    1.721181
           1.ra_sle_psoriasis |    1.22698   .0488089     5.14   0.000     1.134951    1.326472
               1.other_immuno |   1.835167   .3366119     3.31   0.001      1.28099    2.629091
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_ageband_1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |     -0.03792        11.34        1         0.0008
      2.kids_cat3 |      0.00146         0.02        1         0.8974
      age1        |      0.00001         0.00        1         0.9994
      age2        |      0.00735         0.40        1         0.5257
      age3        |     -0.00633         0.30        1         0.5851
      0b.male     |            .            .        1             .
      1.male      |     -0.05658        25.56        1         0.0000
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.04410        14.36        1         0.0002
      3.obese4cat |     -0.02021         3.07        1         0.0798
      4.obese4cat |     -0.02485         4.58        1         0.0323
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01549         1.75        1         0.1863
      3.smoke_no~s|      0.01137         0.96        1         0.3272
      1b.imd      |            .            .        1             .
      2.imd       |      0.00159         0.02        1         0.8886
      3.imd       |      0.00121         0.01        1         0.9160
      4.imd       |     -0.01130         0.98        1         0.3217
      5.imd       |      0.00683         0.37        1         0.5445
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.01521         1.78        1         0.1818
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.00704         0.39        1         0.5316
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01131         0.96        1         0.3260
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.02292         4.26        1         0.0390
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01858         2.73        1         0.0983
      3.diabcat   |     -0.00511         0.20        1         0.6545
      4.diabcat   |     -0.01606         1.94        1         0.1631
      5.diabcat   |     -0.01138         0.99        1         0.3202
      6.diabcat   |     -0.01075         0.88        1         0.3486
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.01082         0.91        1         0.3413
      3.cancer_e~t|      0.00473         0.17        1         0.6806
      4.cancer_e~t|      0.02588         5.05        1         0.0247
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.00434         0.15        1         0.6999
      3.cancer_h~t|     -0.00659         0.33        1         0.5636
      4.cancer_h~t|     -0.00565         0.24        1         0.6227
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.01068         0.89        1         0.3464
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01612         2.18        1         0.1401
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00748         0.46        1         0.4965
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.03605        10.68        1         0.0011
      3.reduced_~t|     -0.02665         6.16        1         0.0131
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00971         0.71        1         0.4009
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00870         0.58        1         0.4458
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01421         1.68        1         0.1947
      3.tot_adul~h|      0.03412        10.80        1         0.0010
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.02296         3.98        1         0.0459
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00801         0.48        1         0.4867
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00860         0.58        1         0.4467
      ------------+---------------------------------------------------
      global test |                    182.22       42         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:   2782.73 /        1 =    2782.7310
(0 observations deleted)
   1:   1553.18 /        1 =    1553.1850

--------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,310,484             Number of obs    =   3,310,484
No. of failures      =        7,338
Time at risk         =    545061384
                                                Wald chi2(42)    =    15642.47
Log pseudolikelihood =   -80895.552             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,508,446 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .8897329   .0791762    -1.31   0.189     .7473298    1.059271
               Kids under 18  |   .8265763   .1021748    -1.54   0.123     .6487303    1.053178
                              |
                         age1 |   1.048137   .0161476     3.05   0.002     1.016962    1.080269
                         age2 |   1.229416   .0733322     3.46   0.001     1.093771    1.381883
                         age3 |   .5973547    .089853    -3.43   0.001     .4448321    .8021738
                       1.male |   1.748715   .0446803    21.87   0.000     1.663299    1.838516
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.097624   .0347879     2.94   0.003     1.031516     1.16797
          Obese II (35-39.9)  |   1.449462   .0678992     7.92   0.000     1.322309    1.588843
             Obese III (40+)  |   1.989538    .131077    10.44   0.000     1.748528    2.263769
                              |
                 smoke_nomiss |
                      Former  |   1.243968   .0337269     8.05   0.000      1.17959    1.311859
                     Current  |   1.083412   .0565192     1.54   0.125     .9781115    1.200049
                              |
                          imd |
                           2  |   1.102533   .0423481     2.54   0.011     1.022579    1.188738
                           3  |   1.221095   .0467385     5.22   0.000     1.132841    1.316224
                           4  |   1.408859   .0544844     8.86   0.000     1.306018    1.519798
             5 most deprived  |   1.623002   .0662928    11.86   0.000     1.498136    1.758276
                              |
           1.htdiag_or_highbp |   .8974976   .0261848    -3.71   0.000     .8476161    .9503145
1.chronic_respiratory_disease |   1.804131   .0518357    20.54   0.000     1.705342    1.908642
                     1.asthma |   1.096673   .0364223     2.78   0.005     1.027561    1.170434
    1.chronic_cardiac_disease |   1.389341   .0355776    12.84   0.000     1.321331    1.460851
                              |
                      diabcat |
            T1DM, controlled  |   1.814102    .404501     2.67   0.008     1.171829    2.808401
          T1DM, uncontrolled  |    2.80297   .3794993     7.61   0.000     2.149675    3.654805
            T2DM, controlled  |   1.455003   .0434417    12.56   0.000     1.372303    1.542688
          T2DM, uncontrolled  |   1.992459   .0740502    18.55   0.000     1.852483    2.143011
          Diabetes, no HbA1c  |   2.337827   .5919434     3.35   0.001     1.423266    3.840066
                              |
            cancer_exhaem_cat |
                   Last year  |   2.220994   .1608918    11.02   0.000     1.927015    2.559821
               2-5 years ago  |   1.248224   .0691646     4.00   0.000     1.119766    1.391419
                    5+ years  |   1.055741   .0384753     1.49   0.137     .9829612     1.13391
                              |
              cancer_haem_cat |
                   Last year  |   3.627731   .5677859     8.23   0.000     2.669385    4.930137
               2-5 years ago  |   2.546655   .2649619     8.98   0.000     2.076866    3.122711
                    5+ years  |   1.596746   .1447548     5.16   0.000     1.336809    1.907228
                              |
      1.chronic_liver_disease |   2.073214   .1744361     8.67   0.000     1.758028    2.444908
            1.stroke_dementia |   1.676057   .0523018    16.55   0.000     1.576619    1.781766
                1.other_neuro |   2.430907   .1269737    17.01   0.000     2.194358    2.692955
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.302797   .0358915     9.60   0.000     1.234316    1.375077
           Stage 4/5 egfr<30  |   2.487513   .1187023    19.10   0.000     2.265409    2.731392
                              |
                       1.esrd |   3.519511   .3145067    14.08   0.000     2.954052    4.193209
           1.other_transplant |   1.680887   .5666766     1.54   0.123     .8681076    3.254646
                              |
                tot_adults_hh |
                           2  |    .792312   .0219916    -8.39   0.000     .7503607    .8366088
                           3  |   1.144737   .0449862     3.44   0.001     1.059876    1.236393
                              |
                   1.asplenia |   1.150009   .2366019     0.68   0.497     .7683791    1.721181
           1.ra_sle_psoriasis |    1.22698   .0488089     5.14   0.000     1.134951    1.326472
               1.other_immuno |   1.835167   .3366119     3.31   0.001      1.28099    2.629091
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat3_MAINFULLYADJMODEL_noeth_12mo_ageband_1.ster saved
   1:   1598.95 /        1 =    1598.9460

--------------------------------------------------------------------------------------------------------------------------------
active results
--------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,310,484             Number of obs    =   3,310,484
No. of failures      =        7,338
Time at risk         =    545061384
                                                Wald chi2(44)    =    15648.24
Log pseudolikelihood =   -80894.716             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,508,446 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              only >12 years  |   .8269091   .1022184    -1.54   0.124     .6489877    1.053608
                 1 child <12  |   .8231123   .0944076    -1.70   0.090        .6574    1.030596
              2 children <12  |   .9446208   .1436281    -0.37   0.708     .7011867    1.272569
             3+ children <12  |   1.129897   .2772085     0.50   0.619     .6985629    1.827563
                              |
                         age1 |   1.048174   .0161488     3.05   0.002     1.016996    1.080308
                         age2 |   1.229208    .073323     3.46   0.001      1.09358    1.381656
                         age3 |   .5975998   .0898931    -3.42   0.001     .4450098    .8025115
                       1.male |   1.748636   .0446797    21.87   0.000     1.663222    1.838437
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.097853   .0347917     2.95   0.003     1.031737    1.168206
          Obese II (35-39.9)  |   1.449872   .0679181     7.93   0.000     1.322683    1.589292
             Obese III (40+)  |   1.989999    .131109    10.44   0.000      1.74893    2.264297
                              |
                 smoke_nomiss |
                      Former  |   1.244128   .0337359     8.06   0.000     1.179734    1.312038
                     Current  |   1.083707   .0565336     1.54   0.123     .9783799    1.200374
                              |
                          imd |
                           2  |   1.102569   .0423498     2.54   0.011     1.022613    1.188778
                           3  |   1.220959   .0467351     5.22   0.000     1.132712    1.316082
                           4  |    1.40868   .0544753     8.86   0.000     1.305856      1.5196
             5 most deprived  |   1.622416   .0662782    11.85   0.000     1.497578    1.757661
                              |
           1.htdiag_or_highbp |   .8975487   .0261867    -3.70   0.000     .8476636    .9503696
1.chronic_respiratory_disease |    1.80405   .0518358    20.54   0.000     1.705262    1.908562
                     1.asthma |   1.096442   .0364167     2.77   0.006      1.02734    1.170192
    1.chronic_cardiac_disease |   1.389254   .0355765    12.84   0.000     1.321247    1.460763
                              |
                      diabcat |
            T1DM, controlled  |    1.81433   .4045833     2.67   0.008     1.171936    2.808849
          T1DM, uncontrolled  |   2.802269   .3794192     7.61   0.000     2.149114    3.653929
            T2DM, controlled  |   1.454978   .0434391    12.56   0.000     1.372282    1.542657
          T2DM, uncontrolled  |   1.991615   .0740276    18.54   0.000     1.851682    2.142122
          Diabetes, no HbA1c  |   2.339413   .5923699     3.36   0.001     1.424201    3.842751
                              |
            cancer_exhaem_cat |
                   Last year  |    2.22099   .1609052    11.01   0.000     1.926988    2.559847
               2-5 years ago  |   1.248313   .0691666     4.00   0.000      1.11985    1.391511
                    5+ years  |   1.056094   .0384869     1.50   0.134     .9832923    1.134286
                              |
              cancer_haem_cat |
                   Last year  |   3.629111   .5680003     8.24   0.000     2.670403    4.932007
               2-5 years ago  |    2.54757    .265052     8.99   0.000      2.07762     3.12382
                    5+ years  |   1.595542   .1447034     5.15   0.000     1.335706    1.905925
                              |
      1.chronic_liver_disease |   2.071444   .1742853     8.66   0.000      1.75653    2.442816
            1.stroke_dementia |   1.675868      .0523    16.55   0.000     1.576434    1.781574
                1.other_neuro |   2.431041   .1269684    17.01   0.000     2.194501    2.693077
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |    1.30298   .0358957     9.61   0.000     1.234491    1.375268
           Stage 4/5 egfr<30  |   2.487166   .1187012    19.09   0.000     2.265065    2.731044
                              |
                       1.esrd |   3.515906   .3143288    14.06   0.000     2.950789    4.189251
           1.other_transplant |   1.682012   .5670906     1.54   0.123     .8686534    3.256956
                              |
                tot_adults_hh |
                           2  |    .792293   .0219914    -8.39   0.000     .7503422    .8365892
                           3  |   1.144235   .0449934     3.43   0.001     1.059362    1.235908
                              |
                   1.asplenia |   1.150301   .2366607     0.68   0.496     .7685762    1.721615
           1.ra_sle_psoriasis |   1.226937   .0488082     5.14   0.000     1.134909    1.326427
               1.other_immuno |   1.835627   .3366942     3.31   0.001     1.281314    2.629744
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_MAINFULLYADJMODEL_noeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_multivariable_cox_models_covid_death.log
  log type:  text
 closed on:   7 Aug 2020, 05:21:44
--------------------------------------------------------------------------------------------------------------------------------
