-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_mult
> ivariable_cox_models_FULL_Sense3_covid_tpp_prob.log
  log type:  text
 opened on:   6 Aug 2020, 21:50:11

. 
. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) [ethnicity(real 0) if(string
> )] bmi(string) smoking(string)
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `exposure' `age'                ///
>                         i.male                                               
>    ///
>                         `bmi'                                                
>    ///
>                         `smoking'                                            
>    ///
>                         `ethnicity'                                          
>    ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  7. timer off 1
  8. timer list
  9. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. foreach exposure_type in        kids_cat3   {
  4.  
. *Complete case ethnicity model
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") ethnicity(0
> ) bmi(i.bmicat) smoking(i.smoke)
  5. if _rc==0{
  6. estimates
  7. estimates save ./output/an_multivariate_cox_models_`outcome'_`exposure_typ
> e'_MAINFULLYADJMODEL_CCnoeth_bmi_smok_ageband_`x', replace
  8. *estat concordance /*c-statistic*/
.  }
  9.  else di "WARNING CC BMI SMOK MODEL WITH AGESPLINE DID NOT FIT (OUTCOME `o
> utcome')" 
 10.  }
 11. 
. }
   1:   2669.53 /        1 =    2669.5330

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    8,933,647             Number of obs    =   8,933,647
No. of failures      =       27,589
Time at risk         =   1472378230
                                                Wald chi2(44)    =     8816.21
Log pseudolikelihood =   -351655.73             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 5,900,744 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.108105   .0185091     6.15   0.000     1.072416    1.144983
Kids unde..  |   1.146221   .0256337     6.10   0.000     1.097065     1.19758
             |
        age1 |   1.017949   .0031212     5.80   0.000      1.01185    1.024085
        age2 |   .9925868   .0086544    -0.85   0.393     .9757686    1.009695
        age3 |   .9697789   .0229079    -1.30   0.194     .9259037    1.015733
      1.male |   .7978424   .0097274   -18.52   0.000     .7790031    .8171373
             |
      bmicat |
Normal (..)  |   .9821321   .0458478    -0.39   0.699     .8962603    1.076231
Overweig..)  |   1.208321   .0567785     4.03   0.000     1.102008    1.324891
Obese I ..)  |   1.340169   .0642024     6.11   0.000     1.220062      1.4721
Obese II..)  |   1.459729    .072979     7.57   0.000     1.323478    1.610008
Obese II..)  |   1.674392   .0870792     9.91   0.000      1.51213    1.854066
             |
       smoke |
     Former  |   .9293282   .0127703    -5.33   0.000     .9046329    .9546976
    Current  |   .5586661   .0107898   -30.14   0.000     .5379137    .5802191
             |
         imd |
          2  |   1.151684   .0260761     6.24   0.000     1.101693    1.203944
          3  |   1.278047   .0289817    10.82   0.000     1.222488    1.336131
          4  |   1.478403   .0323108    17.89   0.000     1.416412    1.543107
5 most de..  |   1.683654   .0376788    23.28   0.000     1.611401    1.759147
             |
1.htdiag_o~p |   1.103397   .0162839     6.67   0.000     1.071938    1.135778
1.~y_disease |   1.721914   .0528521    17.71   0.000      1.62138    1.828681
    1.asthma |   1.134847    .017205     8.34   0.000     1.101622    1.169074
1.~c_disease |   1.292341   .0356589     9.29   0.000     1.224307    1.364156
             |
     diabcat |
T1DM, con..  |   1.022045   .1377258     0.16   0.871     .7848135    1.330987
T1DM, unc..  |   1.522949   .1014854     6.31   0.000     1.336483     1.73543
T2DM, con..  |   1.524297   .0416265    15.44   0.000     1.444855    1.608106
T2DM, unc..  |   1.862013    .051612    22.43   0.000     1.763554    1.965969
Diabetes,..  |   1.068665   .2518485     0.28   0.778     .6733522     1.69606
             |
cancer_exh~t |
  Last year  |   1.759357   .1450726     6.85   0.000     1.496807     2.06796
2-5 years..  |   1.188753   .0702424     2.93   0.003     1.058754    1.334715
   5+ years  |   1.061478   .0506197     1.25   0.211     .9667604    1.165475
             |
cancer_hae~t |
  Last year  |   3.401949   .6061063     6.87   0.000     2.399241    4.823715
2-5 years..  |   2.542788   .2992518     7.93   0.000     2.018995     3.20247
   5+ years  |    1.50488   .1424236     4.32   0.000     1.250096    1.811593
             |
1.~r_disease |   1.627675    .090034     8.81   0.000     1.460441    1.814059
1.stroke_d~a |    1.39068    .066346     6.91   0.000     1.266539     1.52699
1.other_ne~o |    1.25199   .0740527     3.80   0.000     1.114946    1.405878
             |
reduced_ki~t |
Stage 3a/..  |   1.235963   .0545746     4.80   0.000     1.133496    1.347692
Stage 4/5..  |   2.229181   .1921338     9.30   0.000     1.882695    2.639433
             |
      1.esrd |   2.909878   .2435522    12.76   0.000     2.469623    3.428618
1.other_tr~t |   1.388129   .2349674     1.94   0.053     .9962026    1.934247
             |
tot_adults~h |
          2  |   1.066675   .0181528     3.79   0.000     1.031683    1.102853
          3  |   1.319253   .0227588    16.06   0.000     1.275392    1.364622
             |
  1.asplenia |   2.319324   .2381804     8.19   0.000      1.89648    2.836446
1.ra_sle_p~s |   1.131471   .0289828     4.82   0.000     1.076068    1.189726
1.other_im~o |   1.900384   .1291676     9.45   0.000     1.663359    2.171185
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFU
> LLYADJMODEL_CCnoeth_bmi_smok_ageband_0.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJM
> ODEL_CCnoeth_bmi_smok_ageband_0.ster saved
   1:    886.02 /        1 =     886.0160

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,003,870             Number of obs    =   3,003,870
No. of failures      =       12,469
Time at risk         =    492740923
                                                Wald chi2(44)    =    11305.67
Log pseudolikelihood =   -141609.45             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,322,271 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.142958   .0684383     2.23   0.026     1.016394    1.285283
Kids unde..  |   .9852003   .0857505    -0.17   0.864     .8306865    1.168455
             |
        age1 |   .9780396   .0087613    -2.48   0.013     .9610177    .9953631
        age2 |   1.203254   .0455098     4.89   0.000     1.117282    1.295841
        age3 |   .6778842   .0669586    -3.94   0.000     .5585697    .8226852
      1.male |   1.194554   .0224833     9.45   0.000     1.151291    1.239444
             |
      bmicat |
Normal (..)  |   .5686255   .0289731   -11.08   0.000     .5145826    .6283441
Overweig..)  |   .5278679   .0269259   -12.53   0.000     .4776465    .5833698
Obese I ..)  |   .5997957   .0317363    -9.66   0.000     .5407103    .6653376
Obese II..)  |   .6596433   .0388942    -7.06   0.000     .5876519    .7404541
Obese II..)  |   .8320526    .056276    -2.72   0.007     .7287519    .9499962
             |
       smoke |
     Former  |   1.128214   .0231304     5.88   0.000     1.083778    1.174472
    Current  |   .8510637   .0333209    -4.12   0.000     .7881989    .9189425
             |
         imd |
          2  |   1.130315    .033341     4.15   0.000     1.066821    1.197588
          3  |   1.197793   .0357082     6.05   0.000     1.129812    1.269865
          4  |   1.400728   .0418349    11.28   0.000     1.321087    1.485171
5 most de..  |   1.539699   .0492144    13.50   0.000     1.446199    1.639243
             |
1.htdiag_o~p |   1.028114   .0227925     1.25   0.211     .9843982    1.073771
1.~y_disease |   1.928958   .0424454    29.86   0.000     1.847535    2.013969
    1.asthma |   1.226191   .0292443     8.55   0.000     1.170192    1.284869
1.~c_disease |   1.412559   .0283855    17.19   0.000     1.358005    1.469303
             |
     diabcat |
T1DM, con..  |   1.649779   .2858357     2.89   0.004      1.17476    2.316874
T1DM, unc..  |   2.293784   .2471259     7.71   0.000     1.857148    2.833078
T2DM, con..  |     1.4144   .0330937    14.82   0.000     1.351002    1.480773
T2DM, unc..  |   1.720686   .0512839    18.21   0.000     1.623051    1.824195
Diabetes,..  |   1.774471   .3888697     2.62   0.009     1.154864    2.726509
             |
cancer_exh~t |
  Last year  |   1.790154   .1107885     9.41   0.000     1.585665    2.021014
2-5 years..  |   1.289741   .0548481     5.98   0.000     1.186599    1.401848
   5+ years  |    1.18058   .0329494     5.95   0.000     1.117735    1.246959
             |
cancer_hae~t |
  Last year  |   3.442222    .432938     9.83   0.000     2.690177    4.404503
2-5 years..  |   2.313107   .1967483     9.86   0.000     1.957916    2.732733
   5+ years  |   1.735859   .1187095     8.06   0.000     1.518112    1.984839
             |
1.~r_disease |   1.656158   .1106961     7.55   0.000     1.452808    1.887971
1.stroke_d~a |   1.608405   .0413995    18.46   0.000     1.529276    1.691628
1.other_ne~o |   1.986097   .0881723    15.46   0.000     1.820588    2.166653
             |
reduced_ki~t |
Stage 3a/..  |   1.154861   .0250596     6.64   0.000     1.106775    1.205036
Stage 4/5..  |   1.714678   .0769117    12.02   0.000      1.57037    1.872247
             |
      1.esrd |   3.702463   .2763225    17.54   0.000     3.198629     4.28566
1.other_tr~t |    1.21649   .3320058     0.72   0.473     .7125215    2.076919
             |
tot_adults~h |
          2  |    .877011   .0186894    -6.16   0.000     .8411348    .9144173
          3  |   1.182887   .0356103     5.58   0.000     1.115111    1.254782
             |
  1.asplenia |   1.336285   .1879114     2.06   0.039     1.014382    1.760342
1.ra_sle_p~s |   1.368335   .0390385    10.99   0.000     1.293921    1.447029
1.other_im~o |   1.734806   .2389771     4.00   0.000     1.324323    2.272519
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFU
> LLYADJMODEL_CCnoeth_bmi_smok_ageband_1.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat3_MAINFULLYADJM
> ODEL_CCnoeth_bmi_smok_ageband_1.ster saved

. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\07b_an_mult
> ivariable_cox_models_FULL_Sense3_covid_tpp_prob.log
  log type:  text
 closed on:   6 Aug 2020, 22:50:40
-------------------------------------------------------------------------------
