-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\10_an_inter
> action_cox_models_time_covid_tpp_prob.log
  log type:  text
 opened on:   6 Aug 2020, 21:50:10

. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.  stcox  `exposure' `age'                                        ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                          
>    ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *****************************************************************************
> ********
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. *Split data by time of study period: days to April 3rd (31 d March, 3d April)
. stsplit cat_time, at(0,34, 200)
  4. recode cat_time 34=1 200=2 
  5. recode `outcome' .=0 
  6. tab cat_time
  7.  
. /*Overlapping time periods
> gen cat_time0=1 if cat==0
> gen cat_time1=1 if cat==0 | cat==0.25
> */
.         
. 
. 
. foreach int_type in cat_time  {
  8. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  9. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 10. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.
> `int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
 11. if _rc==0{
 12. testparm 1.`int_type'#i.`exposure_type'
 13. di _n "`exposure_type' <66" _n "****************"
 14. lincom 2.`exposure_type', eform
 15. di "`exposure_type' 66+" _n "****************"
 16. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 17. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 18. }
 19. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 20. 
. }
 21. 
. }
 22. 
. }
op. sys. refuses to provide memory
r(909);

end of do-file

r(909);

