----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_age_covid_tpp_prob.log
  log type:  text
 opened on:   3 Aug 2020, 16:13:03

. 
. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'.dta", clear

. stset
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   16015832  total observations
          0  exclusions
------------------------------------------------------------------------------
   16015832  observations remaining, representing
   16015832  subjects
     37,639  failures in single-failure-per-subject data
 2.1724e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       136

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.  stcox  `exposure' `age'                                        ///
>                         i.male                                                  ///
>                         i.obese4cat                                             ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                   ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                                ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabetes                                              ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.organ_trans                           ///
>                         i.asplenia                                              ///
>                         i.tot_adults_hh                         ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                  ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. foreach int_type in age66  {
  2. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  3. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  4. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposu
> re_type')
  5. if _rc==0{
  6. testparm 1.`int_type'#i.`exposure_type'
  7. di _n "`exposure_type' <66" _n "****************"
  8. lincom 2.`exposure_type', eform
  9. di "`exposure_type' 66+" _n "****************"
 10. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 11. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noe
> th, replace
 12. }
 13. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 14. 
. }
 15. 
. }

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -504289.84
Iteration 1:   log pseudolikelihood = -494208.46
Iteration 2:   log pseudolikelihood = -491950.18
Iteration 3:   log pseudolikelihood = -491790.69
Iteration 4:   log pseudolikelihood =  -491785.4
Iteration 5:   log pseudolikelihood = -491785.39
Refining estimates:
Iteration 0:   log pseudolikelihood = -491785.39

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,015,832             Number of obs    =  16,015,832
No. of failures      =       37,639
Time at risk         =   2172398431
                                                Wald chi2(37)    =    33977.49
Log pseudolikelihood =   -491785.39             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 8,958,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.051701   .0177971     2.98   0.003     1.017392    1.087168
               Kids under 18  |   1.155478   .0262054     6.37   0.000     1.105241    1.207998
                              |
                         age1 |   1.116493   .0040149    30.64   0.000     1.108651    1.124389
                         age2 |   .7609146   .0072321   -28.75   0.000     .7468711    .7752221
                         age3 |   2.058721   .0496576    29.94   0.000     1.963658    2.158385
                       1.male |   .8718142   .0090845   -13.16   0.000     .8541895    .8898025
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.196871   .0168789    12.74   0.000     1.164242    1.230415
          Obese II (35-39.9)  |   1.386294   .0270831    16.72   0.000     1.334215    1.440405
             Obese III (40+)  |    1.64371   .0404487    20.19   0.000     1.566313    1.724931
                              |
                 smoke_nomiss |
                      Former  |   1.034264   .0120573     2.89   0.004       1.0109    1.058168
                     Current  |   .6251074   .0114433   -25.67   0.000     .6030766    .6479429
                              |
                          imd |
                           2  |   1.130758   .0203664     6.82   0.000     1.091537    1.171389
                           3  |    1.17189   .0213339     8.71   0.000     1.130813    1.214458
                           4  |   1.365059   .0244096    17.40   0.000     1.318046    1.413749
             5 most deprived  |   1.547193   .0289314    23.34   0.000     1.491515    1.604949
                              |
           1.htdiag_or_highbp |   1.109767   .0145845     7.93   0.000     1.081547    1.138724
1.chronic_respiratory_disease |   1.946458   .0331666    39.09   0.000     1.882526    2.012561
                     1.asthma |   1.253297   .0166361    17.01   0.000     1.221111    1.286331
    1.chronic_cardiac_disease |   1.388871   .0217937    20.93   0.000     1.346806     1.43225
                   1.diabetes |   1.565281    .021886    32.05   0.000     1.522968     1.60877
                              |
            cancer_exhaem_cat |
                   Last year  |   1.891229   .0893002    13.50   0.000     1.724059    2.074609
               2-5 years ago  |   1.279543   .0429832     7.34   0.000     1.198011    1.366624
                    5+ years  |   1.128318   .0259588     5.25   0.000      1.07857    1.180361
                              |
              cancer_haem_cat |
                   Last year  |    3.72184   .3564892    13.72   0.000       3.0848    4.490435
               2-5 years ago  |   2.534974   .1668985    14.13   0.000     2.228085    2.884132
                    5+ years  |     1.8525   .0948827    12.04   0.000     1.675563    2.048122
                              |
      1.chronic_liver_disease |   1.714215   .0732781    12.61   0.000     1.576445    1.864026
            1.stroke_dementia |   1.775064   .0362821    28.07   0.000     1.705358     1.84762
                1.other_neuro |   1.916712   .0617218    20.20   0.000     1.799478    2.041584
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.178776    .021163     9.16   0.000     1.138019    1.220994
           Stage 4/5 egfr<30  |   2.301421   .0794796    24.14   0.000     2.150799    2.462592
                              |
                1.organ_trans |   2.631736   .1788315    14.24   0.000     2.303571    3.006652
                   1.asplenia |    1.96442   .1581861     8.38   0.000     1.677609    2.300265
                              |
                tot_adults_hh |
                           2  |   .9546682   .0128856    -3.44   0.001      .929744    .9802604
                           3  |   1.284491   .0199417    16.13   0.000     1.245995    1.324177
                              |
           1.ra_sle_psoriasis |   1.286534   .0246389    13.16   0.000     1.239137    1.335743
               1.other_immuno |   2.352128   .1368132    14.70   0.000     2.098699    2.636159
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   4080.22 /        1 =    4080.2190

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -504289.84
Iteration 1:   log pseudolikelihood = -494196.22
Iteration 2:   log pseudolikelihood = -491926.47
Iteration 3:   log pseudolikelihood = -491767.49
Iteration 4:   log pseudolikelihood = -491762.22
Iteration 5:   log pseudolikelihood = -491762.21
Refining estimates:
Iteration 0:   log pseudolikelihood = -491762.21

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   16,015,832             Number of obs    =  16,015,832
No. of failures      =       37,639
Time at risk         =   2172398431
                                                Wald chi2(39)    =    33904.43
Log pseudolikelihood =   -491762.21             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 8,958,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.081909    .019337     4.40   0.000     1.044665     1.12048
               Kids under 18  |   1.199395    .028201     7.73   0.000     1.145376    1.255961
                              |
                         age1 |   1.113849   .0040077    29.97   0.000     1.106022    1.121732
                         age2 |   .7667659   .0073225   -27.81   0.000     .7525475     .781253
                         age3 |    2.02008    .048936    29.03   0.000     1.926408    2.118306
                       1.male |   .8726305   .0090971   -13.07   0.000     .8549815    .8906438
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.196307   .0168732    12.71   0.000      1.16369     1.22984
          Obese II (35-39.9)  |   1.385963   .0270786    16.71   0.000     1.333893    1.440065
             Obese III (40+)  |   1.643646   .0404499    20.19   0.000     1.566247     1.72487
                              |
                 smoke_nomiss |
                      Former  |   1.032622   .0120468     2.75   0.006     1.009279    1.056506
                     Current  |   .6252499   .0114448   -25.66   0.000     .6032162    .6480885
                              |
                          imd |
                           2  |   1.131409   .0203792     6.85   0.000     1.092163    1.172065
                           3  |   1.173258   .0213624     8.78   0.000     1.132126    1.215883
                           4  |   1.367031   .0244503    17.48   0.000      1.31994    1.415803
             5 most deprived  |   1.549878   .0289931    23.42   0.000     1.494082    1.607758
                              |
           1.htdiag_or_highbp |   1.109984   .0145864     7.94   0.000      1.08176    1.138944
1.chronic_respiratory_disease |   1.946701   .0331757    39.09   0.000     1.882752    2.012822
                     1.asthma |   1.254717   .0166547    17.09   0.000     1.222495    1.287788
    1.chronic_cardiac_disease |   1.389356    .021803    20.95   0.000     1.347273    1.432753
                   1.diabetes |   1.568511   .0219179    32.21   0.000     1.526136    1.612063
                              |
            cancer_exhaem_cat |
                   Last year  |   1.889527   .0892276    13.48   0.000     1.722493    2.072758
               2-5 years ago  |   1.278624   .0429516     7.32   0.000     1.197152    1.365641
                    5+ years  |    1.12658   .0259267     5.18   0.000     1.076894    1.178559
                              |
              cancer_haem_cat |
                   Last year  |   3.717065   .3560733    13.71   0.000     3.080775    4.484772
               2-5 years ago  |   2.534285   .1668446    14.12   0.000     2.227494    2.883329
                    5+ years  |   1.852431   .0948754    12.04   0.000     1.675508    2.048037
                              |
      1.chronic_liver_disease |    1.71633    .073371    12.64   0.000     1.578386    1.866331
            1.stroke_dementia |   1.775189   .0362877    28.08   0.000     1.705472    1.847755
                1.other_neuro |   1.918884   .0617929    20.24   0.000     1.801515    2.043899
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |    1.17844   .0211729     9.14   0.000     1.137664    1.220678
           Stage 4/5 egfr<30  |   2.302375   .0795247    24.14   0.000     2.151669    2.463638
                              |
                1.organ_trans |   2.636406   .1791857    14.26   0.000     2.307595    3.012069
                   1.asplenia |   1.964796   .1582015     8.39   0.000     1.677956    2.300672
                              |
                tot_adults_hh |
                           2  |   .9541265   .0128859    -3.48   0.001     .9292019    .9797196
                           3  |   1.296912   .0203121    16.60   0.000     1.257706     1.33734
                              |
           1.ra_sle_psoriasis |   1.285994   .0246287    13.13   0.000     1.238618    1.335183
               1.other_immuno |    2.35298   .1368666    14.71   0.000     2.099453    2.637123
                              |
              age66#kids_cat3 |
             1#Kids under 12  |   .7746716   .0467619    -4.23   0.000     .6882341    .8719652
             1#Kids under 18  |   .6549198   .0575407    -4.82   0.000     .5513181      .77799
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   4116.04 /        1 =    4116.0370

 ( 1)  1.age66#1.kids_cat3 = 0
 ( 2)  1.age66#2.kids_cat3 = 0

           chi2(  2) =   39.52
         Prob > chi2 =    0.0000

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.199395    .028201     7.73   0.000     1.145376    1.255961
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.age66#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7855073   .0671008    -2.83   0.005     .6644122    .9286731
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_age66_MAINFULLYADJMODEL_agespline_bmicat_noeth.ster not fo
> und)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_age66_MAINFULLYADJMODEL_agespline_bmicat_noeth.ster saved

. 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_age_covid_tpp_prob.log
  log type:  text
 closed on:   3 Aug 2020, 18:33:48
----------------------------------------------------------------------------------------------------------------------------------
