-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\10_an_inter
> action_cox_models_sex_covid_tpp_prob.log
  log type:  text
 opened on:   6 Aug 2020, 21:50:11

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.  stcox  `exposure' `age'                                        ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                          
>    ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3.         
. foreach int_type in  male  {
  4. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  5. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  6. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.
> `int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
  7. if _rc==0{
  8. testparm 1.`int_type'#i.`exposure_type'
  9. di _n "`exposure_type' <66" _n "****************"
 10. lincom 2.`exposure_type', eform
 11. di "`exposure_type' 66+" _n "****************"
 12. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 13. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 14. }
 15. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. }
 18. }

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -431245.79
Iteration 1:   log pseudolikelihood = -428151.59
Iteration 2:   log pseudolikelihood = -426765.15
Iteration 3:   log pseudolikelihood = -426605.75
Iteration 4:   log pseudolikelihood = -426587.32
Iteration 5:   log pseudolikelihood = -426586.85
Iteration 6:   log pseudolikelihood = -426586.85
Refining estimates:
Iteration 0:   log pseudolikelihood = -426586.85

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,895,119             Number of obs    =  11,895,119
No. of failures      =       32,767
Time at risk         =   1960253127
                                                Wald chi2(42)    =    12038.06
Log pseudolikelihood =   -426586.85             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 6,799,224 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.135295    .017514     8.23   0.000     1.101482    1.170147
Kids unde..  |   1.132652   .0236908     5.96   0.000     1.087158     1.18005
             |
        age1 |   1.026419   .0025364    10.55   0.000      1.02146    1.031402
        age2 |   .9789576   .0072785    -2.86   0.004     .9647954    .9933276
        age3 |   1.000928   .0206646     0.04   0.964     .9612346     1.04226
      1.male |   .7364373   .0080679   -27.93   0.000     .7207931     .752421
             |
   obese4cat |
Obese I ..)  |   1.283083   .0199551    16.03   0.000     1.244562    1.322797
Obese II..)  |   1.379171   .0293174    15.12   0.000      1.32289    1.437845
Obese II..)  |   1.568756   .0401546    17.59   0.000     1.491996    1.649466
             |
smoke_nomiss |
     Former  |   .9599574   .0124376    -3.15   0.002      .935887    .9846469
    Current  |   .5676264   .0100427   -32.01   0.000     .5482804     .587655
             |
         imd |
          2  |   1.143087   .0240519     6.36   0.000     1.096904    1.191213
          3  |   1.269014   .0267988    11.28   0.000     1.217562    1.322641
          4  |   1.467474    .029902    18.82   0.000     1.410022    1.527267
5 most de..  |   1.665296   .0345533    24.58   0.000     1.598931    1.734415
             |
1.htdiag_o~p |   1.155262   .0160279    10.40   0.000     1.124272    1.187108
1.~y_disease |   1.745963   .0517835    18.79   0.000     1.647362    1.850464
    1.asthma |   1.149926   .0164212     9.78   0.000     1.118187    1.182566
1.~c_disease |   1.322233   .0351851    10.50   0.000     1.255039    1.393025
             |
     diabcat |
T1DM, con..  |   1.151549   .1475997     1.10   0.271     .8957357    1.480421
T1DM, unc..  |   1.583466   .1046855     6.95   0.000     1.391023    1.802532
T2DM, con..  |   1.576118   .0422032    16.99   0.000     1.495534    1.661043
T2DM, unc..  |   1.912602   .0522155    23.75   0.000     1.812952     2.01773
Diabetes,..  |   1.182279   .2521309     0.79   0.432     .7783843     1.79575
             |
cancer_exh~t |
  Last year  |   1.825664   .1418348     7.75   0.000     1.567803    2.125936
2-5 years..  |   1.198695   .0674794     3.22   0.001     1.073472    1.338524
   5+ years  |   1.028823    .047256     0.62   0.536     .9402494     1.12574
             |
cancer_hae~t |
  Last year  |   3.272524   .5673183     6.84   0.000     2.329809    4.596693
2-5 years..  |       2.58   .2901392     8.43   0.000     2.069646    3.216202
   5+ years  |   1.625055   .1414284     5.58   0.000     1.370213    1.927295
             |
1.~r_disease |   1.664481   .0881903     9.62   0.000     1.500303    1.846624
1.stroke_d~a |   1.422334   .0647999     7.73   0.000     1.300833    1.555182
1.other_ne~o |   1.322843   .0714592     5.18   0.000     1.189945    1.470584
             |
reduced_ki~t |
Stage 3a/..  |   1.232638   .0523713     4.92   0.000     1.134149    1.339679
Stage 4/5..  |   2.215092    .186196     9.46   0.000     1.878631    2.611812
             |
      1.esrd |   2.849416    .233496    12.78   0.000     2.426633     3.34586
1.other_tr~t |    1.46847   .2356321     2.39   0.017     1.072211    2.011174
             |
tot_adults~h |
          2  |    1.06601    .016874     4.04   0.000     1.033446    1.099601
          3  |   1.273774   .0204173    15.10   0.000     1.234379    1.314426
             |
  1.asplenia |   2.327085   .2266765     8.67   0.000     1.922643    2.816606
1.ra_sle_p~s |   1.145366   .0277106     5.61   0.000     1.092322    1.200987
1.other_im~o |   1.999987   .1260406    11.00   0.000     1.767599    2.262927
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   3113.41 /        1 =    3113.4110

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -431245.79
Iteration 1:   log pseudolikelihood = -428144.53
Iteration 2:   log pseudolikelihood = -426753.51
Iteration 3:   log pseudolikelihood = -426593.62
Iteration 4:   log pseudolikelihood = -426575.14
Iteration 5:   log pseudolikelihood = -426574.68
Iteration 6:   log pseudolikelihood = -426574.68
Refining estimates:
Iteration 0:   log pseudolikelihood = -426574.68

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,895,119             Number of obs    =  11,895,119
No. of failures      =       32,767
Time at risk         =   1960253127
                                                Wald chi2(44)    =    12077.56
Log pseudolikelihood =   -426574.68             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 6,799,224 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.077717   .0198077     4.07   0.000     1.039585    1.117247
Kids unde..  |   1.121608   .0276864     4.65   0.000     1.068635    1.177207
             |
        age1 |   1.027075   .0025459    10.78   0.000     1.022097    1.032077
        age2 |   .9763769   .0072855    -3.20   0.001     .9622014    .9907612
        age3 |   1.008428   .0208865     0.41   0.685     .9683113    1.050207
      1.male |   .7093137    .009976   -24.42   0.000     .6900282    .7291383
             |
   obese4cat |
Obese I ..)  |   1.284999   .0199872    16.12   0.000     1.246416    1.324776
Obese II..)  |   1.381074   .0293671    15.18   0.000     1.324698    1.439848
Obese II..)  |   1.569731    .040189    17.61   0.000     1.492905    1.650509
             |
smoke_nomiss |
     Former  |   .9605694   .0124447    -3.11   0.002     .9364853    .9852729
    Current  |   .5674899   .0100402   -32.02   0.000     .5481488    .5875136
             |
         imd |
          2  |   1.143062   .0240515     6.35   0.000     1.096881    1.191187
          3  |    1.26889   .0267962    11.28   0.000     1.217443    1.322512
          4  |   1.467446   .0299013    18.82   0.000     1.409995    1.527238
5 most de..  |   1.665759   .0345633    24.59   0.000     1.599375    1.734898
             |
1.htdiag_o~p |   1.154415   .0160052    10.36   0.000     1.123468    1.186215
1.~y_disease |   1.744671   .0517527    18.76   0.000      1.64613    1.849111
    1.asthma |   1.149311   .0164148     9.74   0.000     1.117585    1.181938
1.~c_disease |   1.326004   .0352877    10.60   0.000     1.258614    1.397002
             |
     diabcat |
T1DM, con..  |   1.152315   .1477051     1.11   0.269     .8963202    1.481424
T1DM, unc..  |   1.583147   .1046644     6.95   0.000     1.390743    1.802169
T2DM, con..  |   1.576913   .0422254    17.01   0.000     1.496287    1.661883
T2DM, unc..  |   1.913861   .0522485    23.78   0.000     1.814147    2.019055
Diabetes,..  |   1.183762   .2524691     0.79   0.429     .7793322    1.798068
             |
cancer_exh~t |
  Last year  |   1.825686    .141842     7.75   0.000     1.567813    2.125974
2-5 years..  |   1.197754    .067428     3.21   0.001     1.072628    1.337477
   5+ years  |   1.025006   .0470956     0.54   0.591     .9367345    1.121595
             |
cancer_hae~t |
  Last year  |   3.275473   .5679284     6.84   0.000      2.33177    4.601108
2-5 years..  |   2.582052   .2903622     8.44   0.000     2.071305    3.218741
   5+ years  |   1.626061   .1415176     5.59   0.000     1.371058    1.928491
             |
1.~r_disease |   1.666204   .0882801     9.64   0.000     1.501859    1.848533
1.stroke_d~a |    1.42383   .0648733     7.76   0.000     1.302193     1.55683
1.other_ne~o |   1.321407   .0713895     5.16   0.000     1.188639    1.469004
             |
reduced_ki~t |
Stage 3a/..  |   1.230104   .0522611     4.87   0.000     1.131823    1.336919
Stage 4/5..  |   2.213912   .1861109     9.45   0.000     1.877607    2.610454
             |
      1.esrd |   2.850601   .2335874    12.78   0.000     2.427651    3.347238
1.other_tr~t |    1.46922   .2357709     2.40   0.017     1.072732    2.012251
             |
tot_adults~h |
          2  |    1.05871   .0168432     3.59   0.000     1.026207    1.092242
          3  |   1.266842   .0203703    14.71   0.000      1.22754    1.307403
             |
  1.asplenia |   2.328444   .2268096     8.68   0.000     1.923763    2.818252
1.ra_sle_p~s |   1.145108   .0277061     5.60   0.000     1.092073     1.20072
1.other_im~o |   2.006648   .1264683    11.05   0.000     1.773472    2.270481
             |
        male#|
   kids_cat3 |
          1 #|
Kids unde..  |   1.135969   .0278426     5.20   0.000     1.082689    1.191872
          1 #|
Kids unde..  |   1.023638   .0358437     0.67   0.505     .9557418    1.096357
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   2922.93 /        1 =    2922.9260

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =   27.36
         Prob > chi2 =    0.0000

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.121608   .0276864     4.65   0.000     1.068635    1.177207
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.14812   .0347422     4.56   0.000     1.082007    1.218274
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_male_MA
> INFULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_male_MAINFULLY
> ADJMODEL_agespline_bmicat_noeth_ageband_0.ster saved

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -156975.12
Iteration 1:   log pseudolikelihood = -153352.19
Iteration 2:   log pseudolikelihood = -152616.37
Iteration 3:   log pseudolikelihood =  -152583.9
Iteration 4:   log pseudolikelihood =  -152582.8
Iteration 5:   log pseudolikelihood =  -152582.8
Refining estimates:
Iteration 0:   log pseudolikelihood =  -152582.8

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,310,484             Number of obs    =   3,310,484
No. of failures      =       13,329
Time at risk         =    542927141
                                                Wald chi2(42)    =    12706.35
Log pseudolikelihood =    -152582.8             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,508,446 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.112103   .0646849     1.83   0.068     .9922825    1.246392
Kids unde..  |   1.005794   .0830807     0.07   0.944     .8554569    1.182552
             |
        age1 |   .9798719     .00851    -2.34   0.019     .9633337    .9966939
        age2 |   1.199672   .0439326     4.97   0.000     1.116583    1.288944
        age3 |   .6839296   .0653274    -3.98   0.000     .5671613    .8247384
      1.male |   1.164673   .0210176     8.45   0.000     1.124199    1.206603
             |
   obese4cat |
Obese I ..)  |   1.083911   .0248617     3.51   0.000     1.036262    1.133751
Obese II..)  |    1.18932   .0414157     4.98   0.000     1.110855    1.273328
Obese II..)  |   1.498905   .0720157     8.42   0.000     1.364199    1.646913
             |
smoke_nomiss |
     Former  |   1.135615   .0224841     6.42   0.000     1.092391    1.180549
    Current  |   .8933355   .0333319    -3.02   0.003     .8303377     .961113
             |
         imd |
          2  |   1.126966   .0321104     4.20   0.000     1.065756    1.191692
          3  |   1.196928   .0345197     6.23   0.000     1.131147    1.266534
          4  |   1.398855    .040487    11.60   0.000     1.321711    1.480502
5 most de..  |   1.544027   .0478461    14.02   0.000     1.453041     1.64071
             |
1.htdiag_o~p |   1.023328   .0217508     1.08   0.278      .981573    1.066859
1.~y_disease |   1.983078   .0426402    31.84   0.000     1.901241    2.068437
    1.asthma |   1.228953   .0287148     8.82   0.000     1.173943    1.286542
1.~c_disease |   1.438229   .0283089    18.46   0.000     1.383801    1.494798
             |
     diabcat |
T1DM, con..  |   1.617986   .2804009     2.78   0.005     1.152019    2.272428
T1DM, unc..  |   2.308832   .2460873     7.85   0.000     1.873556    2.845233
T2DM, con..  |    1.41371   .0325316    15.05   0.000     1.351366    1.478931
T2DM, unc..  |   1.734984   .0507144    18.85   0.000      1.63838    1.837285
Diabetes,..  |   1.758933   .3686123     2.69   0.007     1.166451    2.652358
             |
cancer_exh~t |
  Last year  |   1.823086   .1092588    10.02   0.000     1.621042    2.050314
2-5 years..  |   1.288764   .0535363     6.11   0.000     1.187992    1.398083
   5+ years  |   1.179802   .0320293     6.09   0.000     1.118666    1.244278
             |
cancer_hae~t |
  Last year  |   3.703341   .4398593    11.02   0.000     2.934225    4.674057
2-5 years..  |   2.313461    .192679    10.07   0.000     1.965029    2.723676
   5+ years  |   1.757249   .1165682     8.50   0.000     1.543009    2.001236
             |
1.~r_disease |   1.666298   .1092624     7.79   0.000     1.465337    1.894818
1.stroke_d~a |   1.629973   .0409111    19.47   0.000     1.551729    1.712162
1.other_ne~o |   2.040411   .0868189    16.76   0.000     1.877151    2.217869
             |
reduced_ki~t |
Stage 3a/..  |   1.153279   .0241616     6.81   0.000     1.106882     1.20162
Stage 4/5..  |     1.7249   .0750246    12.53   0.000     1.583948    1.878396
             |
      1.esrd |    3.78473   .2752569    18.30   0.000     3.281923    4.364568
1.other_tr~t |    1.16364   .3172726     0.56   0.578     .6819212    1.985653
             |
tot_adults~h |
          2  |   .8734757   .0180402    -6.55   0.000     .8388237    .9095592
          3  |   1.169174   .0341801     5.35   0.000     1.104066    1.238123
             |
  1.asplenia |    1.32924   .1834312     2.06   0.039     1.014239    1.742075
1.ra_sle_p~s |   1.361635   .0379937    11.06   0.000     1.289169    1.438175
1.other_im~o |   1.785767   .2374303     4.36   0.000     1.376105    2.317385
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:    881.73 /        1 =     881.7300

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -156975.12
Iteration 1:   log pseudolikelihood =  -153351.4
Iteration 2:   log pseudolikelihood =  -152614.7
Iteration 3:   log pseudolikelihood = -152582.26
Iteration 4:   log pseudolikelihood = -152581.17
Iteration 5:   log pseudolikelihood = -152581.17
Refining estimates:
Iteration 0:   log pseudolikelihood = -152581.17

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,310,484             Number of obs    =   3,310,484
No. of failures      =       13,329
Time at risk         =    542927141
                                                Wald chi2(44)    =    12701.16
Log pseudolikelihood =   -152581.17             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,508,446 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.221058   .0935376     2.61   0.009     1.050826    1.418866
Kids unde..  |    1.05208   .1166268     0.46   0.647     .8466232    1.307397
             |
        age1 |   .9798272   .0085097    -2.35   0.019     .9632897    .9966487
        age2 |   1.199837   .0439387     4.97   0.000     1.116737    1.289121
        age3 |   .6837325   .0653089    -3.98   0.000     .5669972    .8245016
      1.male |   1.171978   .0215726     8.62   0.000      1.13045    1.215031
             |
   obese4cat |
Obese I ..)  |   1.083522   .0248572     3.50   0.000     1.035882    1.133354
Obese II..)  |   1.188663   .0413909     4.96   0.000     1.110244     1.27262
Obese II..)  |   1.497883   .0719722     8.41   0.000     1.363259    1.645802
             |
smoke_nomiss |
     Former  |   1.136365   .0225125     6.45   0.000     1.093087    1.181356
    Current  |   .8941845   .0333645    -3.00   0.003     .8311253    .9620282
             |
         imd |
          2  |   1.126978   .0321107     4.20   0.000     1.065767    1.191704
          3  |   1.196924   .0345195     6.23   0.000     1.131143    1.266529
          4  |   1.398684   .0404827    11.59   0.000     1.321548    1.480322
5 most de..  |   1.543548   .0478349    14.01   0.000     1.452584    1.640209
             |
1.htdiag_o~p |   1.023414   .0217516     1.09   0.276     .9816577    1.066947
1.~y_disease |   1.982986   .0426366    31.84   0.000     1.901156    2.068338
    1.asthma |   1.229026   .0287171     8.83   0.000     1.174011    1.286619
1.~c_disease |   1.438152   .0283081    18.46   0.000     1.383726    1.494719
             |
     diabcat |
T1DM, con..  |   1.617058   .2802312     2.77   0.006      1.15137      2.2711
T1DM, unc..  |   2.307037     .24591     7.84   0.000     1.872077    2.843054
T2DM, con..  |   1.413264   .0325203    15.03   0.000     1.350941    1.478462
T2DM, unc..  |   1.734965   .0507074    18.85   0.000     1.638373    1.837252
Diabetes,..  |   1.757742   .3683458     2.69   0.007     1.165683    2.650512
             |
cancer_exh~t |
  Last year  |   1.823333    .109274    10.02   0.000      1.62126    2.050592
2-5 years..  |   1.288537   .0535271     6.10   0.000     1.187784    1.397838
   5+ years  |   1.179786   .0320292     6.09   0.000     1.118651    1.244263
             |
cancer_hae~t |
  Last year  |    3.70121   .4396287    11.02   0.000     2.932501    4.671423
2-5 years..  |    2.31308   .1926488    10.07   0.000     1.964703    2.723231
   5+ years  |    1.75742   .1165752     8.50   0.000     1.543167    2.001421
             |
1.~r_disease |   1.667133   .1092926     7.80   0.000     1.466114    1.895713
1.stroke_d~a |    1.62997    .040908    19.47   0.000     1.551732    1.712153
1.other_ne~o |   2.040616   .0868252    16.76   0.000     1.877344    2.218087
             |
reduced_ki~t |
Stage 3a/..  |   1.153426   .0241642     6.81   0.000     1.107024    1.201773
Stage 4/5..  |   1.724878   .0750166    12.53   0.000     1.583941    1.878356
             |
      1.esrd |   3.787851   .2754022    18.32   0.000     3.284769    4.367984
1.other_tr~t |   1.164289   .3173657     0.56   0.577      .682398     1.98648
             |
tot_adults~h |
          2  |   .8725345    .018032    -6.60   0.000     .8378987     .908602
          3  |   1.168209   .0341604     5.32   0.000     1.103139    1.237118
             |
  1.asplenia |   1.329756   .1834928     2.07   0.039     1.014647    1.742726
1.ra_sle_p~s |   1.361824   .0379991    11.07   0.000     1.289347    1.438375
1.other_im~o |   1.784508   .2372916     4.36   0.000     1.375092    2.315823
             |
        male#|
   kids_cat3 |
          1 #|
Kids unde..  |   .8335962   .0843032    -1.80   0.072     .6837102    1.016341
          1 #|
Kids unde..  |   .9154285   .1363137    -0.59   0.553     .6837142    1.225672
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:    943.83 /        1 =     943.8270

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =    3.55
         Prob > chi2 =    0.1697

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.05208   .1166268     0.46   0.647     .8466232    1.307397
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9631043   .1074719    -0.34   0.736     .7739066    1.198555
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_male_MA
> INFULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat3_male_MAINFULLY
> ADJMODEL_agespline_bmicat_noeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\10_an_inter
> action_cox_models_sex_covid_tpp_prob.log
  log type:  text
 closed on:   7 Aug 2020, 00:02:16
-------------------------------------------------------------------------------
