-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\16_explorat
> ory_analysis_non_covid_death.log
  log type:  text
 opened on:   6 Aug 2020, 21:50:07

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. *Run main MV model for different hh sizes
. forvalues x=1/5 { 
  4. stcox   i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                          if household_size==`x', ///
>                          strata(stp) vce(cluster household_id) 
  5. }
  6.                         
. 
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. 
. 
. 
. 
. *Run models for hh with 2 adults
. *Age and sex adj
. stcox   i.kids_cat3 age1 age2 age3              ///
>                         i.male                                          ///
>                          if tot_adults_hh==2, strata(stp) vce(cluster househo
> ld_id) 
  7.                          
.                          
. *Demog adj
. stcox   i.kids_cat3 age1 age2 age3                      ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                          if tot_adults_hh==2, strata(stp) vce(cluster househo
> ld_id) 
  8. 
. 
. *FULL
.  stcox  i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                          if tot_adults_hh==2, strata(stp) vce(cluster househo
> ld_id) 
  9. 
. 
.                          
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. 
. 
. 
. *Investigate non-PH
. 
. 
. *Full MV model without clustering (to see if the clustering by hh id is affec
> ting PH test)
.  stcox  i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                          if tot_adults_hh==2, strata(stp) 
 10. 
. 
. *Plot hazards
. *Age and sex adj
. stcox   i.kids_cat3 age1 age2 age3              ///
>                         i.male  , strata(stp) vce(cluster household_id) 
 11. estat phtest, d         
 12.                          
.                          
. *Demog adj
. stcox   i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd           , strata(stp) vce(cluster household_i
> d) 
 13. estat phtest, d         
 14. 
. 
. *FULL
.  stcox  i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         i.other_immuno, strata(stp) vce(cluster household_id)
>  
 15. 
. estat phtest, d         
 16. 
. *Fit time interactions
. 
. stsplit timeperiod, at(60 90)
 17. 
. *make vars binary
. gen anyreduced_kidney_function = reduced_kidney_function_cat>=2
 18. gen anyobesity = obese4cat>=2
 19. gen highimd = imd>=3
 20. 
. stcox   i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                 60.timeperiod#1.anyobesity                                   
>                    ///
>                         90.timeperiod#1.anyobesity                           
>                    ///
>                 60.timeperiod#3.smoke_nomiss                                 
>            ///
>                         90.timeperiod#3.smoke_nomiss                         
>            ///
>                 60.timeperiod#1.highimd                                      
>                    ///
>                         90.timeperiod#1.highimd                              
>                    ///
>                 60.timeperiod#1.diabetes                                     
>                    ///
>                         90.timeperiod#1.diabetes                             
>                    ///             
>                 60.timeperiod#1.chronic_liver_disease                        
>    ///
>                         90.timeperiod#1.chronic_liver_disease                
>    ///
>                 60.timeperiod#1.cancer_exhaem_cat                            
>            ///
>                         90.timeperiod#1.cancer_exhaem_cat                    
>            ///
>                         90.timeperiod#1.asplenia                             
>                    ///
>                 60.timeperiod#1.other_immuno                                 
>            ///
>                         90.timeperiod#1.other_immuno                         
>            ///
> , strata(stp) vce(cluster household_id) 
 21. 
. estat phtest, d
 22. 
. 
. }

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 0.kids_cat3 omitted because of collinearity
note: 1.tot_adults_hh omitted because of collinearity
Iteration 0:   log pseudolikelihood =  -33102.24
Iteration 1:   log pseudolikelihood =  -30851.17
Iteration 2:   log pseudolikelihood = -29700.891
Iteration 3:   log pseudolikelihood = -28880.765
Iteration 4:   log pseudolikelihood = -28857.876
Iteration 5:   log pseudolikelihood = -28857.584
Iteration 6:   log pseudolikelihood = -28857.584
Iteration 7:   log pseudolikelihood = -28857.584
Refining estimates:
Iteration 0:   log pseudolikelihood = -28857.584

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,146,288             Number of obs    =   2,146,288
No. of failures      =        2,919
Time at risk         =    355996792
                                                Wald chi2(38)    =    14294.67
Log pseudolikelihood =   -28857.584             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,146,288 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
    No kids  |          1  (omitted)
        age1 |   1.174887   .0395689     4.79   0.000     1.099838    1.255058
        age2 |   .8932747   .0633001    -1.59   0.111      .777439    1.026369
        age3 |   1.150405   .1897348     0.85   0.396     .8326518    1.589419
      1.male |   1.434126   .0586963     8.81   0.000     1.323577    1.553909
             |
   obese4cat |
Obese I ..)  |   .7087265   .0407315    -5.99   0.000     .6332263    .7932287
Obese II..)  |   .8645318   .0668638    -1.88   0.060     .7429305    1.006037
Obese II..)  |   1.237387   .1070139     2.46   0.014     1.044456    1.465955
             |
smoke_nomiss |
     Former  |   1.325233   .0702642     5.31   0.000     1.194431    1.470358
    Current  |   2.409619   .1262424    16.79   0.000     2.174468      2.6702
             |
         imd |
          2  |   1.071505   .0804052     0.92   0.357     .9249548    1.241275
          3  |   1.198634   .0862397     2.52   0.012     1.040984    1.380159
          4  |   1.324544    .092982     4.00   0.000     1.154284    1.519918
5 most de..  |   1.443162   .1012397     5.23   0.000     1.257773    1.655877
             |
1.htdiag_o~p |   1.192089   .0497408     4.21   0.000     1.098479    1.293677
1.~y_disease |    2.07334   .1142596    13.23   0.000     1.861066    2.309827
    1.asthma |   1.082032   .0537746     1.59   0.113     .9816061    1.192732
1.~c_disease |   1.800465   .0984637    10.75   0.000     1.617462    2.004172
             |
     diabcat |
T1DM, con..  |   1.841823   .4741247     2.37   0.018     1.112065     3.05046
T1DM, unc..  |   2.432533   .3747845     5.77   0.000     1.798509    3.290068
T2DM, con..  |   1.224729   .0890505     2.79   0.005      1.06206    1.412314
T2DM, unc..  |   1.706567   .1198748     7.61   0.000     1.487073    1.958459
Diabetes,..  |   2.499067    .970316     2.36   0.018     1.167564     5.34903
             |
cancer_exh~t |
  Last year  |   26.77086    1.78285    49.36   0.000     23.49498    30.50348
2-5 years..  |   9.183905    .620487    32.82   0.000     8.044853    10.48423
   5+ years  |   3.291908   .2669158    14.69   0.000     2.808214    3.858915
             |
cancer_hae~t |
  Last year  |   6.564354   1.696969     7.28   0.000     3.954991    10.89528
2-5 years..  |   3.268417   .7306532     5.30   0.000     2.108879     5.06551
   5+ years  |   1.494223    .331193     1.81   0.070      .967715     2.30719
             |
1.~r_disease |   4.982935    .328343    24.37   0.000     4.379219    5.669881
1.stroke_d~a |   1.651492   .1355205     6.11   0.000     1.406136     1.93966
1.other_ne~o |   2.450099   .2629297     8.35   0.000     1.985354    3.023636
             |
reduced_ki~t |
Stage 3a/..  |    1.85139   .1446026     7.89   0.000     1.588601    2.157649
Stage 4/5..  |   4.870662   .7424242    10.39   0.000     3.612778    6.566512
             |
      1.esrd |   1.952965   .3534182     3.70   0.000     1.369799    2.784403
1.other_tr~t |   .9110138   .3050695    -0.28   0.781     .4725901    1.756165
1.tot_adul~h |          1  (omitted)
  1.asplenia |   2.793765   .5115961     5.61   0.000     1.951269    4.000023
1.ra_sle_p~s |   1.133799   .0795903     1.79   0.074     .9880608    1.301034
1.other_im~o |   1.373165   .2330175     1.87   0.062     .9846434    1.914989
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood =  -34605.38
Iteration 1:   log pseudolikelihood =  -31869.77
Iteration 2:   log pseudolikelihood = -31403.044
Iteration 3:   log pseudolikelihood = -29933.042
Iteration 4:   log pseudolikelihood = -29838.197
Iteration 5:   log pseudolikelihood = -29835.479
Iteration 6:   log pseudolikelihood = -29835.477
Refining estimates:
Iteration 0:   log pseudolikelihood = -29835.477

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,836,796             Number of obs    =   2,836,796
No. of failures      =        2,973
Time at risk         =    470615866
                                                Wald chi2(41)    =    16626.42
Log pseudolikelihood =   -29835.477             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,777,762 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .2860563   .0725213    -4.94   0.000      .174042    .4701637
Kids unde..  |   .3989339   .0848342    -4.32   0.000     .2629608    .6052166
             |
        age1 |   1.119205    .036293     3.47   0.001     1.050285    1.192647
        age2 |   .9531229   .0673634    -0.68   0.497     .8298296    1.094735
        age3 |   1.026955   .1708921     0.16   0.873     .7411496    1.422974
      1.male |   1.240478   .0486262     5.50   0.000     1.148742     1.33954
             |
   obese4cat |
Obese I ..)  |     .72345   .0391328    -5.98   0.000     .6506769    .8043621
Obese II..)  |   .8310128   .0613398    -2.51   0.012     .7190809     .960368
Obese II..)  |   1.180674   .1002807     1.96   0.051     .9996163    1.394527
             |
smoke_nomiss |
     Former  |   1.218668   .0566992     4.25   0.000     1.112456    1.335021
    Current  |   2.108014   .1093165    14.38   0.000     1.904287    2.333537
             |
         imd |
          2  |   1.092637   .0698364     1.39   0.166     .9639862    1.238456
          3  |   1.254446   .0796271     3.57   0.000     1.107698    1.420636
          4  |   1.351917   .0867306     4.70   0.000     1.192181    1.533055
5 most de..  |   1.689038   .1104224     8.02   0.000     1.485906    1.919939
             |
1.htdiag_o~p |   1.126513   .0470619     2.85   0.004     1.037948    1.222634
1.~y_disease |   2.179622   .1269222    13.38   0.000      1.94453    2.443136
    1.asthma |   .9914848   .0506799    -0.17   0.867     .8969675    1.095962
1.~c_disease |   1.889777   .1018287    11.81   0.000     1.700374    2.100278
             |
     diabcat |
T1DM, con..  |   2.428459   .5943778     3.63   0.000     1.503124    3.923437
T1DM, unc..  |   2.414656   .4001391     5.32   0.000      1.74502    3.341259
T2DM, con..  |   1.619029   .1049215     7.44   0.000     1.425911    1.838303
T2DM, unc..  |   1.824561   .1310773     8.37   0.000     1.584921    2.100435
Diabetes,..  |   1.603945   .8407556     0.90   0.367     .5741251    4.480971
             |
cancer_exh~t |
  Last year  |   36.74943   2.214259    59.82   0.000     32.65602    41.35594
2-5 years..  |   14.81055   .8276416    48.23   0.000     13.27408    16.52486
   5+ years  |   4.640278   .3190673    22.32   0.000     4.055226    5.309737
             |
cancer_hae~t |
  Last year  |   6.648958   1.680628     7.49   0.000     4.051344    10.91209
2-5 years..  |   4.138833   .7418102     7.93   0.000     2.912833    5.880852
   5+ years  |   2.129762   .3556988     4.53   0.000     1.535215    2.954563
             |
1.~r_disease |   6.125817   .4597661    24.15   0.000     5.287837    7.096594
1.stroke_d~a |    1.95905   .1620883     8.13   0.000     1.665783    2.303946
1.other_ne~o |   2.892876   .3004208    10.23   0.000     2.360118    3.545894
             |
reduced_ki~t |
Stage 3a/..  |   1.879128   .1390222     8.53   0.000     1.625483    2.172352
Stage 4/5..  |   5.338527   .8642142    10.35   0.000      3.88711    7.331893
             |
      1.esrd |   1.681033   .3090162     2.83   0.005     1.172476    2.410175
1.other_tr~t |   .9114052   .2718815    -0.31   0.756      .507913    1.635436
2.tot_adul~h |   .6399467   .0902675    -3.16   0.002     .4853754    .8437424
  1.asplenia |   1.655757   .3590818     2.33   0.020     1.082424    2.532768
1.ra_sle_p~s |   1.107399   .0792395     1.43   0.154     .9624909    1.274123
1.other_im~o |   2.126703   .3612486     4.44   0.000      1.52447    2.966844
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -17940.584
Iteration 1:   log pseudolikelihood = -16305.992
Iteration 2:   log pseudolikelihood = -15364.096
Iteration 3:   log pseudolikelihood = -15062.131
Iteration 4:   log pseudolikelihood = -15054.735
Iteration 5:   log pseudolikelihood = -15054.646
Iteration 6:   log pseudolikelihood = -15054.646
Refining estimates:
Iteration 0:   log pseudolikelihood = -15054.646

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,589,174             Number of obs    =   2,589,174
No. of failures      =        1,548
Time at risk         =    429646068
                                                Wald chi2(42)    =    12103.45
Log pseudolikelihood =   -15054.646             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,277,095 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .7176706    .122967    -1.94   0.053     .5129543    1.004088
Kids unde..  |   .7208373   .1201712    -1.96   0.050     .5199158     .999405
             |
        age1 |   1.088202    .029839     3.08   0.002     1.031262    1.148285
        age2 |    .995097   .0648739    -0.08   0.940     .8757348    1.130728
        age3 |   .9326665    .148776    -0.44   0.662     .6822529    1.274992
      1.male |   1.305463   .0703941     4.94   0.000     1.174533    1.450987
             |
   obese4cat |
Obese I ..)  |   .7396419   .0569461    -3.92   0.000     .6360427    .8601154
Obese II..)  |    .803897    .084202    -2.08   0.037      .654702     .987091
Obese II..)  |   1.069375    .132372     0.54   0.588     .8390051    1.362999
             |
smoke_nomiss |
     Former  |   1.154258   .0740778     2.24   0.025     1.017828    1.308975
    Current  |   2.016491   .1389865    10.18   0.000     1.761681    2.308157
             |
         imd |
          2  |    1.09022   .0957985     0.98   0.326     .9177368    1.295119
          3  |   1.110707   .1002174     1.16   0.245     .9306726    1.325568
          4  |   1.325888   .1158003     3.23   0.001     1.117287    1.573436
5 most de..  |   1.721758   .1503478     6.22   0.000     1.450919    2.043153
             |
1.htdiag_o~p |   1.210756   .0710874     3.26   0.001     1.079145    1.358418
1.~y_disease |   2.715407    .229311    11.83   0.000      2.30119    3.204183
    1.asthma |   .8473491   .0628344    -2.23   0.025     .7327271    .9799016
1.~c_disease |   1.756415   .1442359     6.86   0.000     1.495295    2.063133
             |
     diabcat |
T1DM, con..  |   2.709346   1.027748     2.63   0.009     1.288173    5.698422
T1DM, unc..  |    2.66761   .5839859     4.48   0.000     1.736919    4.096991
T2DM, con..  |   1.506151   .1489928     4.14   0.000     1.240695    1.828402
T2DM, unc..  |   1.910484   .1987674     6.22   0.000      1.55806    2.342625
Diabetes,..  |   4.823739   2.184285     3.48   0.001     1.985833    11.71723
             |
cancer_exh~t |
  Last year  |   49.76941   4.203507    46.26   0.000     42.17648    58.72928
2-5 years..  |   22.01178    1.74012    39.11   0.000     18.85229    25.70076
   5+ years  |   6.702405   .6453195    19.76   0.000     5.549776    8.094422
             |
cancer_hae~t |
  Last year  |   7.817386   2.567072     6.26   0.000     4.107183    14.87918
2-5 years..  |   4.952057   1.230841     6.44   0.000     3.042413    8.060335
   5+ years  |   2.017516    .516243     2.74   0.006     1.221831     3.33137
             |
1.~r_disease |   5.766891   .6764376    14.94   0.000     4.582458    7.257464
1.stroke_d~a |   2.062369   .2568861     5.81   0.000      1.61563    2.632637
1.other_ne~o |   3.526665   .5082352     8.75   0.000     2.658862    4.677703
             |
reduced_ki~t |
Stage 3a/..  |   1.767261   .2019948     4.98   0.000     1.412569    2.211014
Stage 4/5..  |   4.959704   1.308874     6.07   0.000     2.956803    8.319346
             |
      1.esrd |   1.380548   .4494756     0.99   0.322      .729322    2.613267
1.other_tr~t |   .5333521   .3001814    -1.12   0.264     .1769867    1.607265
             |
tot_adults~h |
          2  |   1.608189   .3062393     2.49   0.013     1.107254    2.335754
          3  |   1.589562   .3856075     1.91   0.056     .9880679     2.55722
             |
  1.asplenia |   1.733228   .5296524     1.80   0.072      .952224    3.154801
1.ra_sle_p~s |   .9348502   .1002591    -0.63   0.530     .7576244    1.153533
1.other_im~o |   2.408918    .571242     3.71   0.000     1.513461    3.834183
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -10829.872
Iteration 1:   log pseudolikelihood = -9693.8313
Iteration 2:   log pseudolikelihood = -9171.5137
Iteration 3:   log pseudolikelihood = -8895.3774
Iteration 4:   log pseudolikelihood = -8880.6002
Iteration 5:   log pseudolikelihood = -8880.4894
Iteration 6:   log pseudolikelihood = -8880.4894
Refining estimates:
Iteration 0:   log pseudolikelihood = -8880.4894

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,311,311             Number of obs    =   2,311,311
No. of failures      =          948
Time at risk         =    383583191
                                                Wald chi2(42)    =     7466.58
Log pseudolikelihood =   -8880.4894             Prob > chi2      =      0.0000

                     (Std. Err. adjusted for 953,786 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.028733   .1195724     0.24   0.807     .8191537    1.291934
Kids unde..  |   .9359425   .0922922    -0.67   0.502     .7714596    1.135495
             |
        age1 |   1.050996   .0291363     1.79   0.073     .9954136    1.109682
        age2 |   1.074431    .074775     1.03   0.302     .9374303    1.231453
        age3 |   .7995433    .139599    -1.28   0.200     .5678369    1.125798
      1.male |   1.265477   .0897873     3.32   0.001     1.101186    1.454281
             |
   obese4cat |
Obese I ..)  |   .9564026   .0894763    -0.48   0.634     .7961714    1.148881
Obese II..)  |   .8672112   .1278577    -0.97   0.334     .6495724     1.15777
Obese II..)  |   .9891933   .1723747    -0.06   0.950     .7029955    1.391905
             |
smoke_nomiss |
     Former  |   1.124387   .0911548     1.45   0.148     .9591981    1.318024
    Current  |   1.881831   .1686731     7.05   0.000     1.578648    2.243241
             |
         imd |
          2  |   1.123072    .123575     1.05   0.291     .9052059    1.393375
          3  |   1.140731   .1294854     1.16   0.246     .9131935    1.424964
          4  |   1.334229   .1491872     2.58   0.010     1.071651    1.661146
5 most de..  |   1.564188   .1827769     3.83   0.000     1.244014    1.966766
             |
1.htdiag_o~p |   1.233446   .0927693     2.79   0.005     1.064388    1.429356
1.~y_disease |   2.383699   .3030877     6.83   0.000     1.857895    3.058312
    1.asthma |   1.077795   .0941899     0.86   0.391     .9081316    1.279157
1.~c_disease |   1.906275   .2184255     5.63   0.000     1.522835    2.386263
             |
     diabcat |
T1DM, con..  |   1.939453   1.165836     1.10   0.270     .5970469    6.300135
T1DM, unc..  |   3.536176   .9225397     4.84   0.000     2.120641    5.896586
T2DM, con..  |   1.630675    .220384     3.62   0.000     1.251204    2.125232
T2DM, unc..  |   1.890052   .2589504     4.65   0.000     1.444951    2.472261
Diabetes,..  |   7.822246   3.835023     4.20   0.000     2.992345    20.44802
             |
cancer_exh~t |
  Last year  |   59.76408   7.039827    34.73   0.000     47.44321    75.28463
2-5 years..  |    25.2064   2.630839    30.92   0.000     20.54326    30.92803
   5+ years  |   8.935993   1.113404    17.58   0.000     6.999791    11.40777
             |
cancer_hae~t |
  Last year  |   11.83833   4.708929     6.21   0.000     5.428854    25.81503
2-5 years..  |   8.257645   2.190725     7.96   0.000     4.909479    13.88919
   5+ years  |   2.442715   .8604255     2.54   0.011     1.224741    4.871933
             |
1.~r_disease |   4.878406   .9002487     8.59   0.000     3.397812    7.004167
1.stroke_d~a |   2.352358   .4258065     4.73   0.000     1.649776    3.354143
1.other_ne~o |   4.133147   .8710623     6.73   0.000     2.734574    6.247005
             |
reduced_ki~t |
Stage 3a/..  |   1.694846   .2625868     3.41   0.001     1.250983    2.296196
Stage 4/5..  |    5.27327   1.801241     4.87   0.000     2.699772     10.2999
             |
      1.esrd |    1.54697   .5852147     1.15   0.249     .7370122    3.247052
1.other_tr~t |   1.217638   .8176416     0.29   0.769     .3265414    4.540445
             |
tot_adults~h |
          2  |   .9523277   .2758237    -0.17   0.866     .5398238    1.680045
          3  |   1.166207   .3479301     0.52   0.606     .6498686    2.092792
             |
  1.asplenia |   1.083251   .5745127     0.15   0.880      .383077    3.063177
1.ra_sle_p~s |   1.209113    .154084     1.49   0.136     .9418758    1.552174
1.other_im~o |   1.542225   .6102948     1.09   0.274     .7100796    3.349564
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -3960.4468
Iteration 1:   log pseudolikelihood = -3514.8407
Iteration 2:   log pseudolikelihood = -3350.4862
Iteration 3:   log pseudolikelihood = -3192.1533
Iteration 4:   log pseudolikelihood = -3175.3659
Iteration 5:   log pseudolikelihood = -3174.7736
Iteration 6:   log pseudolikelihood = -3174.7735
Refining estimates:
Iteration 0:   log pseudolikelihood = -3174.7735

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    1,045,474             Number of obs    =   1,045,474
No. of failures      =          373
Time at risk         =    173507807
                                                Wald chi2(42)    =     4238.75
Log pseudolikelihood =   -3174.7735             Prob > chi2      =      0.0000

                     (Std. Err. adjusted for 376,510 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .7223739   .1008848    -2.33   0.020      .549396    .9498141
Kids unde..  |   .9065385   .1345771    -0.66   0.509      .677679    1.212686
             |
        age1 |   1.079554   .0448191     1.84   0.065     .9951895    1.171071
        age2 |   1.008677   .1063605     0.08   0.935     .8203451    1.240245
        age3 |   .9021867   .2406914    -0.39   0.700     .5348194    1.521898
      1.male |   1.235873   .1378452     1.90   0.058     .9931927     1.53785
             |
   obese4cat |
Obese I ..)  |    .811666   .1288551    -1.31   0.189     .5946286    1.107921
Obese II..)  |   .8609245   .1949419    -0.66   0.508     .5523631    1.341854
Obese II..)  |   .8972588   .2786935    -0.35   0.727     .4881237    1.649322
             |
smoke_nomiss |
     Former  |   1.131451   .1507629     0.93   0.354     .8713952    1.469116
    Current  |   1.761892   .2432236     4.10   0.000      1.34423    2.309324
             |
         imd |
          2  |   .8939788   .1725365    -0.58   0.561     .6124161    1.304992
          3  |   .9986087   .1910293    -0.01   0.994     .6863796    1.452868
          4  |   1.036384   .1904167     0.19   0.846     .7229826    1.485639
5 most de..  |   1.516377   .2680175     2.36   0.018     1.072404    2.144153
             |
1.htdiag_o~p |   1.157862   .1452591     1.17   0.243      .905461    1.480621
1.~y_disease |   4.138271   .7228545     8.13   0.000     2.938562    5.827778
    1.asthma |   1.134441   .1602383     0.89   0.372     .8601035     1.49628
1.~c_disease |   1.895696   .3692396     3.28   0.001     1.294117    2.776923
             |
     diabcat |
T1DM, con..  |   3.184539   2.306931     1.60   0.110      .769879    13.17257
T1DM, unc..  |   2.839155    1.21031     2.45   0.014       1.2312     6.54711
T2DM, con..  |   .7457411   .1852903    -1.18   0.238     .4582417    1.213617
T2DM, unc..  |   1.486195   .3267914     1.80   0.072     .9658501    2.286872
Diabetes,..  |   2.687101   2.701572     0.98   0.326       .37454    19.27834
             |
cancer_exh~t |
  Last year  |    75.0312   13.33609    24.29   0.000      52.9601    106.3004
2-5 years..  |   29.92266   5.145946    19.76   0.000     21.36068    41.91655
   5+ years  |   7.804986   1.755483     9.14   0.000     5.022518    12.12894
             |
cancer_hae~t |
  Last year  |   7.299926   5.124023     2.83   0.005      1.84432    28.89354
2-5 years..  |   2.432939   1.798389     1.20   0.229     .5713957    10.35918
   5+ years  |   2.732609   1.463386     1.88   0.060     .9566123     7.80583
             |
1.~r_disease |   7.265661   1.684589     8.55   0.000     4.612313    11.44541
1.stroke_d~a |   3.303611   .8415608     4.69   0.000     2.005183    5.442817
1.other_ne~o |   5.116762   1.523762     5.48   0.000     2.854362    9.172368
             |
reduced_ki~t |
Stage 3a/..  |   1.954607   .5129996     2.55   0.011     1.168573    3.269362
Stage 4/5..  |   5.808488   2.535625     4.03   0.000     2.468774    13.66611
             |
      1.esrd |   2.114523   1.101357     1.44   0.151     .7618351    5.868996
1.other_tr~t |    3.44205   3.030793     1.40   0.160     .6127985    19.33378
             |
tot_adults~h |
          2  |   .9456435   .4949476    -0.11   0.915     .3390084    2.637815
          3  |   .9403789   .4924661    -0.12   0.907     .3369287    2.624628
             |
  1.asplenia |   1.299498   1.003281     0.34   0.734     .2861562    5.901307
1.ra_sle_p~s |    .732634   .1863643    -1.22   0.221     .4450021     1.20618
1.other_im~o |   2.855631   1.331668     2.25   0.024     1.144882    7.122679
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood =  -43402.43
Iteration 1:   log pseudolikelihood = -41663.216
Iteration 2:   log pseudolikelihood = -41196.851
Iteration 3:   log pseudolikelihood = -41187.358
Iteration 4:   log pseudolikelihood = -41187.357
Refining estimates:
Iteration 0:   log pseudolikelihood = -41187.357

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    4,829,125             Number of obs    =   4,829,125
No. of failures      =        3,567
Time at risk         =    801285093
                                                Wald chi2(6)     =     2982.50
Log pseudolikelihood =   -41187.357             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,594,883 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |    .629372   .0449398    -6.48   0.000     .5471773    .7239136
Kids unde..  |   .6390521   .0477574    -5.99   0.000     .5519816    .7398572
             |
        age1 |   1.063457   .0252141     2.59   0.009     1.015169    1.114042
        age2 |   1.121745   .0597059     2.16   0.031      1.01062    1.245088
        age3 |    .732175   .0928632    -2.46   0.014     .5710254    .9388029
      1.male |   1.267382    .042686     7.04   0.000     1.186421    1.353868
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood =  -43402.43
Iteration 1:   log pseudolikelihood =  -41170.07
Iteration 2:   log pseudolikelihood =  -40724.52
Iteration 3:   log pseudolikelihood = -40716.658
Iteration 4:   log pseudolikelihood = -40716.657
Refining estimates:
Iteration 0:   log pseudolikelihood = -40716.657

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    4,829,125             Number of obs    =   4,829,125
No. of failures      =        3,567
Time at risk         =    801285093
                                                Wald chi2(15)    =     3727.37
Log pseudolikelihood =   -40716.657             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,594,883 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .6870943    .047575    -5.42   0.000     .5998994    .7869629
Kids unde..  |   .7121613   .0528862    -4.57   0.000     .6156967    .8237394
             |
        age1 |   1.057758   .0256764     2.31   0.021     1.008612    1.109299
        age2 |   1.135028   .0613163     2.34   0.019     1.020994    1.261799
        age3 |   .7228075   .0928261    -2.53   0.011     .5619629     .929689
      1.male |   1.234074   .0421132     6.16   0.000     1.154233    1.319437
             |
   obese4cat |
Obese I ..)  |   .8741895   .0413325    -2.84   0.004     .7968195    .9590719
Obese II..)  |   1.059529   .0695235     0.88   0.378     .9316639    1.204943
Obese II..)  |   1.782393   .1276287     8.07   0.000     1.549005    2.050944
             |
smoke_nomiss |
     Former  |   1.520024   .0623783    10.20   0.000     1.402552    1.647334
    Current  |    2.76122   .1227636    22.84   0.000     2.530793    3.012627
             |
         imd |
          2  |    1.13191     .06498     2.16   0.031     1.011455     1.26671
          3  |   1.363516   .0768988     5.50   0.000     1.220829    1.522881
          4  |    1.46262    .084682     6.57   0.000     1.305717    1.638378
5 most de..  |   2.065536   .1197339    12.51   0.000     1.843703    2.314061
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 2.tot_adults_hh omitted because of collinearity
Iteration 0:   log pseudolikelihood = -42335.571
Iteration 1:   log pseudolikelihood = -41288.633
Iteration 2:   log pseudolikelihood = -38120.775
Iteration 3:   log pseudolikelihood = -36049.899
Iteration 4:   log pseudolikelihood = -35919.166
Iteration 5:   log pseudolikelihood = -35916.507
Iteration 6:   log pseudolikelihood = -35916.495
Iteration 7:   log pseudolikelihood = -35916.495
Refining estimates:
Iteration 0:   log pseudolikelihood = -35916.495

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    4,759,172             Number of obs    =   4,759,172
No. of failures      =        3,483
Time at risk         =    789681655
                                                Wald chi2(40)    =    22989.82
Log pseudolikelihood =   -35916.495             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,584,629 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .7298424   .0517112    -4.44   0.000     .6352128    .8385692
               Kids under 18  |   .7032358   .0575206    -4.30   0.000     .5990701    .8255138
                              |
                         age1 |   1.048916   .0251066     2.00   0.046     1.000845    1.099297
                         age2 |   1.122728   .0605049     2.15   0.032     1.010188    1.247804
                         age3 |   .6915223   .0890489    -2.86   0.004      .537273    .8900561
                       1.male |   1.218753   .0440213     5.48   0.000     1.135456     1.30816
                              |
                    obese4cat |
           Obese I (30-34.9)  |   .7544746    .038039    -5.59   0.000     .6834847    .8328378
          Obese II (35-39.9)  |   .8412922   .0585992    -2.48   0.013     .7339348    .9643536
             Obese III (40+)  |   1.215868   .0968854     2.45   0.014     1.040062    1.421392
                              |
                 smoke_nomiss |
                      Former  |   1.213458   .0520569     4.51   0.000       1.1156      1.3199
                     Current  |   2.134257   .1018048    15.89   0.000     1.943766    2.343415
                              |
                          imd |
                           2  |   1.081903   .0633705     1.34   0.179     .9645637    1.213517
                           3  |   1.244075   .0724319     3.75   0.000     1.109911    1.394455
                           4  |   1.305611   .0773736     4.50   0.000     1.162438    1.466419
             5 most deprived  |   1.726184   .1036334     9.09   0.000     1.534561    1.941735
                              |
           1.htdiag_or_highbp |   1.129802   .0440626     3.13   0.002     1.046659    1.219549
1.chronic_respiratory_disease |   2.241167   .1248751    14.48   0.000     2.009307    2.499782
                     1.asthma |    1.00869   .0474175     0.18   0.854      .919906    1.106042
    1.chronic_cardiac_disease |   1.862099   .0976171    11.86   0.000     1.680274      2.0636
                              |
                      diabcat |
            T1DM, controlled  |   2.697861   .6134436     4.36   0.000     1.727715    4.212763
          T1DM, uncontrolled  |      2.472   .3848342     5.81   0.000     1.821947    3.353985
            T2DM, controlled  |   1.591109   .1008874     7.32   0.000     1.405167    1.801657
          T2DM, uncontrolled  |   1.855586   .1260556     9.10   0.000     1.624263    2.119853
          Diabetes, no HbA1c  |   1.512863   .7868442     0.80   0.426      .545868    4.192874
                              |
            cancer_exhaem_cat |
                   Last year  |   42.71859   2.448244    65.51   0.000     38.17981    47.79694
               2-5 years ago  |   17.80305   .9339838    54.88   0.000     16.06345    19.73105
                    5+ years  |   5.421579   .3498213    26.20   0.000     4.777525    6.152457
                              |
              cancer_haem_cat |
                   Last year  |   7.867107    1.75999     9.22   0.000     5.074444    12.19668
               2-5 years ago  |   4.124682   .6972243     8.38   0.000     2.961459    5.744802
                    5+ years  |   2.197559   .3452219     5.01   0.000     1.615186    2.989914
                              |
      1.chronic_liver_disease |     5.9903   .4457356    24.06   0.000     5.177392    6.930844
            1.stroke_dementia |   1.981614   .1621343     8.36   0.000     1.688007    2.326289
                1.other_neuro |   2.832133   .2845564    10.36   0.000     2.325893    3.448557
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.868189   .1336032     8.74   0.000     1.623855    2.149287
           Stage 4/5 egfr<30  |   5.122318   .7908486    10.58   0.000     3.784837    6.932436
                              |
                       1.esrd |   1.545238    .277692     2.42   0.015     1.086495    2.197675
           1.other_transplant |    .861395   .2585211    -0.50   0.619     .4783443    1.551187
              2.tot_adults_hh |          1  (omitted)
                   1.asplenia |   1.463721   .3135635     1.78   0.075     .9618576    2.227438
           1.ra_sle_psoriasis |   1.070511   .0729677     1.00   0.317     .9366384    1.223518
               1.other_immuno |   1.961666   .3285966     4.02   0.000     1.412671    2.724011
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 2.tot_adults_hh omitted because of collinearity
Iteration 0:   log likelihood = -42335.571
Iteration 1:   log likelihood = -41288.633
Iteration 2:   log likelihood = -38120.775
Iteration 3:   log likelihood = -36049.899
Iteration 4:   log likelihood = -35919.166
Iteration 5:   log likelihood = -35916.507
Iteration 6:   log likelihood = -35916.495
Iteration 7:   log likelihood = -35916.495
Refining estimates:
Iteration 0:   log likelihood = -35916.495

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    4,759,172                  Number of obs    =   4,759,172
No. of failures =        3,483
Time at risk    =    789681655
                                                LR chi2(40)      =    12838.15
Log likelihood  =   -35916.495                  Prob > chi2      =      0.0000

-----------------------------------------------------------------------------------------------
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .7298424   .0478794    -4.80   0.000     .6417831    .8299844
               Kids under 18  |   .7032358   .0522403    -4.74   0.000     .6079515    .8134541
                              |
                         age1 |   1.048916   .0236289     2.12   0.034     1.003612    1.096266
                         age2 |   1.122728   .0571168     2.28   0.023     1.016181    1.240446
                         age3 |   .6915223   .0844126    -3.02   0.003     .5443797    .8784366
                       1.male |   1.218753   .0429094     5.62   0.000     1.137488    1.305823
                              |
                    obese4cat |
           Obese I (30-34.9)  |   .7544746   .0368303    -5.77   0.000     .6856343    .8302267
          Obese II (35-39.9)  |   .8412922   .0570923    -2.55   0.011     .7365159    .9609739
             Obese III (40+)  |   1.215868   .0917607     2.59   0.010      1.04869    1.409698
                              |
                 smoke_nomiss |
                      Former  |   1.213458   .0512498     4.58   0.000     1.117056    1.318181
                     Current  |   2.134257   .0988492    16.37   0.000     1.949049    2.337063
                              |
                          imd |
                           2  |   1.081903   .0627509     1.36   0.175      .965647    1.212156
                           3  |   1.244075   .0710382     3.82   0.000     1.112351    1.391397
                           4  |   1.305611   .0757808     4.59   0.000     1.165221    1.462917
             5 most deprived  |   1.726184   .1004449     9.38   0.000     1.540127    1.934718
                              |
           1.htdiag_or_highbp |   1.129802   .0419861     3.28   0.001     1.050436    1.215164
1.chronic_respiratory_disease |   2.241167   .1135987    15.92   0.000      2.02922    2.475251
                     1.asthma |    1.00869   .0460521     0.19   0.850     .9223499    1.103112
    1.chronic_cardiac_disease |   1.862099   .0914632    12.66   0.000     1.691193    2.050276
                              |
                      diabcat |
            T1DM, controlled  |   2.697861   .5726843     4.68   0.000      1.77964    4.089847
          T1DM, uncontrolled  |      2.472   .3498934     6.39   0.000     1.873127    3.262344
            T2DM, controlled  |   1.591109   .0940527     7.86   0.000     1.417047    1.786552
          T2DM, uncontrolled  |   1.855586   .1205071     9.52   0.000      1.63381    2.107466
          Diabetes, no HbA1c  |   1.512863   .7589132     0.83   0.409     .5659822    4.043865
                              |
            cancer_exhaem_cat |
                   Last year  |   42.71859   2.150673    74.58   0.000     38.70464    47.14882
               2-5 years ago  |   17.80305   .8598662    59.62   0.000     16.19506    19.57071
                    5+ years  |   5.421579   .3369858    27.20   0.000     4.799745    6.123975
                              |
              cancer_haem_cat |
                   Last year  |   7.867107   1.397894    11.61   0.000     5.553494    11.14458
               2-5 years ago  |   4.124682   .6313226     9.26   0.000     3.055665    5.567691
                    5+ years  |   2.197559   .3233684     5.35   0.000     1.646976    2.932203
                              |
      1.chronic_liver_disease |     5.9903   .3741526    28.66   0.000     5.300084    6.770402
            1.stroke_dementia |   1.981614   .1395078     9.71   0.000     1.726209    2.274807
                1.other_neuro |   2.832133   .2614986    11.27   0.000     2.363306    3.393965
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.868189   .1265006     9.23   0.000     1.636001    2.133331
           Stage 4/5 egfr<30  |   5.122318   .6341845    13.19   0.000     4.018657    6.529083
                              |
                       1.esrd |   1.545238   .2390312     2.81   0.005     1.141101    2.092507
           1.other_transplant |    .861395    .254225    -0.51   0.613      .483043    1.536098
              2.tot_adults_hh |          1  (omitted)
                   1.asplenia |   1.463721    .302215     1.85   0.065     .9765855    2.193846
           1.ra_sle_psoriasis |   1.070511    .067781     1.08   0.282     .9455752    1.211954
               1.other_immuno |   1.961666   .2916739     4.53   0.000     1.465759    2.625351
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -122812.05
Iteration 1:   log pseudolikelihood = -118262.95
Iteration 2:   log pseudolikelihood =  -116801.6
Iteration 3:   log pseudolikelihood = -116777.18
Iteration 4:   log pseudolikelihood = -116777.17
Iteration 5:   log pseudolikelihood = -116777.17
Refining estimates:
Iteration 0:   log pseudolikelihood = -116777.17

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,079,029             Number of obs    =  12,079,029
No. of failures      =        9,386
Time at risk         =   2004175954
                                                Wald chi2(6)     =     7722.78
Log pseudolikelihood =   -116777.17             Prob > chi2      =      0.0000

                     (Std. Err. adjusted for 6,854,273 clusters in household_id)
--------------------------------------------------------------------------------
               |               Robust
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
     kids_cat3 |
Kids under 12  |   .5671554   .0240761   -13.36   0.000     .5218768    .6163624
Kids under 18  |   .6039066   .0281887   -10.80   0.000     .5511096    .6617616
               |
          age1 |   1.122718   .0147942     8.78   0.000     1.094093    1.152092
          age2 |   .9873407   .0296161    -0.42   0.671     .9309676    1.047128
          age3 |   .9863832   .0711398    -0.19   0.849     .8563581    1.136151
        1.male |    1.38515   .0290369    15.54   0.000     1.329392    1.443247
--------------------------------------------------------------------------------
                                                             Stratified by stp

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.02114         5.40        1         0.0201
      2.kids_cat3 |      0.00709         0.49        1         0.4861
      age1        |      0.00004         0.00        1         0.9967
      age2        |      0.00004         0.00        1         0.9961
      age3        |      0.00076         0.01        1         0.9314
      0b.male     |            .            .        1             .
      1.male      |     -0.01072         1.10        1         0.2951
      ------------+---------------------------------------------------
      global test |                      8.60        6         0.1971
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -122812.05
Iteration 1:   log pseudolikelihood = -116923.58
Iteration 2:   log pseudolikelihood = -115518.29
Iteration 3:   log pseudolikelihood = -115496.95
Iteration 4:   log pseudolikelihood = -115496.94
Iteration 5:   log pseudolikelihood = -115496.94
Refining estimates:
Iteration 0:   log pseudolikelihood = -115496.94

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,079,029             Number of obs    =  12,079,029
No. of failures      =        9,386
Time at risk         =   2004175954
                                                Wald chi2(15)    =     9675.67
Log pseudolikelihood =   -115496.94             Prob > chi2      =      0.0000

                          (Std. Err. adjusted for 6,854,273 clusters in household_id)
-------------------------------------------------------------------------------------
                    |               Robust
                 _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          kids_cat3 |
     Kids under 12  |   .5906231   .0245482   -12.67   0.000     .5444171    .6407507
     Kids under 18  |   .6585665   .0305863    -8.99   0.000      .601266    .7213277
                    |
               age1 |   1.101854   .0146984     7.27   0.000     1.073419    1.131042
               age2 |   1.027855   .0311151     0.91   0.364      .968645    1.090685
               age3 |   .9108682   .0662327    -1.28   0.199     .7898805    1.050388
             1.male |   1.318719   .0279613    13.05   0.000     1.265039    1.374677
                    |
          obese4cat |
 Obese I (30-34.9)  |   .8605263   .0254493    -5.08   0.000     .8120646      .91188
Obese II (35-39.9)  |   1.059026   .0428179     1.42   0.156     .9783433    1.146362
   Obese III (40+)  |   1.588831   .0734278    10.02   0.000     1.451241    1.739466
                    |
       smoke_nomiss |
            Former  |    1.51295    .039495    15.86   0.000     1.437488    1.592373
           Current  |   2.792166   .0740824    38.70   0.000     2.650678    2.941206
                    |
                imd |
                 2  |   1.123044   .0422892     3.08   0.002     1.043143    1.209064
                 3  |   1.320825    .048551     7.57   0.000     1.229013    1.419495
                 4  |   1.537856   .0556807    11.89   0.000     1.432506    1.650953
   5 most deprived  |   2.007402   .0725344    19.29   0.000     1.870155    2.154722
-------------------------------------------------------------------------------------
                                                             Stratified by stp

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.02031         4.66        1         0.0308
      2.kids_cat3 |      0.00594         0.34        1         0.5623
      age1        |      0.00130         0.02        1         0.8779
      age2        |     -0.00128         0.02        1         0.8831
      age3        |      0.00195         0.05        1         0.8254
      0b.male     |            .            .        1             .
      1.male      |     -0.00917         0.83        1         0.3628
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00303         0.09        1         0.7668
      3.obese4cat |     -0.01013         0.98        1         0.3212
      4.obese4cat |      0.00370         0.13        1         0.7144
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00418         0.16        1         0.6857
      3.smoke_no~s|     -0.01565         2.36        1         0.1244
      1b.imd      |            .            .        1             .
      2.imd       |      0.01024         0.99        1         0.3205
      3.imd       |      0.00140         0.02        1         0.8911
      4.imd       |      0.00801         0.62        1         0.4306
      5.imd       |     -0.00119         0.01        1         0.9065
      ------------+---------------------------------------------------
      global test |                     14.92       15         0.4574
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -119353.41
Iteration 1:   log pseudolikelihood = -117467.55
Iteration 2:   log pseudolikelihood = -117356.34
Iteration 3:   log pseudolikelihood = -114297.12
Iteration 4:   log pseudolikelihood = -104482.09
Iteration 5:   log pseudolikelihood = -103343.25
Iteration 6:   log pseudolikelihood = -103178.05
Iteration 7:   log pseudolikelihood = -103176.13
Iteration 8:   log pseudolikelihood = -103176.13
Refining estimates:
Iteration 0:   log pseudolikelihood = -103176.13

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,895,119             Number of obs    =  11,895,119
No. of failures      =        9,133
Time at risk         =   1973675373
                                                Wald chi2(42)    =    53993.61
Log pseudolikelihood =   -103176.13             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,799,224 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .6625191   .0286112    -9.53   0.000     .6087498    .7210376
               Kids under 18  |   .7151243   .0345137    -6.95   0.000     .6505796    .7860727
                              |
                         age1 |   1.093721   .0144531     6.78   0.000     1.065757    1.122418
                         age2 |   1.017345   .0308936     0.57   0.571     .9585611    1.079733
                         age3 |   .8696231   .0637783    -1.90   0.057     .7531887    1.004057
                       1.male |   1.315086   .0293765    12.26   0.000     1.258752    1.373942
                              |
                    obese4cat |
           Obese I (30-34.9)  |   .7483866    .023608    -9.19   0.000     .7035171    .7961178
          Obese II (35-39.9)  |   .8467417   .0367345    -3.83   0.000     .7777194    .9218897
             Obese III (40+)  |   1.140393   .0573634     2.61   0.009     1.033327    1.258552
                              |
                 smoke_nomiss |
                      Former  |   1.212833   .0332186     7.05   0.000     1.149442    1.279719
                     Current  |   2.126972   .0612368    26.21   0.000     2.010274    2.250445
                              |
                          imd |
                           2  |    1.08677   .0417094     2.17   0.030      1.00802    1.171672
                           3  |   1.211935   .0459091     5.07   0.000     1.125214     1.30534
                           4  |   1.344897   .0502709     7.93   0.000      1.24989    1.447125
             5 most deprived  |    1.60425    .060417    12.55   0.000       1.4901    1.727145
                              |
           1.htdiag_or_highbp |   1.184804    .028495     7.05   0.000      1.13025     1.24199
1.chronic_respiratory_disease |   2.264795   .0771199    24.01   0.000     2.118576    2.421105
                     1.asthma |    1.01576   .0294502     0.54   0.590     .9596484    1.075153
    1.chronic_cardiac_disease |   1.864166   .0603709    19.23   0.000     1.749518    1.986327
                              |
                      diabcat |
            T1DM, controlled  |   2.418461   .3517278     6.07   0.000     1.818632    3.216127
          T1DM, uncontrolled  |   2.566179   .2415292    10.01   0.000     2.133888    3.086044
            T2DM, controlled  |   1.391309   .0568265     8.09   0.000     1.284273    1.507266
          T2DM, uncontrolled  |   1.786813   .0735532    14.10   0.000     1.648313     1.93695
          Diabetes, no HbA1c  |   2.976482    .645437     5.03   0.000     1.945916    4.552842
                              |
            cancer_exhaem_cat |
                   Last year  |    37.9757    1.37324   100.58   0.000     35.37736    40.76487
               2-5 years ago  |   14.94262   .5177654    78.04   0.000     13.96151    15.99267
                    5+ years  |   4.946848   .2050246    38.57   0.000     4.560895    5.365461
                              |
              cancer_haem_cat |
                   Last year  |   7.343632   1.045853    14.00   0.000     5.555024    9.708136
               2-5 years ago  |   4.168393   .4650877    12.79   0.000     3.349624    5.187299
                    5+ years  |    1.99007   .2112833     6.48   0.000     1.616208    2.450414
                              |
      1.chronic_liver_disease |   5.366741   .2374101    37.98   0.000     4.921027    5.852824
            1.stroke_dementia |   1.892133   .0944013    12.78   0.000     1.715869    2.086505
                1.other_neuro |   3.013333   .1888392    17.60   0.000     2.665042    3.407141
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.823731   .0828104    13.23   0.000     1.668439    1.993478
           Stage 4/5 egfr<30  |   5.195525   .4791193    17.87   0.000     4.336442    6.224798
                              |
                       1.esrd |   1.660462   .1833169     4.59   0.000     1.337382    2.061592
           1.other_transplant |   .8881965   .1718848    -0.61   0.540      .607832     1.29788
                              |
                tot_adults_hh |
                           2  |   .8164695     .02142    -7.73   0.000     .7755482    .8595499
                           3  |   .8039976   .0225492    -7.78   0.000     .7609948    .8494305
                              |
                   1.asplenia |   1.988315   .2382897     5.73   0.000     1.572073    2.514765
           1.ra_sle_psoriasis |   1.084387   .0451245     1.95   0.052     .9994555    1.176536
               1.other_immuno |   1.769331   .1830756     5.51   0.000     1.444555    2.167127
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.01856         3.94        1         0.0470
      2.kids_cat3 |      0.00575         0.32        1         0.5712
      age1        |      0.00095         0.01        1         0.9127
      age2        |     -0.00021         0.00        1         0.9806
      age3        |      0.00136         0.02        1         0.8792
      0b.male     |            .            .        1             .
      1.male      |     -0.01037         1.06        1         0.3022
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00150         0.02        1         0.8800
      3.obese4cat |     -0.00487         0.24        1         0.6239
      4.obese4cat |      0.01052         1.15        1         0.2831
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00010         0.00        1         0.9920
      3.smoke_no~s|     -0.00787         0.65        1         0.4216
      1b.imd      |            .            .        1             .
      2.imd       |      0.00720         0.49        1         0.4857
      3.imd       |      0.00365         0.13        1         0.7204
      4.imd       |      0.01066         1.12        1         0.2904
      5.imd       |      0.00196         0.04        1         0.8447
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.01835         3.71        1         0.0540
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01375         2.43        1         0.1194
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.00945         0.88        1         0.3490
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00157         0.03        1         0.8657
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00502         0.29        1         0.5897
      3.diabcat   |     -0.00573         0.42        1         0.5186
      4.diabcat   |     -0.00994         1.10        1         0.2932
      5.diabcat   |     -0.00483         0.25        1         0.6203
      6.diabcat   |      0.00458         0.21        1         0.6475
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.01460         3.12        1         0.0772
      3.cancer_e~t|      0.00718         0.74        1         0.3887
      4.cancer_e~t|     -0.00164         0.03        1         0.8620
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.00379         0.21        1         0.6453
      3.cancer_h~t|     -0.00802         0.81        1         0.3685
      4.cancer_h~t|     -0.00288         0.09        1         0.7671
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.00091         0.01        1         0.9111
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01863         4.80        1         0.0285
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.01254         2.15        1         0.1426
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.00990         1.05        1         0.3047
      3.reduced_~t|      0.00666         0.66        1         0.4167
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00439         0.28        1         0.5959
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00915         0.89        1         0.3448
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01130         1.27        1         0.2590
      3.tot_adul~h|      0.00426         0.18        1         0.6732
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.01411         2.14        1         0.1436
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00836         0.72        1         0.3965
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00655         0.51        1         0.4767
      ------------+---------------------------------------------------
      global test |                     45.90       42         0.3136
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
(24,147,473 observations (episodes) created)

         failure _d:  non_covid_death
   analysis time _t:  (stime_non_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
diabetes_date:  factor variables may not contain negative values
r(452);

end of do-file

r(452);

