-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\school-age-children-and-covid\analysis\log\16_explorat
> ory_analysis_covid_tpp_prob.log
  log type:  text
 opened on:   6 Aug 2020, 21:50:06

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. *Run main MV model for different hh sizes
. forvalues x=1/5 { 
  4. stcox   i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                          if household_size==`x', ///
>                          strata(stp) vce(cluster household_id) 
  5. }
  6.                         
. 
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. 
. 
. 
. 
. *Run models for hh with 2 adults
. *Age and sex adj
. stcox   i.kids_cat3 age1 age2 age3              ///
>                         i.male                                          ///
>                          if tot_adults_hh==2, strata(stp) vce(cluster househo
> ld_id) 
  7.                          
.                          
. *Demog adj
. stcox   i.kids_cat3 age1 age2 age3                      ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                          if tot_adults_hh==2, strata(stp) vce(cluster househo
> ld_id) 
  8. 
. 
. *FULL
.  stcox  i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                          if tot_adults_hh==2, strata(stp) vce(cluster househo
> ld_id) 
  9. 
. 
.                          
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. *****************************************************************************
> ***
. 
. 
. 
. *Investigate non-PH
. 
. 
. *Full MV model without clustering (to see if the clustering by hh id is affec
> ting PH test)
.  stcox  i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                          if tot_adults_hh==2, strata(stp) 
 10. 
. 
. *Plot hazards
. *Age and sex adj
. stcox   i.kids_cat3 age1 age2 age3              ///
>                         i.male  , strata(stp) vce(cluster household_id) 
 11. estat phtest, d         
 12.                          
.                          
. *Demog adj
. stcox   i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd           , strata(stp) vce(cluster household_i
> d) 
 13. estat phtest, d         
 14. 
. 
. *FULL
.  stcox  i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                         i.other_immuno, strata(stp) vce(cluster household_id)
>  
 15. 
. estat phtest, d         
 16. 
. *Fit time interactions
. 
. stsplit timeperiod, at(60 90)
 17. 
. *make vars binary
. gen anyreduced_kidney_function = reduced_kidney_function_cat>=2
 18. gen anyobesity = obese4cat>=2
 19. gen highimd = imd>=3
 20. 
. stcox   i.kids_cat3 age1 age2 age3              ///
>                         i.male                                               
>    ///
>                         i.obese4cat                                     ///
>                         i.smoke_nomiss                                  ///
>                         i.imd                                                
>    ///
>                         i.htdiag_or_highbp                              ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                             
>    ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                            
>    ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.reduced_kidney_function_cat   ///
>                         i.esrd                                               
>    ///
>                         i.other_transplant                                   
>    ///
>                         i.tot_adults_hh                                 ///
>                         i.asplenia                                           
>    ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immuno                                  ///
>                 60.timeperiod#1.anyobesity                                   
>                    ///
>                         90.timeperiod#1.anyobesity                           
>                    ///
>                 60.timeperiod#3.smoke_nomiss                                 
>            ///
>                         90.timeperiod#3.smoke_nomiss                         
>            ///
>                 60.timeperiod#1.highimd                                      
>                    ///
>                         90.timeperiod#1.highimd                              
>                    ///
>                 60.timeperiod#1.diabetes                                     
>                    ///
>                         90.timeperiod#1.diabetes                             
>                    ///             
>                 60.timeperiod#1.chronic_liver_disease                        
>    ///
>                         90.timeperiod#1.chronic_liver_disease                
>    ///
>                 60.timeperiod#1.cancer_exhaem_cat                            
>            ///
>                         90.timeperiod#1.cancer_exhaem_cat                    
>            ///
>                         90.timeperiod#1.asplenia                             
>                    ///
>                 60.timeperiod#1.other_immuno                                 
>            ///
>                         90.timeperiod#1.other_immuno                         
>            ///
> , strata(stp) vce(cluster household_id) 
 21. 
. estat phtest, d
 22. 
. 
. }

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 0.kids_cat3 omitted because of collinearity
note: 1.tot_adults_hh omitted because of collinearity
Iteration 0:   log pseudolikelihood =  -56100.86
Iteration 1:   log pseudolikelihood = -55598.254
Iteration 2:   log pseudolikelihood = -55295.672
Iteration 3:   log pseudolikelihood = -55275.735
Iteration 4:   log pseudolikelihood = -55275.579
Iteration 5:   log pseudolikelihood = -55275.579
Refining estimates:
Iteration 0:   log pseudolikelihood = -55275.579

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,146,288             Number of obs    =   2,146,288
No. of failures      =        4,914
Time at risk         =    351994461
                                                Wald chi2(38)    =     2530.12
Log pseudolikelihood =   -55275.579             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,146,288 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
    No kids  |          1  (omitted)
        age1 |   1.029388   .0069869     4.27   0.000     1.015785    1.043174
        age2 |   .9579534   .0183915    -2.24   0.025     .9225766    .9946868
        age3 |   1.070947   .0555859     1.32   0.187     .9673591    1.185628
      1.male |    .683913   .0201867   -12.87   0.000     .6454706     .724645
             |
   obese4cat |
Obese I ..)  |   1.277637   .0525047     5.96   0.000     1.178765    1.384802
Obese II..)  |   1.436755    .078046     6.67   0.000     1.291649    1.598162
Obese II..)  |   1.587974   .1025364     7.16   0.000     1.399203    1.802212
             |
smoke_nomiss |
     Former  |   1.099976   .0369464     2.84   0.005     1.029894    1.174826
    Current  |   .6451043   .0268365   -10.54   0.000      .594593    .6999066
             |
         imd |
          2  |   1.030161   .0535241     0.57   0.567     .9304207    1.140594
          3  |   1.071838   .0545722     1.36   0.173      .970042    1.184316
          4  |   1.196291    .059298     3.62   0.000     1.085536    1.318346
5 most de..  |   1.271172   .0644885     4.73   0.000     1.150858    1.404065
             |
1.htdiag_o~p |   1.175795   .0412011     4.62   0.000     1.097753    1.259386
1.~y_disease |   2.001035   .1195796    11.61   0.000     1.779868    2.249684
    1.asthma |   1.192774   .0429505     4.90   0.000     1.111494    1.279997
1.~c_disease |   1.309238   .0799737     4.41   0.000     1.161512    1.475752
             |
     diabcat |
T1DM, con..  |   .8909589   .2872321    -0.36   0.720     .4736339    1.675995
T1DM, unc..  |   2.044707    .267369     5.47   0.000     1.582438    2.642016
T2DM, con..  |   1.353091   .0905811     4.52   0.000     1.186709      1.5428
T2DM, unc..  |   1.651067   .1115305     7.42   0.000     1.446324    1.884794
Diabetes,..  |   2.459062   .8255021     2.68   0.007      1.27357    4.748059
             |
cancer_exh~t |
  Last year  |   1.948663   .3477016     3.74   0.000     1.373587    2.764505
2-5 years..  |   1.182972   .1566355     1.27   0.204     .9125739    1.533489
   5+ years  |    1.14311    .115993     1.32   0.187     .9369474    1.394635
             |
cancer_hae~t |
  Last year  |   .4885752   .4896293    -0.71   0.475      .068532    3.483128
2-5 years..  |   2.667987   .6955013     3.76   0.000     1.600623    4.447114
   5+ years  |   1.820597   .3501496     3.12   0.002     1.248835    2.654133
             |
1.~r_disease |   1.910353   .1872224     6.60   0.000     1.576494    2.314914
1.stroke_d~a |   1.704565   .1509717     6.02   0.000     1.432924    2.027699
1.other_ne~o |   1.557593   .1680816     4.11   0.000     1.260666    1.924457
             |
reduced_ki~t |
Stage 3a/..  |   1.263601   .1166192     2.54   0.011     1.054513    1.514148
Stage 4/5..  |    2.20073   .3964536     4.38   0.000     1.546059     3.13262
             |
      1.esrd |   3.598323   .6251236     7.37   0.000     2.559906    5.057971
1.other_tr~t |   1.392677   .4385482     1.05   0.293     .7512955    2.581608
1.tot_adul~h |          1  (omitted)
  1.asplenia |   2.925494   .5623587     5.58   0.000      2.00713    4.264058
1.ra_sle_p~s |   1.092296   .0674807     1.43   0.153     .9677293    1.232896
1.other_im~o |   2.139019   .2768529     5.87   0.000     1.659754    2.756674
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -87120.714
Iteration 1:   log pseudolikelihood =  -86508.78
Iteration 2:   log pseudolikelihood =  -86193.85
Iteration 3:   log pseudolikelihood = -86152.268
Iteration 4:   log pseudolikelihood = -86147.691
Iteration 5:   log pseudolikelihood =  -86147.59
Iteration 6:   log pseudolikelihood =  -86147.59
Refining estimates:
Iteration 0:   log pseudolikelihood =  -86147.59

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,836,796             Number of obs    =   2,836,796
No. of failures      =        7,443
Time at risk         =    467981557
                                                Wald chi2(41)    =     2538.92
Log pseudolikelihood =    -86147.59             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,777,762 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.050753   .0951143     0.55   0.584     .8799337    1.254734
Kids unde..  |   .9680721   .0984162    -0.32   0.750     .7931819    1.181524
             |
        age1 |   1.010619   .0059831     1.78   0.074     .9989598    1.022414
        age2 |   1.019361   .0171524     1.14   0.254     .9862917     1.05354
        age3 |   .8960033   .0404501    -2.43   0.015     .8201289    .9788973
      1.male |   .7333748   .0172395   -13.19   0.000     .7003526    .7679541
             |
   obese4cat |
Obese I ..)  |    1.30438   .0414165     8.37   0.000      1.22568    1.388134
Obese II..)  |    1.48452   .0625313     9.38   0.000     1.366884     1.61228
Obese II..)  |   1.621519   .0819616     9.56   0.000     1.468578    1.790387
             |
smoke_nomiss |
     Former  |   1.037567   .0274368     1.39   0.163      .985162     1.09276
    Current  |   .6287851   .0233772   -12.48   0.000     .5845962    .6763142
             |
         imd |
          2  |   1.099972   .0451759     2.32   0.020     1.014899    1.192176
          3  |   1.194139   .0491666     4.31   0.000      1.10156    1.294499
          4  |   1.321182    .053977     6.82   0.000     1.219514    1.431326
5 most de..  |   1.491451   .0630791     9.45   0.000     1.372804    1.620352
             |
1.htdiag_o~p |   1.118838   .0309851     4.05   0.000     1.059727    1.181246
1.~y_disease |   1.631574   .0896833     8.91   0.000     1.464935    1.817168
    1.asthma |   1.258681   .0364232     7.95   0.000     1.189279    1.332132
1.~c_disease |    1.28339   .0645836     4.96   0.000     1.162851    1.416424
             |
     diabcat |
T1DM, con..  |   1.468718    .317021     1.78   0.075     .9620718    2.242174
T1DM, unc..  |   1.496981   .1986571     3.04   0.002     1.154137    1.941669
T2DM, con..  |   1.403354   .0754723     6.30   0.000      1.26296    1.559355
T2DM, unc..  |   1.937677   .1033883    12.40   0.000     1.745275    2.151289
Diabetes,..  |   .2491174   .2492083    -1.39   0.165     .0350665    1.769767
             |
cancer_exh~t |
  Last year  |   1.437533   .2254316     2.31   0.021     1.057143    1.954798
2-5 years..  |   1.048006    .112291     0.44   0.662     .8494927    1.292908
   5+ years  |   1.055513   .0830558     0.69   0.492     .9046584    1.231523
             |
cancer_hae~t |
  Last year  |   3.244083   1.035742     3.69   0.000     1.735114    6.065352
2-5 years..  |    2.31386    .508066     3.82   0.000     1.504646    3.558277
   5+ years  |    1.45607   .2481228     2.20   0.027     1.042635    2.033443
             |
1.~r_disease |   1.798775   .1808889     5.84   0.000     1.476992    2.190664
1.stroke_d~a |    1.36826   .1166313     3.68   0.000     1.157741    1.617057
1.other_ne~o |   1.228804   .1303176     1.94   0.052     .9981844    1.512706
             |
reduced_ki~t |
Stage 3a/..  |   1.226701   .0926863     2.70   0.007      1.05785    1.422503
Stage 4/5..  |      2.776   .4241271     6.68   0.000     2.057642    3.745148
             |
      1.esrd |   2.464322   .3924111     5.66   0.000      1.80366    3.366977
1.other_tr~t |   1.384078   .4285815     1.05   0.294     .7543706    2.539429
2.tot_adul~h |   1.007308   .0811893     0.09   0.928     .8601126    1.179694
  1.asplenia |   2.318446   .4279818     4.56   0.000     1.614605    3.329106
1.ra_sle_p~s |   1.149695   .0545172     2.94   0.003     1.047658    1.261669
1.other_im~o |   1.869132   .2490729     4.69   0.000     1.439502    2.426988
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -80417.532
Iteration 1:   log pseudolikelihood =  -79852.82
Iteration 2:   log pseudolikelihood = -79548.849
Iteration 3:   log pseudolikelihood = -79510.461
Iteration 4:   log pseudolikelihood = -79505.705
Iteration 5:   log pseudolikelihood = -79505.569
Iteration 6:   log pseudolikelihood = -79505.568
Refining estimates:
Iteration 0:   log pseudolikelihood = -79505.568

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,589,174             Number of obs    =   2,589,174
No. of failures      =        6,918
Time at risk         =    427325002
                                                Wald chi2(42)    =     2413.71
Log pseudolikelihood =   -79505.568             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 1,277,095 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.059417   .0753089     0.81   0.417     .9216353    1.217797
Kids unde..  |   1.038873   .0787045     0.50   0.615     .8955216    1.205173
             |
        age1 |   1.025686   .0057139     4.55   0.000     1.014548    1.036946
        age2 |   .9828884   .0162562    -1.04   0.297     .9515378    1.015272
        age3 |   1.006849   .0458699     0.15   0.881     .9208422    1.100888
      1.male |   .7430384   .0178925   -12.33   0.000     .7087845    .7789477
             |
   obese4cat |
Obese I ..)  |   1.315655   .0436998     8.26   0.000     1.232733    1.404154
Obese II..)  |    1.29695   .0606358     5.56   0.000     1.183388    1.421409
Obese II..)  |   1.589182   .0881072     8.36   0.000     1.425547    1.771601
             |
smoke_nomiss |
     Former  |   .9633681   .0267102    -1.35   0.178     .9124141    1.017168
    Current  |   .6050122   .0234555   -12.96   0.000     .5607434    .6527759
             |
         imd |
          2  |   1.095362   .0476273     2.09   0.036     1.005882    1.192803
          3  |   1.183092   .0518738     3.83   0.000     1.085667    1.289259
          4  |   1.422076    .061132     8.19   0.000     1.307169    1.547085
5 most de..  |   1.660522   .0726833    11.59   0.000     1.524005    1.809268
             |
1.htdiag_o~p |   1.143587   .0343413     4.47   0.000     1.078222    1.212915
1.~y_disease |   1.826835   .1203878     9.14   0.000     1.605482    2.078707
    1.asthma |   1.167711   .0353199     5.13   0.000     1.100498     1.23903
1.~c_disease |   1.255198   .0755804     3.77   0.000      1.11547    1.412428
             |
     diabcat |
T1DM, con..  |    .808036   .2702694    -0.64   0.524     .4194917     1.55646
T1DM, unc..  |   1.469534   .2128862     2.66   0.008      1.10629    1.952046
T2DM, con..  |    1.48339   .0904863     6.46   0.000     1.316231    1.671777
T2DM, unc..  |   1.729833    .110539     8.58   0.000     1.526199    1.960638
Diabetes,..  |   .8780844   .5062432    -0.23   0.822     .2836559    2.718195
             |
cancer_exh~t |
  Last year  |   2.060582   .3235243     4.60   0.000     1.514768     2.80307
2-5 years..  |   1.190034   .1455562     1.42   0.155     .9363679    1.512419
   5+ years  |   .9574559   .0970852    -0.43   0.668     .7848879    1.167965
             |
cancer_hae~t |
  Last year  |   2.465434   1.109427     2.01   0.045     1.020608     5.95563
2-5 years..  |   2.962771   .6824516     4.72   0.000     1.886385    4.653352
   5+ years  |   1.742118   .3169272     3.05   0.002     1.219625    2.488448
             |
1.~r_disease |   1.649191   .2114416     3.90   0.000     1.282741    2.120327
1.stroke_d~a |   1.102852   .1289971     0.84   0.403     .8769097     1.38701
1.other_ne~o |   1.182611   .1529753     1.30   0.195     .9177736     1.52387
             |
reduced_ki~t |
Stage 3a/..  |   1.273725   .1180577     2.61   0.009     1.062137    1.527464
Stage 4/5..  |   2.106259   .3741037     4.19   0.000      1.48705    2.983309
             |
      1.esrd |   3.294756   .5448584     7.21   0.000     2.382642    4.556041
1.other_tr~t |   .9830156     .42545    -0.04   0.968     .4208813    2.295943
             |
tot_adults~h |
          2  |   1.071149   .0508497     1.45   0.148     .9759816    1.175597
          3  |   1.047109     .08434     0.57   0.568     .8941927    1.226175
             |
  1.asplenia |   2.047205   .4631482     3.17   0.002     1.313984    3.189572
1.ra_sle_p~s |   1.175099     .06013     3.15   0.002     1.062964    1.299064
1.other_im~o |   1.930652   .2926249     4.34   0.000     1.434463    2.598477
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -75104.592
Iteration 1:   log pseudolikelihood = -74378.611
Iteration 2:   log pseudolikelihood = -74210.044
Iteration 3:   log pseudolikelihood = -74203.599
Iteration 4:   log pseudolikelihood = -74203.135
Iteration 5:   log pseudolikelihood = -74203.128
Iteration 6:   log pseudolikelihood = -74203.128
Refining estimates:
Iteration 0:   log pseudolikelihood = -74203.128

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    2,311,311             Number of obs    =   2,311,311
No. of failures      =        6,509
Time at risk         =    381714962
                                                Wald chi2(42)    =     2317.54
Log pseudolikelihood =   -74203.128             Prob > chi2      =      0.0000

                     (Std. Err. adjusted for 953,786 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .9776075   .0461105    -0.48   0.631     .8912842    1.072292
Kids unde..  |   1.000895   .0440168     0.02   0.984     .9182375    1.090994
             |
        age1 |   1.027723    .005667     4.96   0.000     1.016675     1.03889
        age2 |   .9844884   .0168966    -0.91   0.362     .9519224    1.018168
        age3 |   .9823058   .0481738    -0.36   0.716     .8922827    1.081411
      1.male |   .7358768   .0176929   -12.76   0.000     .7020038    .7713843
             |
   obese4cat |
Obese I ..)  |   1.331658   .0466732     8.17   0.000     1.243251    1.426351
Obese II..)  |   1.352245   .0678821     6.01   0.000     1.225534    1.492057
Obese II..)  |   1.675447   .0984035     8.79   0.000     1.493266    1.879853
             |
smoke_nomiss |
     Former  |   .8971719   .0262282    -3.71   0.000     .8472105    .9500795
    Current  |   .5607354   .0234787   -13.82   0.000     .5165556    .6086939
             |
         imd |
          2  |   1.267067   .0576346     5.20   0.000     1.158994    1.385217
          3  |    1.42284   .0666903     7.52   0.000     1.297954    1.559743
          4  |   1.673278   .0762658    11.29   0.000     1.530282    1.829636
5 most de..  |   1.830885    .086962    12.73   0.000     1.668135    2.009513
             |
1.htdiag_o~p |   1.145568   .0366057     4.25   0.000     1.076023    1.219608
1.~y_disease |   1.532131   .1319903     4.95   0.000     1.294096    1.813951
    1.asthma |   1.071936   .0348341     2.14   0.033     1.005791     1.14243
1.~c_disease |   1.546228   .1007336     6.69   0.000     1.360879    1.756821
             |
     diabcat |
T1DM, con..  |   1.387235   .3844374     1.18   0.238     .8058623    2.388027
T1DM, unc..  |    1.22211   .2239957     1.09   0.274     .8532903    1.750345
T2DM, con..  |   1.754567   .1142491     8.63   0.000     1.544343    1.993408
T2DM, unc..  |   2.026097   .1380074    10.37   0.000     1.772886    2.315473
Diabetes,..  |   1.391103   .6911533     0.66   0.506     .5253508    3.683569
             |
cancer_exh~t |
  Last year  |   2.162412   .3867216     4.31   0.000     1.523039    3.070193
2-5 years..  |   1.342161   .1786124     2.21   0.027     1.034019    1.742132
   5+ years  |   1.054442   .1242787     0.45   0.653      .836948    1.328456
             |
cancer_hae~t |
  Last year  |   4.903444   1.765976     4.41   0.000     2.420699    9.932569
2-5 years..  |   2.353843   .6852972     2.94   0.003     1.330328    4.164818
   5+ years  |   1.593122   .3442941     2.15   0.031     1.043022     2.43335
             |
1.~r_disease |   1.300147   .2089253     1.63   0.102     .9488768    1.781456
1.stroke_d~a |     1.4615   .1793098     3.09   0.002     1.149121    1.858796
1.other_ne~o |   1.311032   .1825896     1.94   0.052     .9978494    1.722509
             |
reduced_ki~t |
Stage 3a/..  |   1.147768   .1389502     1.14   0.255     .9053294    1.455129
Stage 4/5..  |   1.305345   .3732397     0.93   0.351     .7453144    2.286182
             |
      1.esrd |   2.882016   .6897778     4.42   0.000     1.802897    4.607038
1.other_tr~t |   1.853208    .725761     1.58   0.115     .8601476    3.992779
             |
tot_adults~h |
          2  |   1.134295   .0879332     1.63   0.104     .9744039    1.320424
          3  |   1.210552    .101304     2.28   0.022     1.027428    1.426315
             |
  1.asplenia |   2.764075   .6264054     4.49   0.000     1.772749    4.309753
1.ra_sle_p~s |   1.127707   .0631499     2.15   0.032     1.010486    1.258527
1.other_im~o |   2.550354   .3663846     6.52   0.000     1.924495    3.379748
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -35874.724
Iteration 1:   log pseudolikelihood = -35549.092
Iteration 2:   log pseudolikelihood = -35411.812
Iteration 3:   log pseudolikelihood = -35396.313
Iteration 4:   log pseudolikelihood = -35393.426
Iteration 5:   log pseudolikelihood = -35393.185
Iteration 6:   log pseudolikelihood = -35393.182
Iteration 7:   log pseudolikelihood = -35393.182
Refining estimates:
Iteration 0:   log pseudolikelihood = -35393.182

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    1,045,474             Number of obs    =   1,045,474
No. of failures      =        3,326
Time at risk         =    172412262
                                                Wald chi2(42)    =     1195.21
Log pseudolikelihood =   -35393.182             Prob > chi2      =      0.0000

                     (Std. Err. adjusted for 376,510 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   .9301159   .0518455    -1.30   0.194     .8338546     1.03749
Kids unde..  |   1.044488   .0653372     0.70   0.487     .9239685    1.180728
             |
        age1 |   1.036092   .0076021     4.83   0.000     1.021298    1.051099
        age2 |   .9600435   .0224098    -1.75   0.081     .9171107    1.004986
        age3 |   1.050874   .0709413     0.74   0.462     .9206379    1.199535
      1.male |   .7664453   .0257637    -7.91   0.000      .717577    .8186417
             |
   obese4cat |
Obese I ..)  |   1.234485   .0610942     4.26   0.000     1.120366    1.360227
Obese II..)  |   1.319851   .0905932     4.04   0.000     1.153717    1.509908
Obese II..)  |   1.497527   .1255663     4.82   0.000     1.270581     1.76501
             |
smoke_nomiss |
     Former  |   .8822252   .0373079    -2.96   0.003     .8120512    .9584632
    Current  |   .4839073   .0280427   -12.53   0.000     .4319512    .5421129
             |
         imd |
          2  |   1.178645   .0878202     2.21   0.027     1.018499    1.363973
          3  |   1.300563   .0969541     3.53   0.000     1.123767    1.505174
          4  |    1.50294   .1047981     5.84   0.000     1.310957    1.723038
5 most de..  |   1.683945   .1165289     7.53   0.000     1.470363     1.92855
             |
1.htdiag_o~p |   1.247806   .0556241     4.97   0.000     1.143412    1.361732
1.~y_disease |   1.695011   .1985267     4.51   0.000     1.347337      2.1324
    1.asthma |   1.075828   .0506234     1.55   0.120      .981046    1.179768
1.~c_disease |   1.144686   .1153813     1.34   0.180     .9394795    1.394714
             |
     diabcat |
T1DM, con..  |   1.543209   .6392939     1.05   0.295     .6851784    3.475728
T1DM, unc..  |   1.830853   .4137983     2.68   0.007     1.175628     2.85126
T2DM, con..  |   1.691226    .145657     6.10   0.000     1.428538    2.002219
T2DM, unc..  |   2.003762   .1739405     8.01   0.000     1.690269    2.375398
Diabetes,..  |   1.474522   .8551019     0.67   0.503     .4731772    4.594925
             |
cancer_exh~t |
  Last year  |   1.703357   .5163563     1.76   0.079      .940312    3.085597
2-5 years..  |   1.471347   .2851548     1.99   0.046     1.006347    2.151208
   5+ years  |   .7619454   .1682176    -1.23   0.218     .4943116    1.174483
             |
cancer_hae~t |
  Last year  |   8.669555    3.37101     5.55   0.000     4.045958    18.57685
2-5 years..  |   3.233422   1.140027     3.33   0.001     1.620127    6.453209
   5+ years  |   2.331817   .6317496     3.13   0.002      1.37114    3.965582
             |
1.~r_disease |   1.530178   .3068124     2.12   0.034     1.032927    2.266806
1.stroke_d~a |     1.1883   .2290148     0.90   0.371     .8144767    1.733699
1.other_ne~o |   1.245979   .2645098     1.04   0.300     .8218801    1.888917
             |
reduced_ki~t |
Stage 3a/..  |   1.401122   .2266168     2.09   0.037     1.020477    1.923751
Stage 4/5..  |   2.220823   .6969956     2.54   0.011     1.200516    4.108278
             |
      1.esrd |   1.699418   .5713902     1.58   0.115     .8792319    3.284711
1.other_tr~t |     1.9324   1.186515     1.07   0.283     .5800289    6.437901
             |
tot_adults~h |
          2  |   .9962968   .1299778    -0.03   0.977     .7715075    1.286582
          3  |   1.100176   .1431728     0.73   0.463     .8524916    1.419824
             |
  1.asplenia |   .8065067   .4678366    -0.37   0.711     .2587289    2.514034
1.ra_sle_p~s |   1.145365   .0931111     1.67   0.095      .976667    1.343202
1.other_im~o |   2.122866   .4224829     3.78   0.000     1.437211     3.13563
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -161373.59
Iteration 1:   log pseudolikelihood = -161128.49
Iteration 2:   log pseudolikelihood = -161126.82
Iteration 3:   log pseudolikelihood = -161126.82
Refining estimates:
Iteration 0:   log pseudolikelihood = -161126.82

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    4,829,125             Number of obs    =   4,829,125
No. of failures      =       13,170
Time at risk         =    797491913
                                                Wald chi2(6)     =      521.31
Log pseudolikelihood =   -161126.82             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,594,883 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.059831   .0250103     2.46   0.014     1.011928    1.110002
Kids unde..  |   1.086516   .0360215     2.50   0.012      1.01816    1.159461
             |
        age1 |   1.028372   .0047125     6.11   0.000     1.019177    1.037649
        age2 |   .9765287   .0124804    -1.86   0.063     .9523714    1.001299
        age3 |   1.023628    .035347     0.68   0.499     .9566418    1.095305
      1.male |   .7647148   .0126049   -16.27   0.000     .7404044    .7898234
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -161373.59
Iteration 1:   log pseudolikelihood = -160482.21
Iteration 2:   log pseudolikelihood = -160448.48
Iteration 3:   log pseudolikelihood = -160448.27
Iteration 4:   log pseudolikelihood = -160448.27
Refining estimates:
Iteration 0:   log pseudolikelihood = -160448.27

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    4,829,125             Number of obs    =   4,829,125
No. of failures      =       13,170
Time at risk         =    797491913
                                                Wald chi2(15)    =     1816.21
Log pseudolikelihood =   -160448.27             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,594,883 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.053306   .0249222     2.19   0.028     1.005574    1.103303
Kids unde..  |   1.095105    .036233     2.75   0.006     1.026344    1.168474
             |
        age1 |   1.029629   .0047337     6.35   0.000     1.020392    1.038949
        age2 |     .97454    .012453    -2.02   0.044     .9504358    .9992556
        age3 |   1.024282   .0353466     0.70   0.487     .9572951    1.095957
      1.male |   .8091012   .0135203   -12.68   0.000      .783031    .8360393
             |
   obese4cat |
Obese I ..)  |   1.394044   .0326323    14.19   0.000     1.331531    1.459492
Obese II..)  |   1.608875     .05141    14.88   0.000     1.511204    1.712859
Obese II..)  |    1.93792   .0744078    17.23   0.000     1.797435    2.089384
             |
smoke_nomiss |
     Former  |   .9574307   .0188002    -2.22   0.027     .9212831    .9949967
    Current  |   .6111275   .0174507   -17.25   0.000     .5778642    .6463054
             |
         imd |
          2  |   1.135538   .0352318     4.10   0.000     1.068543    1.206734
          3  |   1.270181   .0398841     7.62   0.000     1.194366    1.350808
          4  |   1.472674   .0456993    12.47   0.000     1.385774    1.565023
5 most de..  |   1.772387   .0559439    18.13   0.000     1.666062    1.885498
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 2.tot_adults_hh omitted because of collinearity
Iteration 0:   log pseudolikelihood = -157493.07
Iteration 1:   log pseudolikelihood =  -156546.4
Iteration 2:   log pseudolikelihood = -156118.45
Iteration 3:   log pseudolikelihood = -156068.16
Iteration 4:   log pseudolikelihood = -156062.61
Iteration 5:   log pseudolikelihood = -156062.48
Iteration 6:   log pseudolikelihood = -156062.48
Refining estimates:
Iteration 0:   log pseudolikelihood = -156062.48

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    4,759,172             Number of obs    =   4,759,172
No. of failures      =       12,867
Time at risk         =    785940189
                                                Wald chi2(40)    =     3541.24
Log pseudolikelihood =   -156062.48             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 2,584,629 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |    1.07069   .0255788     2.86   0.004     1.021712    1.122016
Kids unde..  |   1.106122   .0369664     3.02   0.003     1.035991    1.181001
             |
        age1 |   1.029017   .0047534     6.19   0.000     1.019742    1.038375
        age2 |   .9664543   .0124506    -2.65   0.008     .9423571    .9911678
        age3 |   1.030886   .0358923     0.87   0.382     .9628849     1.10369
      1.male |   .7772002   .0133087   -14.72   0.000     .7515486    .8037274
             |
   obese4cat |
Obese I ..)  |   1.282323   .0312135    10.22   0.000     1.222582    1.344983
Obese II..)  |   1.391662   .0468255     9.82   0.000     1.302846    1.486532
Obese II..)  |   1.590181   .0645821    11.42   0.000     1.468509    1.721934
             |
smoke_nomiss |
     Former  |   .9260514     .01855    -3.84   0.000     .8903985     .963132
    Current  |   .5879416   .0171489   -18.21   0.000     .5552731    .6225322
             |
         imd |
          2  |   1.120728   .0350603     3.64   0.000     1.054075    1.191595
          3  |   1.240868   .0393043     6.81   0.000     1.166176    1.320344
          4  |   1.410875   .0442099    10.98   0.000     1.326832    1.500241
5 most de..  |    1.65809   .0530765    15.80   0.000     1.557258     1.76545
             |
1.htdiag_o~p |   1.158684   .0252986     6.75   0.000     1.110145    1.209344
1.~y_disease |   1.591574   .0798075     9.27   0.000     1.442595    1.755938
    1.asthma |   1.180659   .0262811     7.46   0.000     1.130256    1.233309
1.~c_disease |   1.290442   .0567124     5.80   0.000      1.18394    1.406524
             |
     diabcat |
T1DM, con..  |   1.156743   .2242603     0.75   0.453     .7910656    1.691458
T1DM, unc..  |    1.42426   .1570162     3.21   0.001     1.147491    1.767784
T2DM, con..  |   1.573305   .0702392    10.15   0.000      1.44149    1.717174
T2DM, unc..  |    2.02373     .09091    15.69   0.000     1.853169     2.20999
Diabetes,..  |   .6450094   .3222952    -0.88   0.380     .2422377    1.717475
             |
cancer_exh~t |
  Last year  |   1.461917    .197981     2.80   0.005      1.12111    1.906326
2-5 years..  |   1.113529   .1015555     1.18   0.238     .9312592    1.331473
   5+ years  |   1.065815   .0746424     0.91   0.363     .9291146    1.222627
             |
cancer_hae~t |
  Last year  |   3.838812   .9713835     5.32   0.000     2.337795    6.303579
2-5 years..  |   2.270683   .4306542     4.32   0.000     1.565737    3.293017
   5+ years  |   1.557272   .2157686     3.20   0.001     1.186932    2.043164
             |
1.~r_disease |   1.722812    .151186     6.20   0.000     1.450576     2.04614
1.stroke_d~a |   1.387806   .1056878     4.30   0.000     1.195379    1.611208
1.other_ne~o |   1.182756   .1104362     1.80   0.072      .984956    1.420278
             |
reduced_ki~t |
Stage 3a/..  |   1.238214   .0850575     3.11   0.002      1.08224    1.416667
Stage 4/5..  |   2.652842   .3307788     7.82   0.000     2.077669    3.387243
             |
      1.esrd |   2.495388   .3201786     7.13   0.000     1.940537    3.208885
1.other_tr~t |   1.595908   .4172272     1.79   0.074     .9560346     2.66405
2.tot_adul~h |          1  (omitted)
  1.asplenia |   2.385258   .3625603     5.72   0.000      1.77073    3.213056
1.ra_sle_p~s |   1.111755   .0425149     2.77   0.006     1.031474    1.198285
1.other_im~o |   1.808395   .1993577     5.37   0.000      1.45699    2.244553
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 2.tot_adults_hh omitted because of collinearity
Iteration 0:   log likelihood = -157493.07
Iteration 1:   log likelihood =  -156546.4
Iteration 2:   log likelihood = -156118.45
Iteration 3:   log likelihood = -156068.16
Iteration 4:   log likelihood = -156062.61
Iteration 5:   log likelihood = -156062.48
Iteration 6:   log likelihood = -156062.48
Refining estimates:
Iteration 0:   log likelihood = -156062.48

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    4,759,172                  Number of obs    =   4,759,172
No. of failures =       12,867
Time at risk    =    785940189
                                                LR chi2(40)      =     2861.16
Log likelihood  =   -156062.48                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |    1.07069   .0243061     3.01   0.003     1.024095    1.119405
Kids unde..  |   1.106122   .0345218     3.23   0.001     1.040489    1.175896
             |
        age1 |   1.029017   .0048375     6.08   0.000     1.019579    1.038542
        age2 |   .9664543   .0124231    -2.65   0.008     .9424097    .9911125
        age3 |   1.030886   .0355506     0.88   0.378     .9635107    1.102973
      1.male |   .7772002   .0141509   -13.84   0.000     .7499541    .8054363
             |
   obese4cat |
Obese I ..)  |   1.282323   .0308597    10.33   0.000     1.223243    1.344256
Obese II..)  |   1.391662   .0459303    10.01   0.000      1.30449    1.484659
Obese II..)  |   1.590181   .0636091    11.60   0.000     1.470271     1.71987
             |
smoke_nomiss |
     Former  |   .9260514    .018342    -3.88   0.000     .8907906     .962708
    Current  |   .5879416   .0166992   -18.70   0.000     .5561061    .6215997
             |
         imd |
          2  |   1.120728    .032897     3.88   0.000     1.058071    1.187096
          3  |   1.240868    .036754     7.29   0.000     1.170883    1.315037
          4  |   1.410875    .041134    11.81   0.000     1.332514    1.493844
5 most de..  |    1.65809   .0490663    17.09   0.000     1.564657    1.757101
             |
1.htdiag_o~p |   1.158684   .0249759     6.83   0.000     1.110751    1.208684
1.~y_disease |   1.591574   .0792312     9.34   0.000     1.443619    1.754692
    1.asthma |   1.180659   .0260368     7.53   0.000     1.130715    1.232809
1.~c_disease |   1.290442   .0565395     5.82   0.000     1.184251    1.406155
             |
     diabcat |
T1DM, con..  |   1.156743   .2238338     0.75   0.452     .7916374    1.690236
T1DM, unc..  |    1.42426   .1579179     3.19   0.001     1.146068    1.769979
T2DM, con..  |   1.573305    .068999    10.33   0.000     1.443719    1.714523
T2DM, unc..  |    2.02373   .0894607    15.95   0.000     1.855771     2.20689
Diabetes,..  |   .6450094   .3227187    -0.88   0.381     .2419262    1.719687
             |
cancer_exh~t |
  Last year  |   1.461917   .1980366     2.80   0.005     1.121027    1.906469
2-5 years..  |   1.113529   .1013804     1.18   0.238     .9315463    1.331063
   5+ years  |   1.065815   .0747121     0.91   0.363     .9289956    1.222784
             |
cancer_hae~t |
  Last year  |   3.838812   .9619522     5.37   0.000     2.349079    6.273298
2-5 years..  |   2.270683   .4303211     4.33   0.000     1.566187    3.292071
   5+ years  |   1.557272   .2151958     3.21   0.001     1.187788    2.041691
             |
1.~r_disease |   1.722812   .1503167     6.23   0.000     1.452011    2.044117
1.stroke_d~a |   1.387806   .1054118     4.31   0.000     1.195846     1.61058
1.other_ne~o |   1.182756    .110501     1.80   0.072     .9848501    1.420431
             |
reduced_ki~t |
Stage 3a/..  |   1.238214   .0849393     3.11   0.002     1.082442    1.416402
Stage 4/5..  |   2.652842   .3666039     7.06   0.000     2.023398    3.478094
             |
      1.esrd |   2.495388   .3423433     6.67   0.000     1.907047    3.265237
1.other_tr~t |   1.595908   .4056543     1.84   0.066     .9697197    2.626453
2.tot_adul~h |          1  (omitted)
  1.asplenia |   2.385258   .3615832     5.73   0.000     1.772152    3.210478
1.ra_sle_p~s |   1.111755   .0425024     2.77   0.006     1.031496    1.198259
1.other_im~o |   1.808395   .1990189     5.38   0.000     1.457525    2.243729
------------------------------------------------------------------------------
                                                             Stratified by stp

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood =  -442866.2
Iteration 1:   log pseudolikelihood = -441670.08
Iteration 2:   log pseudolikelihood = -441664.59
Iteration 3:   log pseudolikelihood = -441664.59
Refining estimates:
Iteration 0:   log pseudolikelihood = -441664.59

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,079,029             Number of obs    =  12,079,029
No. of failures      =       33,607
Time at risk         =   1990575397
                                                Wald chi2(6)     =     2530.91
Log pseudolikelihood =   -441664.59             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 6,854,273 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.173152   .0178288    10.51   0.000     1.138724    1.208622
Kids unde..  |   1.170424    .024179     7.62   0.000     1.123981    1.218787
             |
        age1 |   1.016962   .0024798     6.90   0.000     1.012113    1.021834
        age2 |   1.016127   .0074806     2.17   0.030      1.00157    1.030895
        age3 |   .9304601   .0190157    -3.53   0.000     .8939265    .9684867
      1.male |   .7313562   .0077435   -29.55   0.000     .7163357    .7466917
------------------------------------------------------------------------------
                                                             Stratified by stp

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.05280       115.94        1         0.0000
      2.kids_cat3 |      0.03183        43.64        1         0.0000
      age1        |     -0.03415        37.97        1         0.0000
      age2        |     -0.00632         1.38        1         0.2405
      age3        |      0.01102         4.27        1         0.0389
      0b.male     |            .            .        1             .
      1.male      |     -0.00002         0.00        1         0.9965
      ------------+---------------------------------------------------
      global test |                   1359.43        6         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood =  -442866.2
Iteration 1:   log pseudolikelihood = -439894.16
Iteration 2:   log pseudolikelihood = -439791.74
Iteration 3:   log pseudolikelihood = -439791.09
Iteration 4:   log pseudolikelihood = -439791.09
Refining estimates:
Iteration 0:   log pseudolikelihood = -439791.09

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   12,079,029             Number of obs    =  12,079,029
No. of failures      =       33,607
Time at risk         =   1990575397
                                                Wald chi2(15)    =     6220.93
Log pseudolikelihood =   -439791.09             Prob > chi2      =      0.0000

                   (Std. Err. adjusted for 6,854,273 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat3 |
Kids unde..  |   1.138374   .0172857     8.54   0.000     1.104994    1.172762
Kids unde..  |   1.160181   .0239196     7.21   0.000     1.114234    1.208023
             |
        age1 |   1.018179   .0024943     7.35   0.000     1.013302     1.02308
        age2 |   1.009974   .0074335     1.35   0.178     .9955088    1.024649
        age3 |   .9426639   .0192456    -2.89   0.004     .9056879    .9811494
      1.male |   .7751832   .0083202   -23.73   0.000     .7590461    .7916633
             |
   obese4cat |
Obese I ..)  |   1.398287    .020881    22.45   0.000     1.357954    1.439817
Obese II..)  |   1.599993   .0322459    23.32   0.000     1.538024    1.664458
Obese II..)  |   1.907763   .0461319    26.71   0.000     1.819455    2.000357
             |
smoke_nomiss |
     Former  |   .9875917   .0124837    -0.99   0.323     .9634248    1.012365
    Current  |   .5895469   .0102078   -30.52   0.000     .5698757    .6098972
             |
         imd |
          2  |   1.160156   .0241989     7.12   0.000     1.113683    1.208568
          3  |   1.307749   .0273619    12.82   0.000     1.255205    1.362492
          4  |   1.545985   .0312266    21.57   0.000     1.485977    1.608415
5 most de..  |   1.807903   .0370182    28.92   0.000     1.736785    1.881933
------------------------------------------------------------------------------
                                                             Stratified by stp

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.05476       124.74        1         0.0000
      2.kids_cat3 |      0.03395        49.44        1         0.0000
      age1        |     -0.02864        26.69        1         0.0000
      age2        |     -0.00370         0.47        1         0.4932
      age3        |      0.00735         1.89        1         0.1692
      0b.male     |            .            .        1             .
      1.male      |     -0.00446         0.65        1         0.4191
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.03886        52.16        1         0.0000
      3.obese4cat |     -0.04710        77.12        1         0.0000
      4.obese4cat |     -0.04506        70.37        1         0.0000
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.05170        93.64        1         0.0000
      3.smoke_no~s|     -0.01550         8.84        1         0.0029
      1b.imd      |            .            .        1             .
      2.imd       |      0.01866        13.48        1         0.0002
      3.imd       |      0.04649        86.30        1         0.0000
      4.imd       |      0.07547       229.22        1         0.0000
      5.imd       |      0.09294       354.11        1         0.0000
      ------------+---------------------------------------------------
      global test |                   2002.67       15         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -431245.79
Iteration 1:   log pseudolikelihood = -428151.59
Iteration 2:   log pseudolikelihood = -426765.15
Iteration 3:   log pseudolikelihood = -426605.75
Iteration 4:   log pseudolikelihood = -426587.32
Iteration 5:   log pseudolikelihood = -426586.85
Iteration 6:   log pseudolikelihood = -426586.85
Refining estimates:
Iteration 0:   log pseudolikelihood = -426586.85

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,895,119             Number of obs    =  11,895,119
No. of failures      =       32,767
Time at risk         =   1960253127
                                                Wald chi2(42)    =    12038.06
Log pseudolikelihood =   -426586.85             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,799,224 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.135295    .017514     8.23   0.000     1.101482    1.170147
               Kids under 18  |   1.132652   .0236908     5.96   0.000     1.087158     1.18005
                              |
                         age1 |   1.026419   .0025364    10.55   0.000      1.02146    1.031402
                         age2 |   .9789576   .0072785    -2.86   0.004     .9647954    .9933276
                         age3 |   1.000928   .0206646     0.04   0.964     .9612346     1.04226
                       1.male |   .7364373   .0080679   -27.93   0.000     .7207931     .752421
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.283083   .0199551    16.03   0.000     1.244562    1.322797
          Obese II (35-39.9)  |   1.379171   .0293174    15.12   0.000      1.32289    1.437845
             Obese III (40+)  |   1.568756   .0401546    17.59   0.000     1.491996    1.649466
                              |
                 smoke_nomiss |
                      Former  |   .9599574   .0124376    -3.15   0.002      .935887    .9846469
                     Current  |   .5676264   .0100427   -32.01   0.000     .5482804     .587655
                              |
                          imd |
                           2  |   1.143087   .0240519     6.36   0.000     1.096904    1.191213
                           3  |   1.269014   .0267988    11.28   0.000     1.217562    1.322641
                           4  |   1.467474    .029902    18.82   0.000     1.410022    1.527267
             5 most deprived  |   1.665296   .0345533    24.58   0.000     1.598931    1.734415
                              |
           1.htdiag_or_highbp |   1.155262   .0160279    10.40   0.000     1.124272    1.187108
1.chronic_respiratory_disease |   1.745963   .0517835    18.79   0.000     1.647362    1.850464
                     1.asthma |   1.149926   .0164212     9.78   0.000     1.118187    1.182566
    1.chronic_cardiac_disease |   1.322233   .0351851    10.50   0.000     1.255039    1.393025
                              |
                      diabcat |
            T1DM, controlled  |   1.151549   .1475997     1.10   0.271     .8957357    1.480421
          T1DM, uncontrolled  |   1.583466   .1046855     6.95   0.000     1.391023    1.802532
            T2DM, controlled  |   1.576118   .0422032    16.99   0.000     1.495534    1.661043
          T2DM, uncontrolled  |   1.912602   .0522155    23.75   0.000     1.812952     2.01773
          Diabetes, no HbA1c  |   1.182279   .2521309     0.79   0.432     .7783843     1.79575
                              |
            cancer_exhaem_cat |
                   Last year  |   1.825664   .1418348     7.75   0.000     1.567803    2.125936
               2-5 years ago  |   1.198695   .0674794     3.22   0.001     1.073472    1.338524
                    5+ years  |   1.028823    .047256     0.62   0.536     .9402494     1.12574
                              |
              cancer_haem_cat |
                   Last year  |   3.272524   .5673183     6.84   0.000     2.329809    4.596693
               2-5 years ago  |       2.58   .2901392     8.43   0.000     2.069646    3.216202
                    5+ years  |   1.625055   .1414284     5.58   0.000     1.370213    1.927295
                              |
      1.chronic_liver_disease |   1.664481   .0881903     9.62   0.000     1.500303    1.846624
            1.stroke_dementia |   1.422334   .0647999     7.73   0.000     1.300833    1.555182
                1.other_neuro |   1.322843   .0714592     5.18   0.000     1.189945    1.470584
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.232638   .0523713     4.92   0.000     1.134149    1.339679
           Stage 4/5 egfr<30  |   2.215092    .186196     9.46   0.000     1.878631    2.611812
                              |
                       1.esrd |   2.849416    .233496    12.78   0.000     2.426633     3.34586
           1.other_transplant |    1.46847   .2356321     2.39   0.017     1.072211    2.011174
                              |
                tot_adults_hh |
                           2  |    1.06601    .016874     4.04   0.000     1.033446    1.099601
                           3  |   1.273774   .0204173    15.10   0.000     1.234379    1.314426
                              |
                   1.asplenia |   2.327085   .2266765     8.67   0.000     1.922643    2.816606
           1.ra_sle_psoriasis |   1.145366   .0277106     5.61   0.000     1.092322    1.200987
               1.other_immuno |   1.999987   .1260406    11.00   0.000     1.767599    2.262927
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat3|            .            .        1             .
      1.kids_cat3 |      0.05494       119.77        1         0.0000
      2.kids_cat3 |      0.02777        31.89        1         0.0000
      age1        |     -0.02216        15.18        1         0.0001
      age2        |     -0.00994         3.24        1         0.0719
      age3        |      0.01435         6.88        1         0.0087
      0b.male     |            .            .        1             .
      1.male      |     -0.00545         0.94        1         0.3320
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02476        21.34        1         0.0000
      3.obese4cat |     -0.02722        26.20        1         0.0000
      4.obese4cat |     -0.02589        23.64        1         0.0000
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.03539        43.06        1         0.0000
      3.smoke_no~s|     -0.00565         1.15        1         0.2833
      1b.imd      |            .            .        1             .
      2.imd       |      0.02187        18.09        1         0.0000
      3.imd       |      0.05125       102.21        1         0.0000
      4.imd       |      0.08141       258.40        1         0.0000
      5.imd       |      0.10061       403.10        1         0.0000
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.01055         3.89        1         0.0486
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01988        13.63        1         0.0002
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.06929       165.32        1         0.0000
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.01517         7.78        1         0.0053
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00020         0.00        1         0.9705
      3.diabcat   |     -0.01524         7.60        1         0.0058
      4.diabcat   |      0.01118         4.48        1         0.0343
      5.diabcat   |     -0.01023         3.73        1         0.0534
      6.diabcat   |     -0.00345         0.39        1         0.5310
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.01050         3.65        1         0.0560
      3.cancer_e~t|     -0.00613         1.26        1         0.2621
      4.cancer_e~t|     -0.01539         7.81        1         0.0052
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.01450         7.10        1         0.0077
      3.cancer_h~t|     -0.01858        11.51        1         0.0007
      4.cancer_h~t|     -0.00274         0.25        1         0.6136
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.00773         2.02        1         0.1555
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00553         1.05        1         0.3060
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.02144        15.56        1         0.0001
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01936        12.80        1         0.0003
      3.reduced_~t|     -0.01939        11.69        1         0.0006
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.01380         6.81        1         0.0091
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00297         0.33        1         0.5631
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01242         5.38        1         0.0203
      3.tot_adul~h|      0.06600       157.25        1         0.0000
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00478         0.77        1         0.3788
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.01412         6.65        1         0.0099
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.02181        16.11        1         0.0001
      ------------+---------------------------------------------------
      global test |                   2585.38       42         0.0000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
(23,996,095 observations (episodes) created)

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
diabetes_date:  factor variables may not contain negative values
r(452);

end of do-file

r(452);

