------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_sex_covid_death_icu.log
  log type:  text
 opened on:   2 Sep 2020, 14:14:46

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6. stcox   `exposure'                                                              ///
>                         $demogadjlist                                                   ///
>                         $comordidadjlist                                                ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3.         
. foreach int_type in  male  {
  4. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  5. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  6. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
  7. if _rc==0{
  8. testparm 1.`int_type'#i.`exposure_type'
  9. di _n "`exposure_type' <66" _n "****************"
 10. lincom 2.`exposure_type', eform
 11. di "`exposure_type' 66+" _n "****************"
 12. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 13. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 14. }
 15. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. }
 18. }

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -33915.463
Iteration 1:   log pseudolikelihood = -32703.171
Iteration 2:   log pseudolikelihood =  -31565.19
Iteration 3:   log pseudolikelihood = -31209.466
Iteration 4:   log pseudolikelihood = -31197.055
Iteration 5:   log pseudolikelihood = -31196.978
Iteration 6:   log pseudolikelihood = -31196.978
Refining estimates:
Iteration 0:   log pseudolikelihood = -31196.978

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  11,870,825
No. of failures      =        2,587
Time at risk         =   2182954615
                                                Wald chi2(37)    =     8788.66
Log pseudolikelihood =   -31196.978             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9861469   .0611351    -0.23   0.822     .8733177    1.113553
               Kids under 18  |   1.077788   .0780625     1.03   0.301      .935152     1.24218
                              |
                         age1 |   1.140292   .0245223     6.10   0.000     1.093228    1.189382
                         age2 |   .9210695   .0456379    -1.66   0.097      .835827    1.015006
                         age3 |   1.096849    .132297     0.77   0.443     .8659216     1.38936
                       1.male |   1.674619   .0699093    12.35   0.000     1.543055    1.817401
                              |
                          imd |
                           2  |    1.12891   .0829692     1.65   0.099     .9774633    1.303822
                           3  |   1.261261   .0906552     3.23   0.001     1.095528    1.452066
                           4  |   1.601459    .109711     6.87   0.000      1.40024    1.831593
             5 most deprived  |   1.709512   .1212794     7.56   0.000     1.487595    1.964535
                              |
                tot_adults_hh |
                           2  |   .8894845   .0472581    -2.20   0.028     .8015197    .9871032
                           3  |   1.158971   .0600256     2.85   0.004     1.047097    1.282797
                              |
           1.htdiag_or_highbp |      1.613     .07409    10.41   0.000     1.474131    1.764951
1.chronic_respiratory_disease |   2.354875   .1581954    12.75   0.000     2.064362     2.68627
                     1.asthma |    1.23254   .0625376     4.12   0.000     1.115866    1.361413
    1.chronic_cardiac_disease |   1.417989   .0894136     5.54   0.000     1.253138    1.604526
                              |
                      diabcat |
            T1DM, controlled  |   1.897609    .579812     2.10   0.036     1.042613    3.453745
          T1DM, uncontrolled  |   2.753484   .4444486     6.27   0.000     2.006723    3.778137
            T2DM, controlled  |   2.410611   .1553696    13.65   0.000     2.124542      2.7352
          T2DM, uncontrolled  |   3.789158    .230748    21.88   0.000     3.362848    4.269512
          Diabetes, no HbA1c  |   3.648048   1.300354     3.63   0.000     1.814046     7.33623
                              |
            cancer_exhaem_cat |
                   Last year  |   3.647276   .5488294     8.60   0.000     2.715706    4.898402
               2-5 years ago  |   1.908273   .2364225     5.22   0.000     1.496863    2.432757
                    5+ years  |   1.141378   .1451251     1.04   0.298     .8896104    1.464397
                              |
              cancer_haem_cat |
                   Last year  |   5.276419   1.789122     4.91   0.000     2.714656    10.25566
               2-5 years ago  |   5.345798   1.060974     8.45   0.000     3.623061    7.887684
                    5+ years  |   2.018697   .4323359     3.28   0.001       1.3267    3.071634
                              |
      1.chronic_liver_disease |   2.309824   .2560741     7.55   0.000     1.858712    2.870421
            1.stroke_dementia |   1.761065   .1618987     6.16   0.000     1.470695    2.108765
                1.other_neuro |   3.138752   .3403412    10.55   0.000     2.537813    3.881991
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |      2.327   .1837944    10.69   0.000     1.993267    2.716609
           Stage 4/5 egfr<30  |   3.859223   .6428836     8.11   0.000     2.784221    5.349291
                              |
                       1.esrd |   3.392424   .5644104     7.34   0.000     2.448457    4.700323
           1.other_transplant |   .6269637   .2688935    -1.09   0.276     .2705063     1.45314
                   1.asplenia |    2.16739   .5554643     3.02   0.003     1.311562    3.581667
           1.ra_sle_psoriasis |   1.193711   .0893593     2.37   0.018     1.030812    1.382352
               1.other_immuno |   2.352035   .4035351     4.99   0.000     1.680368    3.292177
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   4790.24 /        1 =    4790.2430

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -33915.463
Iteration 1:   log pseudolikelihood = -32702.906
Iteration 2:   log pseudolikelihood = -31560.908
Iteration 3:   log pseudolikelihood = -31202.238
Iteration 4:   log pseudolikelihood = -31189.875
Iteration 5:   log pseudolikelihood =   -31189.8
Iteration 6:   log pseudolikelihood =   -31189.8
Refining estimates:
Iteration 0:   log pseudolikelihood =   -31189.8

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  11,870,825
No. of failures      =        2,587
Time at risk         =   2182954615
                                                Wald chi2(39)    =     8696.33
Log pseudolikelihood =     -31189.8             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .7492626   .0799905    -2.70   0.007     .6077999      .92365
               Kids under 18  |    .875451    .108716    -1.07   0.284     .6863209      1.1167
                              |
                         age1 |   1.143565   .0246802     6.22   0.000     1.096201    1.192974
                         age2 |   .9122712    .045365    -1.85   0.065      .827553    1.005662
                         age3 |   1.124656   .1361179     0.97   0.332     .8871523    1.425743
                       1.male |   1.533292     .07301     8.98   0.000     1.396669    1.683279
                              |
                          imd |
                           2  |   1.128987   .0829765     1.65   0.099     .9775269    1.303915
                           3  |   1.261153   .0906537     3.23   0.001     1.095423    1.451956
                           4  |   1.601802   .1097314     6.88   0.000     1.400546    1.831979
             5 most deprived  |   1.709441   .1212884     7.56   0.000     1.487509    1.964485
                              |
                tot_adults_hh |
                           2  |   .8764972   .0467798    -2.47   0.014     .7894431     .973151
                           3  |   1.145492   .0596292     2.61   0.009     1.034385    1.268533
                              |
           1.htdiag_or_highbp |   1.610674   .0738043    10.40   0.000     1.472326    1.762023
1.chronic_respiratory_disease |   2.351059   .1579848    12.72   0.000     2.060939     2.68202
                     1.asthma |   1.230869   .0624744     4.09   0.000     1.114315    1.359615
    1.chronic_cardiac_disease |   1.423598    .089827     5.60   0.000     1.257992    1.611005
                              |
                      diabcat |
            T1DM, controlled  |   1.901042   .5808542     2.10   0.036     1.044506    3.459969
          T1DM, uncontrolled  |   2.755917   .4448046     6.28   0.000     2.008549    3.781377
            T2DM, controlled  |   2.413531   .1555587    13.67   0.000     2.127114    2.738516
          T2DM, uncontrolled  |    3.79611   .2311621    21.91   0.000     3.369033    4.277325
          Diabetes, no HbA1c  |   3.647643   1.300106     3.63   0.000     1.813945    7.335008
                              |
            cancer_exhaem_cat |
                   Last year  |   3.651585   .5496274     8.60   0.000     2.718697    4.904584
               2-5 years ago  |    1.90738   .2363467     5.21   0.000     1.496109    2.431706
                    5+ years  |   1.133083   .1441123     0.98   0.326     .8830814     1.45386
                              |
              cancer_haem_cat |
                   Last year  |   5.286475   1.792672     4.91   0.000     2.719689    10.27574
               2-5 years ago  |   5.355772   1.063049     8.45   0.000     3.629694    7.902675
                    5+ years  |   2.024339   .4336249     3.29   0.001     1.330304    3.080459
                              |
      1.chronic_liver_disease |   2.313779   .2565254     7.57   0.000     1.861874    2.875368
            1.stroke_dementia |   1.764069   .1622555     6.17   0.000     1.473071    2.112551
                1.other_neuro |   3.130562   .3395922    10.52   0.000      2.53097    3.872198
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   2.318017   .1829987    10.65   0.000     1.985718    2.705925
           Stage 4/5 egfr<30  |   3.841131   .6396668     8.08   0.000     2.771455    5.323662
                              |
                       1.esrd |   3.399987   .5654773     7.36   0.000     2.454187    4.710282
           1.other_transplant |   .6282554    .269454    -1.08   0.278     .2710581    1.456164
                   1.asplenia |    2.16844    .555932     3.02   0.003     1.311962    3.584045
           1.ra_sle_psoriasis |   1.192369     .08928     2.35   0.019     1.029617    1.380846
               1.other_immuno |   2.368681   .4065924     5.02   0.000     1.691978    3.316028
                              |
               male#kids_cat3 |
             1#Kids under 12  |   1.500348    .183446     3.32   0.001     1.180637    1.906635
             1#Kids under 18  |   1.375147   .2036636     2.15   0.031     1.028688    1.838293
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   4770.21 /        1 =    4770.2140

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =   14.04
         Prob > chi2 =    0.0009

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .875451    .108716    -1.07   0.284     .6863209      1.1167
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.203874   .1040186     2.15   0.032     1.016329    1.426026
------------------------------------------------------------------------------
file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_male_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster saved

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -99539.034
Iteration 1:   log pseudolikelihood = -94954.571
Iteration 2:   log pseudolikelihood =  -93985.59
Iteration 3:   log pseudolikelihood = -93950.835
Iteration 4:   log pseudolikelihood = -93949.535
Iteration 5:   log pseudolikelihood = -93949.531
Refining estimates:
Iteration 0:   log pseudolikelihood = -93949.531

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   3,329,528
No. of failures      =        8,460
Time at risk         =    606783707
                                                Wald chi2(37)    =    16248.27
Log pseudolikelihood =   -93949.531             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   .9151181   .0771293    -1.05   0.293     .7757734    1.079492
               Kids under 18  |   .8971764   .1037626    -0.94   0.348     .7152081    1.125442
                              |
                         age1 |   1.027647   .0143247     1.96   0.050     .9999515     1.05611
                         age2 |   1.255624   .0683125     4.18   0.000     1.128626    1.396913
                         age3 |   .5807068   .0798439    -3.95   0.000     .4435285    .7603128
                       1.male |   1.766615   .0411059    24.46   0.000     1.687858    1.849046
                              |
                          imd |
                           2  |    1.11132   .0394285     2.97   0.003     1.036667    1.191349
                           3  |   1.226652   .0434676     5.76   0.000     1.144348    1.314875
                           4  |    1.41484   .0506438     9.69   0.000     1.318982    1.517665
             5 most deprived  |    1.64336   .0620052    13.17   0.000     1.526216    1.769494
                              |
                tot_adults_hh |
                           2  |   .7979049   .0203297    -8.86   0.000     .7590379    .8387621
                           3  |   .9908582    .037409    -0.24   0.808     .9201849    1.066959
                              |
           1.htdiag_or_highbp |   .9404261   .0254774    -2.27   0.023     .8917939    .9917103
1.chronic_respiratory_disease |    1.83096    .048532    22.82   0.000     1.738268    1.928595
                     1.asthma |    1.11198   .0344835     3.42   0.001     1.046406    1.181663
    1.chronic_cardiac_disease |   1.370588   .0327828    13.18   0.000     1.307818    1.436371
                              |
                      diabcat |
            T1DM, controlled  |   1.752454   .3791846     2.59   0.010     1.146751    2.678083
          T1DM, uncontrolled  |   2.929448   .3651521     8.62   0.000     2.294481    3.740133
            T2DM, controlled  |   1.479239   .0412423    14.04   0.000     1.400575    1.562322
          T2DM, uncontrolled  |   2.077118    .071641    21.19   0.000     1.941345    2.222386
          Diabetes, no HbA1c  |    2.36094   .5599689     3.62   0.000     1.483189    3.758143
                              |
            cancer_exhaem_cat |
                   Last year  |   2.138146   .1465071    11.09   0.000     1.869444    2.445469
               2-5 years ago  |   1.193226    .062967     3.35   0.001     1.075981    1.323248
                    5+ years  |   1.058688   .0359967     1.68   0.093     .9904351    1.131644
                              |
              cancer_haem_cat |
                   Last year  |    3.41196   .5091278     8.22   0.000     2.546765    4.571082
               2-5 years ago  |   2.467354   .2439607     9.13   0.000     2.032678    2.994984
                    5+ years  |   1.565263   .1334366     5.26   0.000     1.324413    1.849912
                              |
      1.chronic_liver_disease |   1.998673    .159107     8.70   0.000      1.70994    2.336161
            1.stroke_dementia |   1.730123   .0497328    19.07   0.000     1.635344    1.830396
                1.other_neuro |   2.450434   .1173386    18.72   0.000     2.230917    2.691552
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.313132   .0338079    10.58   0.000     1.248514    1.381095
           Stage 4/5 egfr<30  |    2.43685   .1106434    19.62   0.000     2.229362    2.663649
                              |
                       1.esrd |   3.207813   .2811336    13.30   0.000     2.701528    3.808979
           1.other_transplant |   1.799252   .5504731     1.92   0.055     .9878042    3.277278
                   1.asplenia |   1.036359   .2087033     0.18   0.859     .6983835    1.537893
           1.ra_sle_psoriasis |    1.27176   .0466856     6.55   0.000     1.183472    1.366634
               1.other_immuno |   1.778282   .3070071     3.33   0.001     1.267789    2.494332
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   1517.64 /        1 =    1517.6410

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -99539.034
Iteration 1:   log pseudolikelihood = -94952.766
Iteration 2:   log pseudolikelihood = -93984.101
Iteration 3:   log pseudolikelihood = -93949.382
Iteration 4:   log pseudolikelihood = -93948.086
Iteration 5:   log pseudolikelihood = -93948.082
Refining estimates:
Iteration 0:   log pseudolikelihood = -93948.082

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   3,329,528
No. of failures      =        8,460
Time at risk         =    606783707
                                                Wald chi2(39)    =    16251.59
Log pseudolikelihood =   -93948.082             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |    1.07493   .1335553     0.58   0.561     .8426016    1.371318
               Kids under 18  |   .8565802   .1561336    -0.85   0.396     .5992593    1.224394
                              |
                         age1 |   1.027641   .0143238     1.96   0.050     .9999465    1.056102
                         age2 |   1.255673    .068312     4.18   0.000     1.128675     1.39696
                         age3 |   .5806591   .0798345    -3.95   0.000     .4434963    .7602431
                       1.male |   1.774736   .0418832    24.31   0.000     1.694516    1.858753
                              |
                          imd |
                           2  |   1.111316   .0394288     2.97   0.003     1.036663    1.191345
                           3  |   1.226558   .0434649     5.76   0.000     1.144259    1.314776
                           4  |   1.414699   .0506394     9.69   0.000     1.318849    1.517515
             5 most deprived  |   1.643083   .0619947    13.16   0.000      1.52596    1.769196
                              |
                tot_adults_hh |
                           2  |   .7971481   .0203206    -8.89   0.000     .7582991    .8379874
                           3  |   .9903352   .0373856    -0.26   0.797      .919706    1.066388
                              |
           1.htdiag_or_highbp |   .9405104   .0254787    -2.26   0.024     .8918756    .9917973
1.chronic_respiratory_disease |   1.831095   .0485355    22.82   0.000     1.738396    1.928737
                     1.asthma |   1.112088   .0344873     3.43   0.001     1.046507    1.181778
    1.chronic_cardiac_disease |   1.370549   .0327832    13.18   0.000     1.307777    1.436332
                              |
                      diabcat |
            T1DM, controlled  |   1.751181   .3789698     2.59   0.010      1.14584     2.67632
          T1DM, uncontrolled  |   2.926485   .3648137     8.61   0.000     2.292113    3.736427
            T2DM, controlled  |   1.478787   .0412235    14.03   0.000     1.400158    1.561831
          T2DM, uncontrolled  |   2.077118   .0716267    21.20   0.000     1.941372    2.222357
          Diabetes, no HbA1c  |   2.357768   .5591971     3.62   0.000     1.481221    3.753034
                              |
            cancer_exhaem_cat |
                   Last year  |   2.138226   .1465195    11.09   0.000     1.869502    2.445576
               2-5 years ago  |   1.192985   .0629575     3.34   0.001     1.075757    1.322986
                    5+ years  |   1.058598   .0359943     1.67   0.094     .9903497    1.131549
                              |
              cancer_haem_cat |
                   Last year  |   3.409257   .5087719     8.22   0.000     2.544677    4.567585
               2-5 years ago  |   2.467551   .2439828     9.13   0.000     2.032836    2.995229
                    5+ years  |   1.565328   .1334357     5.26   0.000     1.324479    1.849974
                              |
      1.chronic_liver_disease |   1.999711   .1591731     8.71   0.000     1.710855    2.337336
            1.stroke_dementia |   1.730177   .0497349    19.07   0.000     1.635394    1.830454
                1.other_neuro |   2.450616   .1173425    18.72   0.000     2.231091    2.691741
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.313266   .0338121    10.58   0.000     1.248639    1.381237
           Stage 4/5 egfr<30  |   2.436879    .110639    19.62   0.000     2.229399    2.663668
                              |
                       1.esrd |    3.21148   .2814287    13.31   0.000      2.70466    3.813272
           1.other_transplant |   1.798518   .5501441     1.92   0.055     .9875133    3.275569
                   1.asplenia |   1.036425   .2087194     0.18   0.859      .698425       1.538
           1.ra_sle_psoriasis |   1.271958   .0466936     6.55   0.000     1.183656    1.366849
               1.other_immuno |   1.776544   .3067229     3.33   0.001     1.266528    2.491938
                              |
               male#kids_cat3 |
             1#Kids under 12  |   .7638986   .1230911    -1.67   0.095      .557028    1.047597
             1#Kids under 18  |   1.079316   .2455942     0.34   0.737     .6909724    1.685917
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   1569.81 /        1 =    1569.8100

 ( 1)  1.male#1.kids_cat3 = 0
 ( 2)  1.male#2.kids_cat3 = 0

           chi2(  2) =    2.92
         Prob > chi2 =    0.2320

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8565802   .1561336    -0.85   0.396     .5992593    1.224394
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.male#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9245203   .1335963    -0.54   0.587     .6964902    1.227207
------------------------------------------------------------------------------
file ./output/an_interaction_cox_models_covid_death_icu_kids_cat3_male_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_sex_covid_death_icu.log
  log type:  text
 closed on:   2 Sep 2020, 17:46:17
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
