------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_shield_covid_icu.log
  log type:  text
 opened on:   2 Sep 2020, 14:14:46

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6. stcox   `exposure'                                                              ///
>                         $demogadjlist                                                   ///
>                         $comordidadjlist                                                ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3.         
. 
. 
. foreach int_type in shield {
  4. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
  5. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
  6. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
  7. if _rc==0{
  8. testparm 1.`int_type'#i.`exposure_type'
  9. di _n "`exposure_type' <66" _n "****************"
 10. lincom 2.`exposure_type', eform
 11. di "`exposure_type' 66+" _n "****************"
 12. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 13. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 14. }
 15. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 16. 
. }
 17. 
. }
 18. }

         failure _d:  covid_icu
   analysis time _t:  (stime_covid_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood =   -22607.6
Iteration 1:   log pseudolikelihood = -21974.569
Iteration 2:   log pseudolikelihood = -21412.128
Iteration 3:   log pseudolikelihood = -21156.605
Iteration 4:   log pseudolikelihood = -21149.464
Iteration 5:   log pseudolikelihood = -21149.407
Iteration 6:   log pseudolikelihood = -21149.407
Refining estimates:
Iteration 0:   log pseudolikelihood = -21149.407

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  11,870,825
No. of failures      =        1,724
Time at risk         =   2182954615
                                                Wald chi2(37)    =     4088.84
Log pseudolikelihood =   -21149.407             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.164054   .0827357     2.14   0.033     1.012683    1.338052
               Kids under 18  |   1.208936   .1005208     2.28   0.022     1.027135    1.422916
                              |
                         age1 |   1.122182   .0258604     5.00   0.000     1.072624     1.17403
                         age2 |   .9572931   .0523859    -0.80   0.425     .8599331    1.065676
                         age3 |   .9842464   .1330893    -0.12   0.907     .7551005     1.28293
                       1.male |   1.887741   .0981744    12.22   0.000     1.704804    2.090307
                              |
                          imd |
                           2  |    1.09866   .0959129     1.08   0.281     .9258777    1.303687
                           3  |   1.249622   .1064418     2.62   0.009     1.057484     1.47667
                           4  |   1.469231   .1212527     4.66   0.000     1.249804    1.727182
             5 most deprived  |   1.658324   .1400409     5.99   0.000      1.40536     1.95682
                              |
                tot_adults_hh |
                           2  |   .9765716   .0659493    -0.35   0.726     .8555023    1.114774
                           3  |   1.330248   .0874741     4.34   0.000     1.169391    1.513233
                              |
           1.htdiag_or_highbp |   1.713828   .0956265     9.66   0.000     1.536288    1.911885
1.chronic_respiratory_disease |   1.964829   .1837908     7.22   0.000     1.635698    2.360187
                     1.asthma |   1.381705   .0838139     5.33   0.000     1.226822    1.556141
    1.chronic_cardiac_disease |   1.201641   .1024519     2.15   0.031      1.01672    1.420195
                              |
                      diabcat |
            T1DM, controlled  |    2.09461   .8023791     1.93   0.054      .988632     4.43784
          T1DM, uncontrolled  |   2.776299   .5769856     4.91   0.000     1.847417    4.172224
            T2DM, controlled  |   2.580781    .205812    11.89   0.000     2.207342    3.017399
          T2DM, uncontrolled  |   3.998076   .3033235    18.27   0.000     3.445661    4.639054
          Diabetes, no HbA1c  |   3.829229   1.719791     2.99   0.003     1.587881    9.234314
                              |
            cancer_exhaem_cat |
                   Last year  |   1.009509   .3587392     0.03   0.979     .5030684    2.025784
               2-5 years ago  |   .8894917   .2011899    -0.52   0.605     .5709691    1.385706
                    5+ years  |   .5900884   .1307246    -2.38   0.017     .3822496    .9109344
                              |
              cancer_haem_cat |
                   Last year  |   4.206136   2.124503     2.84   0.004     1.562949    11.31936
               2-5 years ago  |   4.529882   1.277391     5.36   0.000     2.606483    7.872614
                    5+ years  |   2.279784   .6045275     3.11   0.002     1.355756     3.83359
                              |
      1.chronic_liver_disease |   1.009691   .2109392     0.05   0.963     .6704401    1.520607
            1.stroke_dementia |   1.548228   .2034049     3.33   0.001     1.196753    2.002926
                1.other_neuro |   1.346267   .2769658     1.45   0.148     .8995276    2.014874
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.752745   .2054997     4.79   0.000       1.3929    2.205553
           Stage 4/5 egfr<30  |   1.668534   .4123001     2.07   0.038     1.028017    2.708131
                              |
                       1.esrd |   5.610105   1.183449     8.18   0.000     3.710312    8.482649
           1.other_transplant |   .4059364   .2987194    -1.23   0.221     .0959573    1.717268
                   1.asplenia |   2.697069   .8318444     3.22   0.001     1.473533    4.936557
           1.ra_sle_psoriasis |   1.220279   .1139425     2.13   0.033       1.0162    1.465344
               1.other_immuno |   2.310997   .5264295     3.68   0.000     1.478772     3.61158
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   4295.69 /        1 =    4295.6920

         failure _d:  covid_icu
   analysis time _t:  (stime_covid_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood =   -22607.6
Iteration 1:   log pseudolikelihood = -21974.541
Iteration 2:   log pseudolikelihood = -21411.464
Iteration 3:   log pseudolikelihood = -21156.197
Iteration 4:   log pseudolikelihood = -21149.073
Iteration 5:   log pseudolikelihood = -21149.018
Iteration 6:   log pseudolikelihood = -21149.018
Refining estimates:
Iteration 0:   log pseudolikelihood = -21149.018

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =   11,870,825             Number of obs    =  11,870,825
No. of failures      =        1,724
Time at risk         =   2182954615
                                                Wald chi2(39)    =     4099.30
Log pseudolikelihood =   -21149.018             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 6,752,811 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.124649   .0918634     1.44   0.150     .9582729    1.319911
               Kids under 18  |   1.188336   .1155728     1.77   0.076     .9820976    1.437883
                              |
                         age1 |   1.122492   .0258959     5.01   0.000     1.072868    1.174412
                         age2 |   .9566379   .0523901    -0.81   0.418     .8592741    1.065034
                         age3 |   .9857452   .1333722    -0.11   0.915     .7561298    1.285088
                       1.male |   1.887283   .0981555    12.21   0.000     1.704382    2.089811
                              |
                          imd |
                           2  |   1.098653   .0959131     1.08   0.281     .9258702     1.30368
                           3  |   1.249824   .1064677     2.62   0.009     1.057641    1.476929
                           4  |   1.469906   .1213064     4.67   0.000     1.250382    1.727971
             5 most deprived  |   1.659153   .1401469     5.99   0.000     1.406003    1.957882
                              |
                tot_adults_hh |
                           2  |     .97682   .0659544    -0.35   0.728       .85574    1.115032
                           3  |   1.329749   .0874288     4.33   0.000     1.168973    1.512637
                              |
           1.htdiag_or_highbp |   1.713134   .0956022     9.65   0.000     1.535641    1.911142
1.chronic_respiratory_disease |   1.952674   .1814363     7.20   0.000     1.627567    2.342722
                     1.asthma |    1.34907   .0929595     4.35   0.000      1.17864    1.544144
    1.chronic_cardiac_disease |   1.201685   .1024571     2.15   0.031     1.016755    1.420251
                              |
                      diabcat |
            T1DM, controlled  |   2.097419   .8032682     1.93   0.053     .9901309    4.443015
          T1DM, uncontrolled  |   2.775479    .576783     4.91   0.000     1.846913    4.170897
            T2DM, controlled  |   2.581094   .2058565    11.89   0.000     2.207577     3.01781
          T2DM, uncontrolled  |   3.999157   .3034479    18.27   0.000     3.446521    4.640405
          Diabetes, no HbA1c  |   3.821918   1.715876     2.99   0.003     1.585363    9.213699
                              |
            cancer_exhaem_cat |
                   Last year  |   .9986787   .3551851    -0.00   0.997     .4973839     2.00521
               2-5 years ago  |   .8801998   .1992337    -0.56   0.573     .5648217    1.371675
                    5+ years  |   .5844938   .1296758    -2.42   0.015     .3783836    .9028747
                              |
              cancer_haem_cat |
                   Last year  |   4.159718   2.102148     2.82   0.005     1.544906     11.2002
               2-5 years ago  |   4.481306   1.261453     5.33   0.000      2.58106    7.780566
                    5+ years  |   2.257297   .5978154     3.07   0.002     1.343257    3.793309
                              |
      1.chronic_liver_disease |   1.009812   .2109604     0.05   0.963     .6705261    1.520777
            1.stroke_dementia |   1.548198   .2033995     3.33   0.001     1.196733    2.002884
                1.other_neuro |   1.346286   .2769534     1.45   0.148     .8995616    2.014854
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.753172   .2054818     4.79   0.000     1.393345    2.205922
           Stage 4/5 egfr<30  |   1.670306   .4121699     2.08   0.038     1.029795    2.709201
                              |
                       1.esrd |   5.528172   1.162166     8.13   0.000     3.661313    8.346921
           1.other_transplant |   .4063502   .2989238    -1.22   0.221     .0961015    1.718188
                   1.asplenia |   2.673674    .825081     3.19   0.001     1.460268    4.895359
           1.ra_sle_psoriasis |   1.220032   .1139094     2.13   0.033      1.01601    1.465023
               1.other_immuno |   2.278346   .5183672     3.62   0.000     1.458663    3.558642
                              |
             shield#kids_cat3 |
             1#Kids under 12  |   1.123474   .1553442     0.84   0.400     .8567738    1.473193
             1#Kids under 18  |   1.056764   .1782154     0.33   0.743     .7593272    1.470709
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   4202.36 /        1 =    4202.3600

 ( 1)  1.shield#1.kids_cat3 = 0
 ( 2)  1.shield#2.kids_cat3 = 0

           chi2(  2) =    0.76
         Prob > chi2 =    0.6853

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.188336   .1155728     1.77   0.076     .9820976    1.437883
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.shield#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.25579   .1814235     1.58   0.115     .9461157    1.666824
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster not found)
file ./output/an_interaction_cox_models_covid_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_0.ster saved

         failure _d:  covid_icu
   analysis time _t:  (stime_covid_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -9681.7552
Iteration 1:   log pseudolikelihood = -9506.1058
Iteration 2:   log pseudolikelihood = -9413.4268
Iteration 3:   log pseudolikelihood = -9403.0466
Iteration 4:   log pseudolikelihood = -9402.1196
Iteration 5:   log pseudolikelihood = -9402.0794
Iteration 6:   log pseudolikelihood = -9402.0737
Iteration 7:   log pseudolikelihood = -9402.0716
Iteration 8:   log pseudolikelihood = -9402.0709
Iteration 9:   log pseudolikelihood = -9402.0706
Iteration 10:  log pseudolikelihood = -9402.0705
Iteration 11:  log pseudolikelihood = -9402.0705
Iteration 12:  log pseudolikelihood = -9402.0705
Iteration 13:  log pseudolikelihood = -9402.0705
Iteration 14:  log pseudolikelihood = -9402.0705
Iteration 15:  log pseudolikelihood = -9402.0705
Iteration 16:  log pseudolikelihood = -9402.0705
Iteration 17:  log pseudolikelihood = -9402.0705
Iteration 18:  log pseudolikelihood = -9402.0705
Iteration 19:  log pseudolikelihood = -9402.0705
Iteration 20:  log pseudolikelihood = -9402.0705
Iteration 21:  log pseudolikelihood = -9402.0705
Iteration 22:  log pseudolikelihood = -9402.0705
Iteration 23:  log pseudolikelihood = -9402.0705
Iteration 24:  log pseudolikelihood = -9402.0705
Iteration 25:  log pseudolikelihood = -9402.0705
Iteration 26:  log pseudolikelihood = -9402.0705
Iteration 27:  log pseudolikelihood = -9402.0705
Iteration 28:  log pseudolikelihood = -9402.0705
Iteration 29:  log pseudolikelihood = -9402.0705
Iteration 30:  log pseudolikelihood = -9402.0705
Iteration 31:  log pseudolikelihood = -9402.0705
Iteration 32:  log pseudolikelihood = -9402.0705
Iteration 33:  log pseudolikelihood = -9402.0705
Iteration 34:  log pseudolikelihood = -9402.0705
Iteration 35:  log pseudolikelihood = -9402.0705
Refining estimates:
Iteration 0:   log pseudolikelihood = -9402.0705
Iteration 1:   log pseudolikelihood = -9402.0705
Iteration 2:   log pseudolikelihood = -9402.0705
Iteration 3:   log pseudolikelihood = -9402.0705
Iteration 4:   log pseudolikelihood = -9402.0705

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   3,329,528
No. of failures      =          820
Time at risk         =    606783707
                                                Wald chi2(37)    =   481578.31
Log pseudolikelihood =   -9402.0705             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |   1.132742   .2288255     0.62   0.537     .7623945    1.682994
               Kids under 18  |   1.340001   .3595817     1.09   0.275      .791936    2.267359
                              |
                         age1 |   .9337251   .0263596    -2.43   0.015     .8834646     .986845
                         age2 |   1.269883   .1843063     1.65   0.100     .9554834    1.687734
                         age3 |   .3493562   .1525986    -2.41   0.016     .1484102    .8223807
                       1.male |   2.722518   .2152953    12.67   0.000     2.331623    3.178948
                              |
                          imd |
                           2  |   1.032015   .1130273     0.29   0.774     .8326479    1.279117
                           3  |   1.199982   .1306647     1.67   0.094     .9693675    1.485461
                           4  |   1.318491   .1502994     2.43   0.015     1.054497    1.648574
             5 most deprived  |   1.364203   .1690316     2.51   0.012     1.070067    1.739191
                              |
                tot_adults_hh |
                           2  |   1.180024   .1012129     1.93   0.054     .9974279    1.396047
                           3  |    1.15711   .1294693     1.30   0.192     .9292516     1.44084
                              |
           1.htdiag_or_highbp |   1.185851   .0957787     2.11   0.035     1.012233    1.389249
1.chronic_respiratory_disease |   1.312059   .1291735     2.76   0.006     1.081811     1.59131
                     1.asthma |   1.269902    .122719     2.47   0.013     1.050783    1.534714
    1.chronic_cardiac_disease |   .9691832   .0852683    -0.36   0.722     .8156758     1.15158
                              |
                      diabcat |
            T1DM, controlled  |   .6900848   .6930144    -0.37   0.712     .0964023    4.939893
          T1DM, uncontrolled  |   2.342448   .9654424     2.07   0.039     1.044351    5.254042
            T2DM, controlled  |   1.346803   .1329917     3.02   0.003     1.109816    1.634395
          T2DM, uncontrolled  |   2.048038   .2261808     6.49   0.000     1.649427    2.542979
          Diabetes, no HbA1c  |   2.11e-17   1.42e-18  -568.87   0.000     1.85e-17    2.41e-17
                              |
            cancer_exhaem_cat |
                   Last year  |   .8355021   .2815387    -0.53   0.594      .431637    1.617247
               2-5 years ago  |   .7453716    .155857    -1.41   0.160     .4947512    1.122946
                    5+ years  |    1.04385   .1319349     0.34   0.734     .8148027    1.337284
                              |
              cancer_haem_cat |
                   Last year  |   5.227994   2.154846     4.01   0.000     2.330728    11.72678
               2-5 years ago  |    3.57926   1.004363     4.54   0.000     2.065098    6.203627
                    5+ years  |   1.785633   .5056533     2.05   0.041     1.025062     3.11053
                              |
      1.chronic_liver_disease |   .5532389    .224167    -1.46   0.144     .2500427    1.224084
            1.stroke_dementia |   1.183511   .1570581     1.27   0.204     .9124593    1.535081
                1.other_neuro |   .8467354   .2285698    -0.62   0.538     .4988527     1.43722
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.297037   .1214522     2.78   0.005     1.079561    1.558322
           Stage 4/5 egfr<30  |   1.485862   .3706191     1.59   0.112     .9113033    2.422669
                              |
                       1.esrd |   3.884081    1.17388     4.49   0.000     2.147983    7.023373
           1.other_transplant |   2.841918   2.081309     1.43   0.154      .676433    11.93983
                   1.asplenia |   1.626306   .8236383     0.96   0.337     .6027174    4.388246
           1.ra_sle_psoriasis |   1.316293   .1537295     2.35   0.019     1.046987    1.654871
               1.other_immuno |   .8679518   .6219729    -0.20   0.843     .2130718    3.535617
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   2200.13 /        1 =    2200.1250

         failure _d:  covid_icu
   analysis time _t:  (stime_covid_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -9681.7552
Iteration 1:   log pseudolikelihood = -9505.7969
Iteration 2:   log pseudolikelihood = -9413.2043
Iteration 3:   log pseudolikelihood = -9402.8327
Iteration 4:   log pseudolikelihood = -9401.9082
Iteration 5:   log pseudolikelihood = -9401.8681
Iteration 6:   log pseudolikelihood = -9401.8624
Iteration 7:   log pseudolikelihood = -9401.8604
Iteration 8:   log pseudolikelihood = -9401.8596
Iteration 9:   log pseudolikelihood = -9401.8594
Iteration 10:  log pseudolikelihood = -9401.8593
Iteration 11:  log pseudolikelihood = -9401.8592
Iteration 12:  log pseudolikelihood = -9401.8592
Iteration 13:  log pseudolikelihood = -9401.8592
Iteration 14:  log pseudolikelihood = -9401.8592
Iteration 15:  log pseudolikelihood = -9401.8592
Iteration 16:  log pseudolikelihood = -9401.8592
Iteration 17:  log pseudolikelihood = -9401.8592
Iteration 18:  log pseudolikelihood = -9401.8592
Iteration 19:  log pseudolikelihood = -9401.8592
Iteration 20:  log pseudolikelihood = -9401.8592
Iteration 21:  log pseudolikelihood = -9401.8592
Iteration 22:  log pseudolikelihood = -9401.8592
Iteration 23:  log pseudolikelihood = -9401.8592
Iteration 24:  log pseudolikelihood = -9401.8592
Iteration 25:  log pseudolikelihood = -9401.8592
Iteration 26:  log pseudolikelihood = -9401.8592
Iteration 27:  log pseudolikelihood = -9401.8592
Iteration 28:  log pseudolikelihood = -9401.8592
Iteration 29:  log pseudolikelihood = -9401.8592
Iteration 30:  log pseudolikelihood = -9401.8592
Iteration 31:  log pseudolikelihood = -9401.8592
Iteration 32:  log pseudolikelihood = -9401.8592
Iteration 33:  log pseudolikelihood = -9401.8592
Iteration 34:  log pseudolikelihood = -9401.8592
Iteration 35:  log pseudolikelihood = -9401.8592
Iteration 36:  log pseudolikelihood = -9401.8592
Iteration 37:  log pseudolikelihood = -9401.8592
Iteration 38:  log pseudolikelihood = -9401.8592
Iteration 39:  log pseudolikelihood = -9401.8592
Iteration 40:  log pseudolikelihood = -9401.8592
Iteration 41:  log pseudolikelihood = -9401.8592
Iteration 42:  log pseudolikelihood = -9401.8592
Iteration 43:  log pseudolikelihood = -9401.8592
Iteration 44:  log pseudolikelihood = -9401.8592
Iteration 45:  log pseudolikelihood = -9401.8592
Refining estimates:
Iteration 0:   log pseudolikelihood = -9401.8592

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =    3,329,528             Number of obs    =   3,329,528
No. of failures      =          820
Time at risk         =    606783707
                                                Wald chi2(38)    =      566.14
Log pseudolikelihood =   -9401.8592             Prob > chi2      =      0.0000

                                    (Std. Err. adjusted for 2,523,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat3 |
               Kids under 12  |    1.14341   .2826952     0.54   0.588     .7042912    1.856316
               Kids under 18  |   1.160351    .417744     0.41   0.680     .5729861    2.349822
                              |
                         age1 |   .9336989   .0263577    -2.43   0.015     .8834419    .9868148
                         age2 |   1.270221   .1843477     1.65   0.099     .9557499    1.688164
                         age3 |   .3490715   .1524716    -2.41   0.016     .1482916     .821698
                       1.male |   2.722623   .2152981    12.67   0.000     2.331722    3.179058
                              |
                          imd |
                           2  |   1.031996   .1130211     0.29   0.774     .8326395    1.279084
                           3  |   1.199951   .1306585     1.67   0.094      .969347    1.485416
                           4  |   1.318267   .1502611     2.42   0.015     1.054339    1.648263
             5 most deprived  |   1.364047   .1690234     2.51   0.012     1.069927    1.739019
                              |
                tot_adults_hh |
                           2  |   1.179844   .1011984     1.93   0.054     .9972746    1.395836
                           3  |   1.157059   .1294579     1.30   0.192     .9292197    1.440762
                              |
           1.htdiag_or_highbp |   1.185705   .0957434     2.11   0.035     1.012147    1.389023
1.chronic_respiratory_disease |   1.307636   .1287855     2.72   0.006     1.078088    1.586059
                     1.asthma |   1.265276   .1224928     2.43   0.015     1.046597    1.529646
    1.chronic_cardiac_disease |    .969037   .0852779    -0.36   0.721     .8155157    1.151459
                              |
                      diabcat |
            T1DM, controlled  |   .6894911   .6924291    -0.37   0.711     .0963164    4.935797
          T1DM, uncontrolled  |   2.342094   .9653176     2.06   0.039     1.044174    5.253341
            T2DM, controlled  |    1.34686   .1330132     3.02   0.003     1.109838    1.634502
          T2DM, uncontrolled  |    2.04842   .2262024     6.49   0.000     1.649767    2.543403
          Diabetes, no HbA1c  |   5.23e-20          .        .       .            .           .
                              |
            cancer_exhaem_cat |
                   Last year  |   .8333411   .2810433    -0.54   0.589     .4302849    1.613948
               2-5 years ago  |   .7431802   .1557876    -1.42   0.157      .492791    1.120793
                    5+ years  |    1.04091   .1318565     0.32   0.752     .8120591    1.334253
                              |
              cancer_haem_cat |
                   Last year  |   5.217135   2.151056     4.01   0.000     2.325287    11.70543
               2-5 years ago  |   3.568586   1.002228     4.53   0.000     2.057967    6.188052
                    5+ years  |   1.780971   .5049856     2.04   0.042     1.021652    3.104637
                              |
      1.chronic_liver_disease |   .5532964    .224247    -1.46   0.144     .2500185    1.224457
            1.stroke_dementia |   1.183497   .1570258     1.27   0.204     .9124944    1.534985
                1.other_neuro |   .8466031   .2285561    -0.62   0.537     .4987494    1.437068
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.296878   .1214432     2.78   0.006     1.079419    1.558145
           Stage 4/5 egfr<30  |   1.485914   .3707508     1.59   0.112      .911193    2.423133
                              |
                       1.esrd |   3.867924   1.174052     4.46   0.000     2.133576    7.012095
           1.other_transplant |   2.839653   2.079406     1.43   0.154     .6760077     11.9283
                   1.asplenia |   1.624352   .8227136     0.96   0.338     .6019457    4.383317
           1.ra_sle_psoriasis |   1.316186   .1537182     2.35   0.019     1.046899    1.654739
               1.other_immuno |   .8662598   .6206907    -0.20   0.841     .2126899    3.528169
                              |
             shield#kids_cat3 |
             1#Kids under 12  |   .9738474   .3889573    -0.07   0.947     .4451627    2.130409
             1#Kids under 18  |   1.402844   .7312098     0.65   0.516     .5050497    3.896588
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
   1:   2280.61 /        1 =    2280.6050

 ( 1)  1.shield#1.kids_cat3 = 0
 ( 2)  1.shield#2.kids_cat3 = 0

           chi2(  2) =    0.43
         Prob > chi2 =    0.8074

kids_cat3 <66
****************

 ( 1)  2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.160351    .417744     0.41   0.680     .5729861    2.349822
------------------------------------------------------------------------------
kids_cat3 66+
****************

 ( 1)  2.kids_cat3 + 1.shield#2.kids_cat3 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.627792   .6327828     1.25   0.210     .7598104    3.487324
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster not found)
file ./output/an_interaction_cox_models_covid_icu_kids_cat3_shield_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_1.ster saved

. 
. log close
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_shield_covid_icu.log
  log type:  text
 closed on:   2 Sep 2020, 17:51:50
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
