------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\will\school-age-children-and-covid\analysis\log\10_an_interaction_cox_models_time_covid_death_icu.log
  log type:  text
 opened on:   2 Sep 2020, 14:14:47

. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6. stcox   `exposure'                                                              ///
>                         $demogadjlist                                                   ///
>                         $comordidadjlist                                                ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  7.         timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. 
. use "$tempdir\cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  3. 
. *Split data by time of study period: days to April 3rd (31 d March, 3d April)
. stsplit cat_time, at(0,34, 200)
  4. recode cat_time 34=1 200=2 
  5. recode `outcome' .=0 
  6. tab cat_time
  7. tab cat_time `outcome'
  8.  
. /*Overlapping time periods
> gen cat_time0=1 if cat==0
> gen cat_time1=1 if cat==0 | cat==0.25
> */
.         
. 
. 
. foreach int_type in cat_time  {
  9. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat3  {
 10. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 11. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3") interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type')
 12. if _rc==0{
 13. testparm 1.`int_type'#i.`exposure_type'
 14. di _n "`exposure_type' <66" _n "****************"
 15. lincom 2.`exposure_type', eform
 16. di "`exposure_type' 66+" _n "****************"
 17. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 18. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_MAINFULLYADJMODEL_agespline_bmicat_noeth_ageband_`x', replace
 19. }
 20. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 21. 
. }
 22. 
. }
 23. 
. }
(12,052,717 observations (episodes) created)
(cat_time: 12052717 changes made)
(covid_death_icu: 12052717 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 12,054,790       50.00       50.00
          1 | 12,052,717       50.00      100.00
------------+-----------------------------------
      Total | 24,107,507      100.00

           |   Failure/censoring
           |     indicator for
           |    outcome: covid
Observatio |       icu/death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |12,054,788          2 |12,054,790 
         1 |12,050,001      2,716 |12,052,717 
-----------+----------------------+----------
     Total |24,104,789      2,718 |24,107,507 

         failure _d:  covid_death_icu
   analysis time _t:  (stime_covid_death_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

op. sys. refuses to provide memory
r(909);

end of do-file

r(909);

